{
  "id": "3574421",
  "permalink": "account-management",
  "title": "Account Management",
  "type": "topic",
  "level": 2,
  "path": "Manhattan Active® Enterprise Promise &amp; Fulfill/Process &amp; Configuration Guides/Account Management",
  "raw_item": {
    "id": "3574421",
    "text": "Account Management",
    "title": "Account Management",
    "permalink": "account-management",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "456130",
    "parent": "f;456130",
    "created_date": "1741888999",
    "modified_date": "1751547628",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "2"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3574402\" href=\"/enterprise-promise-and-fulfill\" class=\"breadcrumb-links\">Manhattan Active® Enterprise Promise &amp; Fulfill</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3574403\" href=\"/epf-process-configuration-guides\" class=\"breadcrumb-links\">Process &amp; Configuration Guides</a></li><li> <span>››</span>Account Management</li></ul>  \t\r\n\t\t<h2><a name=\"account-management\" id=\"account-management\"></a>Account Management</h2>\r\n\r\n<p></p>\r\n\r\n<a href=\"/b2b-pricing\" hqid=\"3629862\">Previous</a>&nbsp;I&nbsp;\r\n<div class=\"info\"><ul><li><a href=\"/account-management$account-management\">Account Management</a><ul><li><a href=\"/account-management$overview\">Overview</a></li><li><a href=\"/account-management$process-flow\">Process Flow</a><ul><li><a href=\"/account-management$account-credit-status\">Account Credit Status</a></li><li><a href=\"/account-management$allocation-strategy\">Allocation Strategy</a></li><li><a href=\"/account-management$fill-rates\">Fill Rates</a></li><li><a href=\"/account-management$fulfillment-instructions\">Fulfillment Instructions</a></li><li><a href=\"/account-management$single-delivery-nbsp-releases\">Single Delivery&nbsp;Releases</a></li><li><a href=\"/account-management$hold-release-until-all-units-allocated\">Hold Release Until All Units Allocated</a></li><li><a href=\"/account-management$release-consolidation\">Release Consolidation</a></li></ul></li><li><a href=\"/account-management$configuration\">Configuration</a><ul><li><a href=\"/account-management$account-credit-status-configuration\">Account Credit Status Configuration</a></li><li><a href=\"/account-management$allocation-strategy-configuration\">Allocation Strategy Configuration</a></li><li><a href=\"/account-management$fill-rate-configuration\">Fill Rate Configuration</a></li><li><a href=\"/account-management$release-consolidation-configuration\">Release Consolidation Configuration</a></li><li><a href=\"/account-management$fulfillment-instruction-configuration\">Fulfillment Instruction Configuration</a></li><li><a href=\"/account-management$single-delivery-releases-nbsp-configuration\">Single Delivery Releases&nbsp;Configuration</a></li><li><a href=\"/account-management$hold-release-until-all-units-allocated-configuration\">Hold Release Until All Units Allocated Configuration</a></li></ul></li><li><a href=\"/account-management$implementation-flavors\">Implementation Flavors</a><ul><li><a href=\"/account-management$account-credit-status\">Account Credit Status</a></li></ul></li><li><a href=\"/account-management$uis-and-entities\">UIs and Entities</a></li><li><a href=\"/account-management$services\">Services</a></li><li><a href=\"/account-management$grants\">Grants</a></li><li><a href=\"/account-management$troubleshooting\">Troubleshooting</a><ul><li><a href=\"/account-management$my-orders-are-not-updated-with-the-latest-account-credit-status-of-my-customer\">My orders are not updated with the latest account credit status of my customer</a></li></ul></li></ul></li></ul></div>\r\n\r\n<h3><a name=\"overview\" id=\"overview\"></a>Overview</h3>\r\n\r\n<p data-end=\"439\" data-start=\"118\">Accounts serve as records for retailer customers and their divisions, providing a centralized location for storing essential customer information and preferences. Account data is used to facilitate seamless communication, ensure accurate fulfillment, and maintain a tailored customer experience.</p>\r\n\r\n<p data-end=\"725\" data-start=\"441\">Each account contains key details, including company information, primary contacts, and specific preferences related to communication and order fulfillment. By maintaining well-structured account data, operational efficiency is improved, and business relationships are strengthened.</p>\r\n\r\n<p data-end=\"912\" data-start=\"727\">This documentation outlines the processes involved in managing accounts, updating customer details, configuring preferences, and utilizing account data to support business operations.</p>\r\n\r\n<ul>\r\n</ul>\r\n\r\n<h3><a name=\"process-flow\" id=\"process-flow\"></a>Process Flow</h3>\r\n\r\n<p><div class=\"toggle_outerdiv\"><p class=\"toggle_div\"><a href=\"#tg-1\" class=\"toggle-content\"><span class=\"toggle-title\">Account credit status propagation - process flow</span></a></p><div id=\"tg-1\"><p><img align=\"left\" alt=\"\" border=\"2\" class=\"\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/2025/Screenshot_2025-03-20_at_17_03_52.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1LzIwMjUvU2NyZWVuc2hvdF8yMDI1LTAzLTIwX2F0XzE3XzAzXzUyLnBuZyIsIkNvbmRpdGlvbiI6eyJEYXRlTGVzc1RoYW4iOnsiQVdTOkVwb2NoVGltZSI6MTc1NDc1MjMzMH19fV19&Signature=l49A-IzT-jBNyn1G2wZyx~YT-slvmJreqQFb4lnvGO2Ag3HT~X~aZDLMM5D49wjREKLJYBgK680fhi5G4bLOEX-hWwiTWUjy08KZHifEY5DskdTjWhWQW-PuyGG9IH3Q7wxN7xXmkZ4GkDPNS09CLH0vzI75raYtiTSgDBpf~rGffIDLvxuKg9WYc938hMu2pVytXHptNO6dxqEJC-1ZFGwJASGt9Z3GaBIOjZIYQfqSIFA08gl-otuPT3Vsl~QZULkFNkPwHJzzFQ58w0XwdIER-4UKjIgl9X2TV0M7pRwxYFUo28bnRnUfSWHmbXUmAL-yeUUlJGxc6knvNmKrOg__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"margin-right:5px;padding:5px;\" /></p>\n\n\n</div></div></p>\r\n\r\n<h4><a name=\"account-credit-status\" id=\"account-credit-status\"></a>Account Credit Status</h4>\r\n\r\n<p data-end=\"490\" data-start=\"176\"><strong data-end=\"205\" data-start=\"180\">Account Credit Status</strong>&nbsp;enables the management of customer financial standing within the system. This status is used to determine whether a customer’s orders can proceed to fulfillment or should be placed on hold due to financial constraints such as overdue payments or credit limits being reached.</p>\r\n\r\n<p data-end=\"832\" data-start=\"492\">When an account’s credit status is set to a value that should prevent the release, all unfulfilled and newly imported orders for that account are automatically placed on hold, preventing their release. Orders remain held until the credit status is resolved. Configuration options allow businesses to define which credit statuses require order holds and specify the types of holds applied.</p>\r\n\r\n<p data-end=\"864\" data-start=\"834\">Key functionalities include:</p>\r\n\r\n<ul data-end=\"1219\" data-start=\"865\">\r\n\t<li data-end=\"931\" data-start=\"865\">Automatic propagation of credit status changes to unfulfilled orders.</li>\r\n\t<li data-end=\"999\" data-start=\"932\">Configurable credit status values and corresponding hold types.</li>\r\n\t<li data-end=\"1219\" data-start=\"1157\">Manual override capability to remove holds on the orders when necessary.</li>\r\n</ul>\r\n\r\n<h4 sandboxuid=\"0\"><a name=\"allocation-strategy\" id=\"allocation-strategy\"></a>Allocation Strategy</h4>\r\n\r\n<p>An account-level allocation strategy allows specific accounts to configure&nbsp;different strategies for allocating units and processing back-ordered units. The following options are available for allocation strategies:</p>\r\n\r\n<h5>Fill And&nbsp;Kill - Multi Locations</h5>\r\n\r\n<p>The fill and kill multi-locations strategy&nbsp;attempts to allocate as many units in a fulfillment group as possible from one or more fulfillment locations. Any remaining units in a fulfillment group that are not allocatable are cancelled. This functions as an account-level override of the '<a href=\"https://omni.helpdocsonline.com/order-cancellation$how-to-cancel-back-ordered-units\">cancel backordered units</a>' functionality in order configuration. However, when using this at the account level, all doc types can be used.</p>\r\n\r\n<h5>Fill Or Kill - Single Location</h5>\r\n\r\n<p>The fill or kill single location strategy attempts&nbsp;to allocate as many units in a fulfillment group as possible from a single location using a '<a href=\"https://omni.helpdocsonline.com/promising-overview$strategy-type-complete-single-source\">Complete Single Source</a>' optimization strategy. If ALL units in a fulfillment group are not allocatable from a single location, the entire fulfillment group is cancelled.</p>\r\n\r\n<h5>Fill Or Kill - Multi Locations</h5>\r\n\r\n<p>The fill or kill single location strategy attempts&nbsp;to allocate as many units in a fulfillment group as possible from one or multiple locations&nbsp;using a 'Complete Multi Source' optimization strategy. If ALL units in a fulfillment group are not allocatable from multiple&nbsp;locations, the entire fulfillment group is cancelled.</p>\r\n\r\n<h4 sandboxuid=\"0\"><a name=\"fill-rates\" id=\"fill-rates\"></a>Fill Rates</h4>\r\n\r\n<p>The Fill Rate&nbsp;feature provides the ability to prevent any units from being released until a certain percent&nbsp;of the units on the Order or Order Line are allocated against inventory indicated by the Demand Type.</p>\r\n\r\n<p>There are two possible Fill Rate strategies: 'Order' and 'Order Line.' The 'Order' strategy can be used if no units are released until a certain percent&nbsp;of units across the entire order are allocated to inventory in the Demand Type. 'Order Line' strategy can be used if no units should get released until a certain percent of units on each order line are allocated against inventory in the Demand Type.&nbsp;For 'Order Line' strategy, every single order line must meet the fill rate before any units on the order get released.</p>\r\n\r\n<p>This configuration at the Customer level overrides the Fill Rate configuration at the <a href=\"https://omni.helpdocsonline.com/release-grouping-and-creation$fill-rates\">Release Configuration</a>.&nbsp;</p>\r\n\r\n<h4><a name=\"fulfillment-instructions\" id=\"fulfillment-instructions\"></a>Fulfillment Instructions</h4>\r\n\r\n<p sandboxuid=\"0\">Instructions can be defined at the account level to provide&nbsp;standard order fulfillment guidelines for orders on a particular account. Each instruction consists of an&nbsp;<strong sandboxuid=\"0\">Instruction Type</strong>&nbsp;(example, Packing Instruction) and a specific&nbsp;<strong sandboxuid=\"0\">Instruction Text</strong>. When a new order is placed for an account, these pre-configured instructions are automatically copied to the order and can be sent to the fulfillment system on the release outbound. Fulfillment instructions persist from the account to the order as order notes. The instruction types available for an account are the list of eligible note types where the note category is \"Instruction\".</p>\r\n\r\n<h4 sandboxuid=\"0\"><a name=\"single-delivery-nbsp-releases\" id=\"single-delivery-nbsp-releases\"></a>Single Delivery&nbsp;Releases</h4>\r\n\r\n<p>The single delivery&nbsp;(deliver together strategy) preference is an account-level override of the deliver together and minimize shipment release configurations. When this is enabled for a particular account, orders placed for that account will only release allocations when all allocated units are reserved to the configured demand type. For example, if the release configuration demand type is \"Allocation\", and an order has 10 units allocated, 6 to On Hand (allocation) supply and 4 to On Order (future) supply, no release will be created until the 4 On Order units are converted to on-hand units. For more details on the release behavior, refer to <a href=\"https://omni.helpdocsonline.com/release-grouping-and-creation$release-config-template-hold-the-release-until-the-units-allocated-across-all-locations-are-eligible-nbsp-nbsp-by-fulfillment-group\">Release Grouping and Creation</a>.</p>\r\n\r\n<h4><a name=\"hold-release-until-all-units-allocated\" id=\"hold-release-until-all-units-allocated\"></a>Hold Release Until All Units Allocated</h4>\r\n\r\n<p>Holding&nbsp;the release until all units are allocated (release grouping strategy) is an account level configuration option under release configuration. When this is enabled for a particular account,&nbsp;no units are released until every unit on the order is allocated (regardless of demand type). If configured in combination with Fill Rate, then Fill Rate takes precedence over the first release, while the second and final release will not occur until all remaining units in the order are allocated (regardless of demand type). For more details on the release behavior, refer to <a href=\"https://omni.helpdocsonline.com/release-grouping-and-creation$release-config-template-hold-the-release-until-all-the-units-on-the-order-are-allocated\">Release Grouping and Creation</a>.</p>\r\n\r\n<h4><a name=\"release-consolidation\" id=\"release-consolidation\"></a>Release Consolidation</h4>\r\n\r\n<p>If Release Consolidation is enabled, orders having common attributes are consolidated together into one release which is sent to the fulfillment system just in time to be processed at the fulfillment facility before the next carrier pick-up time. This way, multiple releases are not sent out leading up to the shipment, and instead only one release per logical grouping of orders is sent to the DC (this feature is only supported for Distribution Centers).</p>\r\n\r\n<p><span style=\"font-size:14px;\"><strong>Release Consolidation Process</strong></span></p>\r\n\r\n<p>Orders that will get consolidated together must share the following attributes:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"772\">Customer Id</li>\r\n\t<li data-renderer-start-pos=\"787\">Delivery Method</li>\r\n\t<li data-renderer-start-pos=\"806\">Carrier</li>\r\n\t<li data-renderer-start-pos=\"817\">Service Level</li>\r\n\t<li data-renderer-start-pos=\"835\">Destination Address</li>\r\n\t<li data-renderer-start-pos=\"858\">ShipFromLocation</li>\r\n\t<li data-renderer-start-pos=\"878\">ReleaseGroupId</li>\r\n</ul>\r\n\r\n<p>In addition to sharing the above attributes, orders are consolidated together that are created within the same timeframe, which can roughly be defined by the time between&nbsp;Carrier Pick Times (configured in Location Scheduling UI or Inventory Location UI). For example, if the Carrier Pick Up happens once a week, then orders placed within the week between Carrier pick-ups&nbsp;are generally consolidated together. There will be some variation to this general rule, because processing times&nbsp;must also be considered when determining if orders can be consolidated together. A&nbsp;consolidated release is sent to the fulfillment facility with enough buffer time so that processing can be completed before the Carrier Pick Up time arrives.&nbsp;</p>\r\n\r\n<p>All processing times are considered when determining how many minutes before the Carrier Pick Time a consolidated group of orders should be released. Refer to&nbsp;<a href=\"https://omni.helpdocsonline.com/how-scheduling-works$factors-affecting-the-backward-scheduling-dates\">Factors impacting Backward Scheduling</a> and <a href=\"https://omni.helpdocsonline.com/how-scheduling-works$factors-affecting-the-forward-scheduling-dates\">Factors Impacting Forward Scheduling</a> guides to see a list of these based on whether you are using <a href=\"https://omni.helpdocsonline.com/how-scheduling-works$backward-scheduling\">Backwards </a>or&nbsp;<a href=\"https://omni.helpdocsonline.com/how-scheduling-works$forward-scheduling\">Forwards</a> Scheduling.</p>\r\n\r\n<p>For each order that is going to be consolidated, a ConsolidationStartTime and a ReleaseDate are determined during the allocation process and are stored in the Allocation section of the Order.</p>\r\n\r\n<ul>\r\n\t<li><strong>ReleaseDate </strong>represents the time an order must be released to the DC in order to have enough time to be processed and still make it onto the optimal truck at the Carrier Pick Time. The ReleaseDate is calculated by subtracting all the processing times from the Ship Date. For more information on how dates are calculated please review all the sections of&nbsp; <a href=\"https://omni.helpdocsonline.com/how-scheduling-works$backward-scheduling\">Backwards </a>and&nbsp;<a href=\"https://omni.helpdocsonline.com/how-scheduling-works$forward-scheduling\">Forwards</a> Scheduling pages.</li>\r\n\t<li><strong>ConsolidationStartTime </strong>represents the time an order will be sent to the consolidation engine. This happens 15 minutes before the ReleaseDate by default, but can be configured in the Location Scheduling UI using the ConsolidationDuration parameter (in minutes).</li>\r\n</ul>\r\n\r\n<p>A new status, \"Preparing Release,\"&nbsp;indicates that an order has been sent to the consolidation engine. Once an order is in \"Preparing Release\" status, it cannot be edited or canceled. Inside the consolidation engine, orders that share the common attributes listed above, and that share the same optimal Carrier Pick Time, are consolidated together and the Release Date of the final consolidated release is determined (it might be slightly earlier if some orders in the same batch had items with higher processing times).</p>\r\n\r\n<p>The optimal Carrier Pick Time will vary depending if backwards scheduling or forwards scheduling is being used.</p>\r\n\r\n<p>If backwards scheduling is being used, then the Requested Delivery Date (RDD) becomes the driving factor in determining the optimal Carrier Pick Time. The Ship Date is determined by working backwards from the RDD, and then the Release Date is determined by working backwards from the Ship Date. Finally, ConsolidationStartTime is determined by working backwards from the Release Date.</p>\r\n\r\n<p><strong>Backwards Scheduling Example: </strong></p>\r\n\r\n<ul>\r\n\t<li>Transit Time is 4 hours</li>\r\n\t<li>Location Processing Time is 1 hour</li>\r\n\t<li>Carrier Pick Up happens every Monday</li>\r\n\t<li>The carrier is coming on Monday June&nbsp;7&nbsp;and Monday June 14</li>\r\n\t<li>An order is placed on Sunday June 6 with an RDD of Wednesday June 16</li>\r\n</ul>\r\n\r\n<p>Result: The Ship Date will be determined to be Monday June 14 (not Monday June 7), because it is the latest Carrier Pick Time when the RDD can still be met considering transit time, and it is also far enough in the future where the processing time can still be met.&nbsp;</p>\r\n\r\n<p>If forward scheduling is being used in combination with Release Consolidation, then the optimal Carrier Pick Time will be the earliest possible Carrier Pick Time when the order still has time to be processed at the fulfillment facility beforehand.</p>\r\n\r\n<p><strong>Forwards Scheduling Example:</strong></p>\r\n\r\n<ul>\r\n\t<li>Transit Time is 4 hours</li>\r\n\t<li>Location Processing Time is 1 hour</li>\r\n\t<li>Carrier Pick Up happens every Monday</li>\r\n\t<li>The carrier is coming Monday June&nbsp;7&nbsp;and Monday June 14</li>\r\n\t<li>An Order is placed on Sunday June 6 with no RDD</li>\r\n</ul>\r\n\r\n<p>Result: The Ship Date will be determined to be Monday June 7, because it is the earliest Carrier Pick Time when the processing time can still be met.&nbsp;</p>\r\n\r\n<div class=\"tip\">\r\n<p>Notes:</p>\r\n\r\n<ul data-indent-level=\"1\">\r\n\t<li>If there are multiple merge legs, Release Consolidation is only performed for the first leg of the shipment.</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"1434\">Substitution is not supported in combination with Release Consolidation.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"1555\">If using Consolidation with Remorse Period, the 'Do Not Release Before Date' functions as a 'Do Not Prepare Release Before Date'</p>\r\n\t</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"1687\">A maximum of 1000 order lines per consolidated release is supported. If more than 1000 lines need&nbsp;to be consolidated, a second release will be created for the next 1000 order lines.</p>\r\n\t</li>\r\n</ul>\r\n</div>\r\n\r\n<h3><a name=\"configuration\" id=\"configuration\"></a>Configuration</h3>\r\n\r\n<ul>\r\n</ul>\r\n\r\n<h4><a name=\"account-credit-status-configuration\" id=\"account-credit-status-configuration\"></a><a id=\"configuration 1\" name=\"configuration 1\"></a>Account Credit Status Configuration</h4>\r\n\r\n<p><strong>Account credit status:</strong> Lists the possible values for the account credit status and can be configured by the retailer. The values can be configured using the <a href=\"https://omni.helpdocsonline.com/account-management-ui$account-credit-status\">UI</a> or the API below.&nbsp;</p>\r\n\r\n<p><div class=\"toggle_outerdiv\"><p class=\"toggle_div\"><a href=\"#tg-2\" class=\"toggle-content\"><span class=\"toggle-title\">Account credit status API</span></a></p><div id=\"tg-2\"><p>POST:&nbsp;{{url}}/customer/api/customer/accountCreditStatus</p>\n\n<div class=\"computer_code\">{<br />\n&nbsp; &quot;AccountCreditStatusId&quot;: &quot;OverLimit&quot;,<br />\n&nbsp; &quot;Name&quot;: &quot;Billing Error: Over limit&quot;,<br />\n&nbsp; &quot;Description&quot;: &quot;Applies to customers with a billing account over its limit&quot;<br />\n}</div>\n\n<p>Read only grant for this API is&nbsp;<strong>api::customer::config::read.</strong></p>\n\n<p>Admin grant for this API is&nbsp;<strong>api::customer::config::admin</strong>.</p>\n</div></div></p>\r\n\r\n<p><strong>Account credit status holds:</strong>&nbsp;Links the account credit status to a specific hold type if required. See <a href=\"http://omni.helpdocsonline.com/order-hold-and-unhold\">here for more information about holds</a>. The values can be configured in the <a href=\"https://omni.helpdocsonline.com/account-management-ui$account-credit-status-holds\">UI</a> or the API below.</p>\r\n\r\n<p><div class=\"toggle_outerdiv\"><p class=\"toggle_div\"><a href=\"#tg-3\" class=\"toggle-content\"><span class=\"toggle-title\">Account credit status hold API</span></a></p><div id=\"tg-3\"><p>POST&nbsp;{{url}}/order/api/order/accountCreditStatusHold/save</p>\n\n<div class=\"computer_code\">\n<p>{<br />\n&nbsp; &nbsp;&quot;AccountCreditStatusId&quot;: &quot;BillingWarning&quot;,<br />\n&nbsp; &nbsp;&quot;HoldTypeId&quot;: &quot;BillingWarning&quot;<br />\n}</p>\n</div>\n\n<p>There is a validation that the Account credit status ID should exist in the Account credit status entity and that the hold type Id should exist in the hold type configuration entity.</p>\n\n<p>Read only grant for this API is&nbsp;<strong>api::order::config::read</strong>.</p>\n\n<p>Admin grant for this API is&nbsp;<strong>api::order::config::admin</strong>.</p>\n</div></div></p>\r\n\r\n<p><strong>Release configuration</strong>: If a specific hold tied to an account credit status needs to prevent the release of orders, it is expected that the release configuration filters what orders can be released based on the hold types.&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>See <a href=\"https://omni.helpdocsonline.com/release\">here</a> for more information about the release process.</li>\r\n\t<li>See <a href=\"https://omni.helpdocsonline.com/order-fulfillment-configuration-2$release-configuration\">here</a> for more information on how to configure the release template in the UI.&nbsp;</li>\r\n</ul>\r\n\r\n<h4><a name=\"allocation-strategy-configuration\" id=\"allocation-strategy-configuration\"></a>Allocation Strategy Configuration</h4>\r\n\r\n<p>To configure an allocation strategy&nbsp;preference for an account, select one of the available options from the <strong>Allocation Strategy&nbsp;</strong>list in the \"<strong>Preferences</strong>\" tab of the B2B Accounts UI. This can also be added via API using one of the following values:</p>\r\n\r\n<div class=\"computer_code\">POST&nbsp;{{url}}/customer/api/customer/customer/save<br>\r\n<br>\r\n{<br>\r\n&nbsp; &nbsp; \"CustomerId\": \"M43456_3\",<br>\r\n&nbsp; &nbsp; \"FulfillmentPreferences\": {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; \"AllocationStrategy\": \"FillAndKillMulti\"<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; //\"AllocationStrategy\": \"FillOrKillSingle\"<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; //\"AllocationStrategy\": \"FillOrKillMulti\"<br>\r\n&nbsp; &nbsp; }<br>\r\n}</div>\r\n\r\n<h4><a name=\"fill-rate-configuration\" id=\"fill-rate-configuration\"></a>Fill Rate Configuration</h4>\r\n\r\n<p>To configure a Fill Rate, all three of the below properties must be set in the <strong>\"Preferences\"</strong> tab of the B2B Accounts UI.</p>\r\n\r\n<p><strong>Fill Rate Strategy:&nbsp;</strong>Indicates whether the fill rate is honored at the order level or order line level. If Fill Rate Strategy is 'Order', no units are released until the fill rate is met, considering total units of the order across all lines. If Fill Rate Strategy is 'Order Line', no units are released until every line in the order meets the fill rate. 'FillRateType' and 'FillRateValue' must be populated as well for the Fill Rate feature to be honored.</p>\r\n\r\n<p><strong>Fill Rate Type:</strong>&nbsp;Indicates the type of Fill Rate that should be used. For example, if Fill Rate Type is 'PercentUnits', then the 'FillRateValue' will represent the percent of units that must be allocated to releasable inventory before any units on the order are released. 'FillRateValue' and 'FillRateStrategy' must be populated as well for the Fill Rate feature to be honored.</p>\r\n\r\n<p><strong>Fill Rate Threshold:</strong>&nbsp;Indicates the fill rate threshold. For example, if Fill Rate Type is 'PercentUnits', then the Fill Rate Value represents the percent of units that must be allocated to releasable inventory before any units on the order are released (if 70% is the fill rate, then populate Fill Rate Value as '70'). 'FillRateType' and 'FillRateStrategy' must be populated must be populated as well for the Fill Rate feature to be honored.</p>\r\n\r\n<h4><a name=\"release-consolidation-configuration\" id=\"release-consolidation-configuration\"></a>Release Consolidation Configuration</h4>\r\n\r\n<p>To configure Release Consolidation for a specific Customer, enable the \"Consolidate Orders\" check box in the <strong>\"Preferences\"</strong> tab of the B2B Accounts UI. In addition to configuring at a Customer level, this feature must be enabled at the DC level. To do this, go to the Fulfillment Location Configuration UI, click on the Fulfillment Location Config Id of \"Distribution Centers\" and enable the \"Support Release Consolidation\" check box.</p>\r\n\r\n<p>While not required for Release Consolidation, many configurations impact the Release Date of the consolidated group of orders. Most notably, the Carrier Pick Times in the Location Scheduling UI and in the Inventory Location UI dictate when the 'next' truck is coming, and therefore how long orders should consolidate before getting released to the fulfillment center so they have time to get processed before the next truck arrives at the Carrier Pick Time.&nbsp;</p>\r\n\r\n<p>Additionally, all the processing time configurations and location scheduling configurations impact the decision of when a consolidated group of orders is released. This is to ensure the orders are released in time to be processed before the Carrier Pick Time. See <a href=\"https://omni.helpdocsonline.com/how-scheduling-works$overview\">How Scheduling Works</a> to understand all the configurations that impact date calculation.<br>\r\n.&nbsp; &nbsp;&nbsp;</p>\r\n\r\n<h4><a name=\"fulfillment-instruction-configuration\" id=\"fulfillment-instruction-configuration\"></a>Fulfillment Instruction Configuration</h4>\r\n\r\n<h5>Add Instruction&nbsp;Order Note Types</h5>\r\n\r\n<p>To add additional instruction types for configuration on an account, add a new order <a href=\"https://omni.helpdocsonline.com/order-orchestration-configuration$note-type-note-category-configuration\">Note Type</a>, in the Note Types UI. Be sure to define the \"Note Category\" as Instruction for any note types that need to be used as account level fulfillment instructions. For example:</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 395px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\" style=\"width: 152px;\">Name</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 239px;\">Value</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 137px;\">Note Type Id</td>\r\n\t\t\t<td style=\"width: 225px;\">PackingInstruction</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 137px;\">Note Category Id</td>\r\n\t\t\t<td style=\"width: 225px;\"><strong>Instruction</strong></td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 137px;\">Description</td>\r\n\t\t\t<td style=\"width: 225px;\">Instruction note for packing instructions.</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h5>Add Instructions to the Account</h5>\r\n\r\n<p>Instructions can be added to a specific account in the B2B Accounts UI, <strong>Instructions</strong>&nbsp;tab. They can also be added via API:</p>\r\n\r\n<div class=\"computer_code\">POST&nbsp;{{url}}/customer/api/customer/customer/save<br>\r\n<br>\r\n{<br>\r\n&nbsp; &nbsp; \"CustomerId\": \"M43456_3\",<br>\r\n&nbsp; &nbsp; \"FulfillmentInstruction\": [<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"InstructionNoteText\": \"Double-box all shipments.\",<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"InstructionNoteType\": \"PackingInstruction\"<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; }<br>\r\n&nbsp; &nbsp; ]<br>\r\n}</div>\r\n\r\n<h4><a name=\"single-delivery-releases-nbsp-configuration\" id=\"single-delivery-releases-nbsp-configuration\"></a>Single Delivery Releases&nbsp;Configuration</h4>\r\n\r\n<p>To configure the single delivery release fulfillment preference for an account, select \"<strong>FulfillmentGroup</strong>\" for the <strong>Deliver Together Strategy</strong>&nbsp;in the \"<strong>Preferences</strong>\" tab of the B2B Accounts UI. This can also be added via API:</p>\r\n\r\n<div class=\"computer_code\">POST&nbsp;{{url}}/customer/api/customer/customer/save<br>\r\n<br>\r\n{<br>\r\n&nbsp; &nbsp; \"CustomerId\": \"M43456_3\",<br>\r\n&nbsp; &nbsp; \"FulfillmentPreferences\": {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; \"DeliverTogetherStrategy\": \"FulfillmentGroup\"<br>\r\n&nbsp; &nbsp; }<br>\r\n}</div>\r\n\r\n<h4><a name=\"hold-release-until-all-units-allocated-configuration\" id=\"hold-release-until-all-units-allocated-configuration\"></a>Hold Release Until All Units Allocated Configuration</h4>\r\n\r\n<p>To configure holding the release until all units are allocated&nbsp;for an account, select the \"<strong>Order</strong>\" option for the <strong>Release Grouping Strategy</strong>&nbsp;in the \"<strong>Preferences</strong>\" tab of the B2B Accounts UI. This can also be added via API:</p>\r\n\r\n<div class=\"computer_code\">\r\n<p>POST&nbsp;{{url}}/customer/api/customer/customer/save</p>\r\n\r\n<p>{<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;\"CustomerId\": \"M43456_3\",<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;\"FulfillmentPreferences\": {<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\"ReleaseGroupingStrategy\": \"Order\"<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;}<br>\r\n}</p>\r\n</div>\r\n\r\n<h3><a name=\"implementation-flavors\" id=\"implementation-flavors\"></a>Implementation Flavors</h3>\r\n\r\n<h4><a name=\"account-credit-status\" id=\"account-credit-status\"></a>Account Credit Status</h4>\r\n\r\n<ul>\r\n\t<li data-end=\"322\" data-start=\"50\">\r\n\t<p data-end=\"322\" data-start=\"52\"><strong data-end=\"127\" data-start=\"52\">I want to prevent order fulfillment for customers with unpaid invoices.</strong><br data-end=\"130\" data-start=\"127\">\r\n\tConfigure <strong data-end=\"170\" data-is-only-node=\"\" data-start=\"145\">Account Credit Status</strong> to move accounts with overdue invoices to \"Credit Hold\" and apply an <strong data-end=\"270\" data-start=\"240\">Account Credit Status Hold</strong> to prevent order release until payments are made.</p>\r\n\t</li>\r\n\t<li data-end=\"581\" data-start=\"324\">\r\n\t<p data-end=\"581\" data-start=\"326\"><strong data-end=\"387\" data-start=\"326\">I want to enforce credit limits to control customer risk.</strong><br data-end=\"390\" data-start=\"387\">\r\n\tSet up <strong data-end=\"429\" data-is-only-node=\"\" data-start=\"402\">credit limit thresholds</strong> in the external financial system, use API integration to update the <strong data-end=\"523\" data-start=\"498\">Account Credit Status</strong>, and block new order releases when limits are exceeded.</p>\r\n\t</li>\r\n\t<li data-end=\"1299\" data-start=\"1071\">\r\n\t<p data-end=\"1299\" data-start=\"1073\"><strong data-end=\"1136\" data-start=\"1073\">I want to allow controlled order releases for key accounts.</strong><br data-end=\"1139\" data-start=\"1136\">\r\n\tImplement <strong data-end=\"1177\" data-is-only-node=\"\" data-start=\"1154\">manual hold removal</strong> for specific orders</p>\r\n\t</li>\r\n</ul>\r\n\r\n<h3><a name=\"uis-and-entities\" id=\"uis-and-entities\"></a>UIs and Entities</h3>\r\n\r\n<p>The configuration UIs mentioned in this document are listed in the following table,&nbsp;along with information to&nbsp;navigate&nbsp;to the API documentation.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" height=\"72\" width=\"741\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><strong>UI Name</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Component</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Group</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Seed Data Present?</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Seed Data Profile</strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Account Credit Status</td>\r\n\t\t\t<td>Customer</td>\r\n\t\t\t<td>cus::customerConfig</td>\r\n\t\t\t<td>no</td>\r\n\t\t\t<td>N/A</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Account Credit Status Holds</td>\r\n\t\t\t<td>Order</td>\r\n\t\t\t<td>ord::orderConfig</td>\r\n\t\t\t<td>no</td>\r\n\t\t\t<td>N/A</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Note Type</td>\r\n\t\t\t<td>Order</td>\r\n\t\t\t<td>ord::orderCoreConfig</td>\r\n\t\t\t<td>no</td>\r\n\t\t\t<td>N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3><a name=\"services\" id=\"services\"></a><a id=\"Services\" name=\"Services\"></a>Services</h3>\r\n\r\n<p>The&nbsp;APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" height=\"195\" width=\"740\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><strong><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service</font></strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Component</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Group</strong></th>\r\n\t\t\t<th scope=\"col\"><strong><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service Endpoint</font></strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>api/customer/accountCreditStatus</td>\r\n\t\t\t<td>customer</td>\r\n\t\t\t<td>cus::customerConfig</td>\r\n\t\t\t<td>accountCreditStatus</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>api/order/accountCreditStatusHold</td>\r\n\t\t\t<td>order</td>\r\n\t\t\t<td>ord::orderConfig</td>\r\n\t\t\t<td>accountCreditStatusHold</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>api/order/noteType</td>\r\n\t\t\t<td>order</td>\r\n\t\t\t<td>ord::orderCoreConfig</td>\r\n\t\t\t<td>noteType</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3><a name=\"grants\" id=\"grants\"></a>Grants</h3>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><strong>Ressources</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Comments</strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td><strong>omui::omui-facade::menu::B2BAccounts</strong></td>\r\n\t\t\t<td>Gives access to the B2B account UI</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td><strong>omui::order::menu::AccountCreditStatusHold</strong></td>\r\n\t\t\t<td>Gives access to the Account credit status holds UI</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td><strong>omui::customer::menu::AccountCreditStatus</strong></td>\r\n\t\t\t<td>Gives access to the account credit status definition UI</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3><a name=\"troubleshooting\" id=\"troubleshooting\"></a>Troubleshooting</h3>\r\n\r\n<h4><a name=\"my-orders-are-not-updated-with-the-latest-account-credit-status-of-my-customer\" id=\"my-orders-are-not-updated-with-the-latest-account-credit-status-of-my-customer\"></a>My orders are not updated with the latest account credit status of my customer</h4>\r\n\r\n<p>Account credit status propagation is done asynchronously, so it is possible that it could take a few minutes before it gets updated.&nbsp;</p>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 35308,
  "scraped_at": "2025-08-09T22:07:10.443195",
  "content_clean": "Home ››Manhattan Active® Enterprise Promise & Fulfill››Process & Configuration Guides ››Account Management Account Management Previous I Account ManagementOverviewProcess FlowAccount Credit StatusAllocation StrategyFill RatesFulfillment InstructionsSingle Delivery ReleasesHold Release Until All Units AllocatedRelease ConsolidationConfigurationAccount Credit Status ConfigurationAllocation Strategy ConfigurationFill Rate ConfigurationRelease Consolidation ConfigurationFulfillment Instruction ConfigurationSingle Delivery Releases ConfigurationHold Release Until All Units Allocated ConfigurationImplementation FlavorsAccount Credit StatusUIs and EntitiesServicesGrantsTroubleshootingMy orders are not updated with the latest account credit status of my customer Overview Accounts serve as records for retailer customers and their divisions, providing a centralized location for storing essential customer information and preferences. Account data is used to facilitate seamless communication, ensure accurate fulfillment, and maintain a tailored customer experience. Each account contains key details, including company information, primary contacts, and specific preferences related to communication and order fulfillment. By maintaining well-structured account data, operational efficiency is improved, and business relationships are strengthened. This documentation outlines the processes involved in managing accounts, updating customer details, configuring preferences, and utilizing account data to support business operations. Process Flow Account credit status propagation - process flow Account Credit Status Account Credit Status enables the management of customer financial standing within the system. This status is used to determine whether a customer’s orders can proceed to fulfillment or should be placed on hold due to financial constraints such as overdue payments or credit limits being reached. When an account’s credit status is set to a value that should prevent the release, all unfulfilled and newly imported orders for that account are automatically placed on hold, preventing their release. Orders remain held until the credit status is resolved. Configuration options allow businesses to define which credit statuses require order holds and specify the types of holds applied. Key functionalities include: Automatic propagation of credit status changes to unfulfilled orders. Configurable credit status values and corresponding hold types. Manual override capability to remove holds on the orders when necessary. Allocation Strategy An account-level allocation strategy allows specific accounts to configure different strategies for allocating units and processing back-ordered units. The following options are available for allocation strategies: Fill And Kill - Multi Locations The fill and kill multi-locations strategy attempts to allocate as many units in a fulfillment group as possible from one or more fulfillment locations. Any remaining units in a fulfillment group that are not allocatable are cancelled. This functions as an account-level override of the 'cancel backordered units' functionality in order configuration. However, when using this at the account level, all doc types can be used. Fill Or Kill - Single Location The fill or kill single location strategy attempts to allocate as many units in a fulfillment group as possible from a single location using a 'Complete Single Source' optimization strategy. If ALL units in a fulfillment group are not allocatable from a single location, the entire fulfillment group is cancelled. Fill Or Kill - Multi Locations The fill or kill single location strategy attempts to allocate as many units in a fulfillment group as possible from one or multiple locations using a 'Complete Multi Source' optimization strategy. If ALL units in a fulfillment group are not allocatable from multiple locations, the entire fulfillment group is cancelled. Fill Rates The Fill Rate feature provides the ability to prevent any units from being released until a certain percent of the units on the Order or Order Line are allocated against inventory indicated by the Demand Type. There are two possible Fill Rate strategies: 'Order' and 'Order Line.' The 'Order' strategy can be used if no units are released until a certain percent of units across the entire order are allocated to inventory in the Demand Type. 'Order Line' strategy can be used if no units should get released until a certain percent of units on each order line are allocated against inventory in the Demand Type. For 'Order Line' strategy, every single order line must meet the fill rate before any units on the order get released. This configuration at the Customer level overrides the Fill Rate configuration at the Release Configuration. Fulfillment Instructions Instructions can be defined at the account level to provide standard order fulfillment guidelines for orders on a particular account. Each instruction consists of an Instruction Type (example, Packing Instruction) and a specific Instruction Text. When a new order is placed for an account, these pre-configured instructions are automatically copied to the order and can be sent to the fulfillment system on the release outbound. Fulfillment instructions persist from the account to the order as order notes. The instruction types available for an account are the list of eligible note types where the note category is \"Instruction\". Single Delivery Releases The single delivery (deliver together strategy) preference is an account-level override of the deliver together and minimize shipment release configurations. When this is enabled for a particular account, orders placed for that account will only release allocations when all allocated units are reserved to the configured demand type. For example, if the release configuration demand type is \"Allocation\", and an order has 10 units allocated, 6 to On Hand (allocation) supply and 4 to On Order (future) supply, no release will be created until the 4 On Order units are converted to on-hand units. For more details on the release behavior, refer to Release Grouping and Creation. Hold Release Until All Units Allocated Holding the release until all units are allocated (release grouping strategy) is an account level configuration option under release configuration. When this is enabled for a particular account, no units are released until every unit on the order is allocated (regardless of demand type). If configured in combination with Fill Rate, then Fill Rate takes precedence over the first release, while the second and final release will not occur until all remaining units in the order are allocated (regardless of demand type). For more details on the release behavior, refer to Release Grouping and Creation. Release Consolidation If Release Consolidation is enabled, orders having common attributes are consolidated together into one release which is sent to the fulfillment system just in time to be processed at the fulfillment facility before the next carrier pick-up time. This way, multiple releases are not sent out leading up to the shipment, and instead only one release per logical grouping of orders is sent to the DC (this feature is only supported for Distribution Centers). Release Consolidation Process Orders that will get consolidated together must share the following attributes: Customer Id Delivery Method Carrier Service Level Destination Address ShipFromLocation ReleaseGroupId In addition to sharing the above attributes, orders are consolidated together that are created within the same timeframe, which can roughly be defined by the time between Carrier Pick Times (configured in Location Scheduling UI or Inventory Location UI). For example, if the Carrier Pick Up happens once a week, then orders placed within the week between Carrier pick-ups are generally consolidated together. There will be some variation to this general rule, because processing times must also be considered when determining if orders can be consolidated together. A consolidated release is sent to the fulfillment facility with enough buffer time so that processing can be completed before the Carrier Pick Up time arrives. All processing times are considered when determining how many minutes before the Carrier Pick Time a consolidated group of orders should be released. Refer to Factors impacting Backward Scheduling and Factors Impacting Forward Scheduling guides to see a list of these based on whether you are using Backwards or Forwards Scheduling. For each order that is going to be consolidated, a ConsolidationStartTime and a ReleaseDate are determined during the allocation process and are stored in the Allocation section of the Order. ReleaseDate represents the time an order must be released to the DC in order to have enough time to be processed and still make it onto the optimal truck at the Carrier Pick Time. The ReleaseDate is calculated by subtracting all the processing times from the Ship Date. For more information on how dates are calculated please review all the sections of  Backwards and Forwards Scheduling pages. ConsolidationStartTime represents the time an order will be sent to the consolidation engine. This happens 15 minutes before the ReleaseDate by default, but can be configured in the Location Scheduling UI using the ConsolidationDuration parameter (in minutes). A new status, \"Preparing Release,\" indicates that an order has been sent to the consolidation engine. Once an order is in \"Preparing Release\" status, it cannot be edited or canceled. Inside the consolidation engine, orders that share the common attributes listed above, and that share the same optimal Carrier Pick Time, are consolidated together and the Release Date of the final consolidated release is determined (it might be slightly earlier if some orders in the same batch had items with higher processing times). The optimal Carrier Pick Time will vary depending if backwards scheduling or forwards scheduling is being used. If backwards scheduling is being used, then the Requested Delivery Date (RDD) becomes the driving factor in determining the optimal Carrier Pick Time. The Ship Date is determined by working backwards from the RDD, and then the Release Date is determined by working backwards from the Ship Date. Finally, ConsolidationStartTime is determined by working backwards from the Release Date. Backwards Scheduling Example: Transit Time is 4 hours Location Processing Time is 1 hour Carrier Pick Up happens every Monday The carrier is coming on Monday June 7 and Monday June 14 An order is placed on Sunday June 6 with an RDD of Wednesday June 16 Result: The Ship Date will be determined to be Monday June 14 (not Monday June 7), because it is the latest Carrier Pick Time when the RDD can still be met considering transit time, and it is also far enough in the future where the processing time can still be met. If forward scheduling is being used in combination with Release Consolidation, then the optimal Carrier Pick Time will be the earliest possible Carrier Pick Time when the order still has time to be processed at the fulfillment facility beforehand. Forwards Scheduling Example: Transit Time is 4 hours Location Processing Time is 1 hour Carrier Pick Up happens every Monday The carrier is coming Monday June 7 and Monday June 14 An Order is placed on Sunday June 6 with no RDD Result: The Ship Date will be determined to be Monday June 7, because it is the earliest Carrier Pick Time when the processing time can still be met. Notes: If there are multiple merge legs, Release Consolidation is only performed for the first leg of the shipment. Substitution is not supported in combination with Release Consolidation. If using Consolidation with Remorse Period, the 'Do Not Release Before Date' functions as a 'Do Not Prepare Release Before Date' A maximum of 1000 order lines per consolidated release is supported. If more than 1000 lines need to be consolidated, a second release will be created for the next 1000 order lines. Configuration Account Credit Status Configuration Account credit status: Lists the possible values for the account credit status and can be configured by the retailer. The values can be configured using the UI or the API below. Account credit status APIPOST: {{url}}/customer/api/customer/accountCreditStatus { \"AccountCreditStatusId\": \"OverLimit\", \"Name\": \"Billing Error: Over limit\", \"Description\": \"Applies to customers with a billing account over its limit\" } Read only grant for this API is api::customer::config::read. Admin grant for this API is api::customer::config::admin. Account credit status holds: Links the account credit status to a specific hold type if required. See here for more information about holds. The values can be configured in the UI or the API below. Account credit status hold APIPOST {{url}}/order/api/order/accountCreditStatusHold/save { \"AccountCreditStatusId\": \"BillingWarning\", \"HoldTypeId\": \"BillingWarning\" } There is a validation that the Account credit status ID should exist in the Account credit status entity and that the hold type Id should exist in the hold type configuration entity. Read only grant for this API is api::order::config::read. Admin grant for this API is api::order::config::admin. Release configuration: If a specific hold tied to an account credit status needs to prevent the release of orders, it is expected that the release configuration filters what orders can be released based on the hold types. See here for more information about the release process. See here for more information on how to configure the release template in the UI. Allocation Strategy Configuration To configure an allocation strategy preference for an account, select one of the available options from the Allocation Strategy list in the \"Preferences\" tab of the B2B Accounts UI. This can also be added via API using one of the following values: POST {{url}}/customer/api/customer/customer/save { \"CustomerId\": \"M43456_3\", \"FulfillmentPreferences\": { \"AllocationStrategy\": \"FillAndKillMulti\" //\"AllocationStrategy\": \"FillOrKillSingle\" //\"AllocationStrategy\": \"FillOrKillMulti\" } } Fill Rate Configuration To configure a Fill Rate, all three of the below properties must be set in the \"Preferences\" tab of the B2B Accounts UI. Fill Rate Strategy: Indicates whether the fill rate is honored at the order level or order line level. If Fill Rate Strategy is 'Order', no units are released until the fill rate is met, considering total units of the order across all lines. If Fill Rate Strategy is 'Order Line', no units are released until every line in the order meets the fill rate. 'FillRateType' and 'FillRateValue' must be populated as well for the Fill Rate feature to be honored. Fill Rate Type: Indicates the type of Fill Rate that should be used. For example, if Fill Rate Type is 'PercentUnits', then the 'FillRateValue' will represent the percent of units that must be allocated to releasable inventory before any units on the order are released. 'FillRateValue' and 'FillRateStrategy' must be populated as well for the Fill Rate feature to be honored. Fill Rate Threshold: Indicates the fill rate threshold. For example, if Fill Rate Type is 'PercentUnits', then the Fill Rate Value represents the percent of units that must be allocated to releasable inventory before any units on the order are released (if 70% is the fill rate, then populate Fill Rate Value as '70'). 'FillRateType' and 'FillRateStrategy' must be populated must be populated as well for the Fill Rate feature to be honored. Release Consolidation Configuration To configure Release Consolidation for a specific Customer, enable the \"Consolidate Orders\" check box in the \"Preferences\" tab of the B2B Accounts UI. In addition to configuring at a Customer level, this feature must be enabled at the DC level. To do this, go to the Fulfillment Location Configuration UI, click on the Fulfillment Location Config Id of \"Distribution Centers\" and enable the \"Support Release Consolidation\" check box. While not required for Release Consolidation, many configurations impact the Release Date of the consolidated group of orders. Most notably, the Carrier Pick Times in the Location Scheduling UI and in the Inventory Location UI dictate when the 'next' truck is coming, and therefore how long orders should consolidate before getting released to the fulfillment center so they have time to get processed before the next truck arrives at the Carrier Pick Time. Additionally, all the processing time configurations and location scheduling configurations impact the decision of when a consolidated group of orders is released. This is to ensure the orders are released in time to be processed before the Carrier Pick Time. See How Scheduling Works to understand all the configurations that impact date calculation. . Fulfillment Instruction Configuration Add Instruction Order Note Types To add additional instruction types for configuration on an account, add a new order Note Type, in the Note Types UI. Be sure to define the \"Note Category\" as Instruction for any note types that need to be used as account level fulfillment instructions. For example: Name Value Note Type Id PackingInstruction Note Category Id Instruction Description Instruction note for packing instructions. Add Instructions to the Account Instructions can be added to a specific account in the B2B Accounts UI, Instructions tab. They can also be added via API: POST {{url}}/customer/api/customer/customer/save { \"CustomerId\": \"M43456_3\", \"FulfillmentInstruction\": [ { \"InstructionNoteText\": \"Double-box all shipments.\", \"InstructionNoteType\": \"PackingInstruction\" } ] } Single Delivery Releases Configuration To configure the single delivery release fulfillment preference for an account, select \"FulfillmentGroup\" for the Deliver Together Strategy in the \"Preferences\" tab of the B2B Accounts UI. This can also be added via API: POST {{url}}/customer/api/customer/customer/save { \"CustomerId\": \"M43456_3\", \"FulfillmentPreferences\": { \"DeliverTogetherStrategy\": \"FulfillmentGroup\" } } Hold Release Until All Units Allocated Configuration To configure holding the release until all units are allocated for an account, select the \"Order\" option for the Release Grouping Strategy in the \"Preferences\" tab of the B2B Accounts UI. This can also be added via API: POST {{url}}/customer/api/customer/customer/save { \"CustomerId\": \"M43456_3\", \"FulfillmentPreferences\": { \"ReleaseGroupingStrategy\": \"Order\" } } Implementation Flavors Account Credit Status I want to prevent order fulfillment for customers with unpaid invoices. Configure Account Credit Status to move accounts with overdue invoices to \"Credit Hold\" and apply an Account Credit Status Hold to prevent order release until payments are made. I want to enforce credit limits to control customer risk. Set up credit limit thresholds in the external financial system, use API integration to update the Account Credit Status, and block new order releases when limits are exceeded. I want to allow controlled order releases for key accounts. Implement manual hold removal for specific orders UIs and Entities The configuration UIs mentioned in this document are listed in the following table, along with information to navigate to the API documentation. UI Name Component Group Seed Data Present? Seed Data Profile Account Credit Status Customer cus::customerConfig no N/A Account Credit Status Holds Order ord::orderConfig no N/A Note Type Order ord::orderCoreConfig no N/A Services The APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on each service. Service Component Group Service Endpoint api/customer/accountCreditStatus customer cus::customerConfig accountCreditStatus api/order/accountCreditStatusHold order ord::orderConfig accountCreditStatusHold api/order/noteType order ord::orderCoreConfig noteType Grants Ressources Comments omui::omui-facade::menu::B2BAccounts Gives access to the B2B account UI omui::order::menu::AccountCreditStatusHold Gives access to the Account credit status holds UI omui::customer::menu::AccountCreditStatus Gives access to the account credit status definition UI Troubleshooting My orders are not updated with the latest account credit status of my customer Account credit status propagation is done asynchronously, so it is possible that it could take a few minutes before it gets updated."
}