{
  "id": "3523365",
  "permalink": "backoffice-process-2",
  "title": "Backoffice Process",
  "type": "topic",
  "level": 7,
  "path": "Manhattan Active® Omni/Store/Process & Configuration Guides/Point of Sale/POS Guides/BackOffice Transactions/Backoffice/Process",
  "raw_item": {
    "id": "3523365",
    "text": "Process",
    "title": "Process",
    "permalink": "backoffice-process-2",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "448347",
    "parent": "f;448347",
    "created_date": "1732310960",
    "modified_date": "1753987606",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "1"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158737\" href=\"/point-of-sale\" class=\"breadcrumb-links\">Point of Sale</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3433322\" href=\"/pos-iris-guides\" class=\"breadcrumb-links\">POS Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3535917\" href=\"/backoffice-2\" class=\"breadcrumb-links\">BackOffice Transactions</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3535918\" href=\"/backoffice-3\" class=\"breadcrumb-links\">Backoffice</a></li><li> <span>››</span>Backoffice Process</li></ul>  \t\r\n\t\t<h2><a name=\"backoffice-nbsp-process\" id=\"backoffice-nbsp-process\"></a>Backoffice&nbsp;Process</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/backoffice-process-2$backoffice-nbsp-process\">Backoffice&nbsp;Process</a><ul><li><a href=\"/backoffice-process-2$dashboard\">Dashboard</a></li><li><a href=\"/backoffice-process-2$store-open\">Store Open</a><ul><li><a href=\"/backoffice-process-2$system-date-is-configured-as-open-date\">System Date is configured as Open Date</a><ul><li><a href=\"/backoffice-process-2$opening-twice-scenario\">Opening Twice scenario</a></li></ul></li><li><a href=\"/backoffice-process-2$open-date-not-configured-from-system-date\">Open Date Not configured from System Date</a><ul><li><a href=\"/backoffice-process-2$opening-twice-scenario\">Opening Twice scenario</a></li></ul></li></ul></li><li><a href=\"/backoffice-process-2$till-open\">Till Open</a><ul><li><a href=\"/backoffice-process-2$behavior-with-different-configurations\">Behavior with Different Configurations</a></li><li><a href=\"/backoffice-process-2$till-open-operation\">Till Open Operation</a></li></ul></li><li><a href=\"/backoffice-process-2$take-till-out-of-service-formerly-labeled-till-close\">Take Till Out of Service (formerly labeled \"Till Close\")</a></li><li><a href=\"/backoffice-process-2$till-disengage\">Till Disengage</a></li><li><a href=\"/backoffice-process-2$nbsp-close-till-for-the-day-formerly-till-reconcile\">&nbsp;Close Till for the Day (formerly \"Till Reconcile\")</a><ul><li><a href=\"/backoffice-process-2$foreign-or-alternate-currency\">Foreign (or alternate) currency</a></li><li><a href=\"/backoffice-process-2$behavior-with-different-configurations\">Behavior with Different Configurations</a></li><li><a href=\"/backoffice-process-2$close-till-for-the-day-formerly-till-reconcile-operation\">Close Till for the Day (formerly \"Till Reconcile\") Operation</a></li></ul></li><li><a href=\"/backoffice-process-2$bank-deposit\">Bank Deposit</a><ul><li><a href=\"/backoffice-process-2$foreign-or-alternate-currency\">Foreign (or alternate) currency</a></li></ul></li><li><a href=\"/backoffice-process-2$payment-type-configuration-for-backoffice-operation\">Payment Type Configuration for Backoffice Operation</a></li><li><a href=\"/backoffice-process-2$store-close\">Store Close</a><ul><li><a href=\"/backoffice-process-2$manual-store-close\">Manual Store Close</a></li><li><a href=\"/backoffice-process-2$auto-store-close\">Auto Store Close</a></li><li><a href=\"/backoffice-process-2$payment-reconciliation-handling-payment-void-due-to-order-cancelation\">Payment Reconciliation - Handling Payment void due to order cancelation</a></li></ul></li></ul></li></ul></div>\r\n\r\n<h3><a name=\"dashboard\" id=\"dashboard\"></a>Dashboard</h3>\r\n\r\n<p>This guide outlines the&nbsp;Backoffice&nbsp;processes.&nbsp; For details on any configurations referenced, see&nbsp;<a href=\"https://omni.helpdocsonline.com/backoffice-configuration-guide-2\">Backoffice Configuration</a>.</p>\r\n\r\n<p>The dashboard is the landing page upon navigation to Back Office.&nbsp; Here the user will see the current store open date, as well as the number of tills open, closed and reconciled for that day. Additionally, the number of registers for that location will be shown.</p>\r\n\r\n<p class=\"info\">Note: This number should equal the number of <strong>assigned</strong> registers for the store in master data. If a register is created, but is not in an assigned status, it will not be included in this count.</p>\r\n\r\n<p><a id=\"newbomenu\" name=\"newbomenu\"></a>As of Release 23.3, a&nbsp;new version of Back Office is available via <a hqid=\"3092761\" href=\"/behaviorchange\">Change in Behavior</a>. This new Back Office will overwrite the existing one.&nbsp; Within the new Back Office, the user will see a <strong>change in the grouping and labeling of some menu actions</strong>.</p>\r\n\r\n<p>The menu will now be grouped by operation.&nbsp;</p>\r\n\r\n<p>Additionally, the Close Till function will now be re-labeled \"Take Till Out of Service\" and the Till Reconciliation function will be re-labeled \"Close Till for Day\".</p>\r\n\r\n<div class=\"info\">Denominations are used to count and calculate the total value for the backoffice operation. It's only for ease of counting and to avoid manual errors. We do not save these user-entered denominations in the backend.</div>\r\n\r\n<h3><a name=\"store-open\" id=\"store-open\"></a>Store Open</h3>\r\n\r\n<p>Store should be opened prior to performing a sale transaction. Opening a store includes assigning a business day and counting initial amount of money in the store safe (store float). Business day should always be greater than the previous one (if any) but not necessarily the next one&nbsp; - 'skips' can happen for example if store is closed on Sundays.&nbsp;</p>\r\n\r\n<p>Store Open Date can be either assigned manually or defaulted directly from the device OS date.</p>\r\n\r\n<h4><a name=\"system-date-is-configured-as-open-date\" id=\"system-date-is-configured-as-open-date\"></a>System Date is configured as Open Date</h4>\r\n\r\n<p>When the<a hqid=\"2733806\" href=\"#DefaultStoreOpenDateFromSystem\"> </a><strong>Default Store Open Date from System</strong>&nbsp;configuration is set to True, the Store Open date is defaulted from the device OS date and users do not have the ability to manually change the store open date in this scenario.</p>\r\n\r\n<p><a id=\"reopensameday\" name=\"reopensameday\"></a>There can be instances when the user accidentally closes the store during the day and then it is necessary to open twice, necessitating rolling forward of store open date.</p>\r\n\r\n<p>To avoid such a situation in the first place where the user may accidentally close the store, the application displays a&nbsp;warning message to the user while closing the store.&nbsp; Users still have the ability to close the store but at least the application gives the warning message to keep them informed that they will be closing the store.&nbsp; This warning message is prompted only when the users try to close the store before a specific time of the day.&nbsp; Currently, the timing is hard coded to 3PM, which the application reads from the local time of the device.</p>\r\n\r\n<p>In case the user tries to close the store post 3PM the warning message is not displayed and store close is performed.</p>\r\n\r\n<h5><a name=\"opening-twice-scenario\" id=\"opening-twice-scenario\"></a>Opening Twice scenario</h5>\r\n\r\n<p>To avoid such a situation where the user may accidentally close the store, the application displays a&nbsp;warning message to the user while closing the store. Users still have the ability to close the store but at least the application gives the warning message to keep them informed that they will be closing the store. This warning message is prompted only when the users try to close the store before a specific time of the day. Currently, the timing is hard coded to 3PM, which the application reads from the local time of the device. In case the user tries to close the store post 3PM the warning message is not displayed and store close is performed.&nbsp;</p>\r\n\r\n<p>In spite of warnings, there can still be scenarios in which the store is closed and must be reopened - for example, associate mistakenly closes too early, or a big spender&nbsp;customer walks into the store after close and wants to make a purchase.&nbsp; But with this business flag <strong>Default Store Open Date from System</strong>&nbsp;enabled, associates can still open the store again on the same day.&nbsp; However, the new Store Open date automatically rolls forward and is now the current date +1 day i.e. the next business day.</p>\r\n\r\n<p>The procedure in such case is to allow the store to remain open overnight until it runs through the next day and is closed at that time.</p>\r\n\r\n<h4><a name=\"open-date-not-configured-from-system-date\" id=\"open-date-not-configured-from-system-date\"></a>Open Date Not configured from System Date</h4>\r\n\r\n<p>If the flag Default Store Open Date from System is set to False, the user can manually configure the Store Open Date.&nbsp;</p>\r\n\r\n<h5><a name=\"opening-twice-scenario\" id=\"opening-twice-scenario\"></a>Opening Twice scenario</h5>\r\n\r\n<p>In a scenario scenarios in which the store is closed and must be reopened, when the Open Date is not taken from the system date the user manually selects an Open date.&nbsp; The only requirement is, this must be a future date.&nbsp; If the store was closed for March 1, for example, it can't be reopened for March 1 or February 28.</p>\r\n\r\n<p>In case the store was somehow opened on a different future date due to reasons like the device date was incorrectly set to future date, or before setting the mentioned configuration to True the dates were not synced appropriately etc. then the same store cannot be open in date prior to already displayed on the device.&nbsp; Whenever, user tries to open the store the application throws an error that the store was opened on a future date with the most recent store open date highlighted.&nbsp; User can then only open the store on a later date than displayed on the device.&nbsp;</p>\r\n\r\n<p>The expected store float amount for first business day of the store - 'Day One' - is pulled from configuration.&nbsp; For all other&nbsp;successive days it will be pulled from previous business days&nbsp;store close amount.&nbsp;</p>\r\n\r\n<p>If there is any variance in expected float and the entered store amount then it requires an mandatory explanation (comment) and/or a confirmation.&nbsp; Store float uses store base currency as defined in Backoffice denomination table.&nbsp;</p>\r\n\r\n<p>Depending on configuration it can be counted as a total or by details (denominations, that is 20 5-dollar bills, 30 10-dollar bills, so on). Store opening can be \"blind\", which means that the expected store float is not displayed (but still used for validation). The store open procedure can be considered a transaction, which consumes next available transaction number and is recorded in TLOG together with the entered float amount/denominations and relevant configuration values (default store float, blind flag, counting method, and so on).</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Each float element can configured to be entered&nbsp;either as a \"total\" or \"by denominations\" but not both.</div>\r\n\r\n<div class=\"warning\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px;\"><strong>Important</strong>:&nbsp;We cannot open the store the same day more than once. If it is closed on a business day, the earliest it can be opened is the next day.</div>\r\n\r\n<p><strong>Description</strong>: Open store operation is usually done by a store manager. The steps include:</p>\r\n\r\n<ol>\r\n\t<li>Validate input parameters - Business day, Store float amount (total or by denomination id's),&nbsp;location (read from the logged in user), currency codes (defaulted to store base currency), tender types (defaulted to cash)</li>\r\n\t<li>Validate store is closed- A store can be opened only when the store is in \"CLOSED\" status, or it is being opened for the first time.</li>\r\n\t<li>Validate business rules - store is closed, business day is greater than the previous one</li>\r\n\t<li>Validate store float - If inputted store float fails to match expected value, request explanation or re-entry:\r\n\t<ul>\r\n\t\t<li>Case 1: Initial business date for a location: store float should equal the configured default value for new location</li>\r\n\t\t<li>Case 2: All subsequent business dates for the location: store float should equal the amount from previous business days store close amount</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>If store open captures Store Float with detail, aggregate them to calculate total store amount.</li>\r\n\t<li>Update Store Ops Values - Set store amount&nbsp;to the entered amount by user, set business day, set store status to OPEN</li>\r\n\t<li>Create TLOG event including operation name and parameters as well as relevant configuration values</li>\r\n</ol>\r\n\r\n<h3><a name=\"till-open\" id=\"till-open\"></a><a id=\"tillopen\" name=\"tillopen\"></a>Till Open</h3>\r\n\r\n<p>A till,&nbsp; the plastic tray used to sort cash denominations and checks, must be opened before it can be used. Opening a Till is a Store Ops transaction which includes associating the till with a cash drawer, and confirming the Till Float, or starting cash value.</p>\r\n\r\n<p>Till Float uses the store's base currency and represents only Cash tender. Till Float can be configured to accept count as either&nbsp;simple cash total, or with detail.&nbsp; Detail requires a breakdown by denomination.The sequence of the currency denominations are displayed based on the created&nbsp;timestamp by default.</p>\r\n\r\n<ul>\r\n\t<li>Ex: Quantity 20: 5 dollar bills; Quantity 30: 10 dollar bills; etc.</li>\r\n</ul>\r\n\r\n<p>Till opening can be \"blind\". Blind opening means that the expected till float is not displayed on the screen for the user, but it is still used for validation purposes.If Till Float entered does not match the expected, then re-entry or confirmation is required, along with an explanatory comment.</p>\r\n\r\n<p>The till open procedure is considered a transaction, which consumes the next available transaction number and is recorded in the TLOG. This transaction includes the entered float amount, till&nbsp;and drawer IDs&nbsp;and relevant configuration values (default till float, blind flag, etc).</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> During a given business day, every till can be opened only once. And each float value can be configured to be entered&nbsp;either as a \"total\" or \"by denominations\" but not both.</div>\r\n\r\n<h4><a name=\"behavior-with-different-configurations\" id=\"behavior-with-different-configurations\"></a>Behavior with Different Configurations</h4>\r\n\r\n<p>When the till is opened for the first time then the expected till float is the configured default.&nbsp; Subsequent till float behavior depends on the \"Combine Reconciliation Amounts\" and \"Persist Amount in Till\" configurations</p>\r\n\r\n<p><strong>Configuration type 1: </strong>Combine Reconciliation Amounts = False (Persist Amount in Till is not considered)</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>Till Amount = Total amount of cash tender in the till</li>\r\n\t<li>Expected Till Float = Till float entered by user during the till's most recent reconciliation transaction</li>\r\n</ul>\r\n\r\n<p><strong>Configuration type 2: </strong>Combine Reconciliation Amounts = True AND&nbsp;Persist Amount in Till = False</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>Till Amount = Total amount of cash tender in the till</li>\r\n\t<li>Expected Till Float = expected amount as per Back Office configuration</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note: </strong>The expected amount for each Till Open will match the configured default value regardless of tender reconciled in the previous day since Persist Amount in Till = False.</div>\r\n\r\n<p><strong>Configuration type 3: </strong>Combine Reconciliation Amounts = True AND Persist Amount in Till = True</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>Till Amount = Total amount of cash tender in the till</li>\r\n\t<li>Expected Till Float = Till float entered by user during the till's most recent reconciliation transaction</li>\r\n</ul>\r\n\r\n<p><strong>Note:</strong>&nbsp;For all types of configurations above,&nbsp;If the entered till amount matches the expected amount, no variance is captured.&nbsp; Otherwise user is prompted to re-enter the amount, or confirm the originally entered amount with a comment. Variances will be captured if the user confirms the entered amount.</p>\r\n\r\n<h4><a name=\"till-open-operation\" id=\"till-open-operation\"></a><a id=\"tillopen_cd\" name=\"tillopen_cd\"></a>Till Open Operation</h4>\r\n\r\n<p>Open Till operation is usually done by a store manager, but any user with right permission should be able to open a till. The steps include:</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>Validate input parameters - Drawer Id (till Id is not validated;&nbsp;if it's not found the new till will be created), till float (denomination Ids, counts/amounts),&nbsp;currency codes (defaulted to store base currency), tender types (defaulted to cash).\r\n\t<ul>\r\n\t\t<li>Only those users who have the grants can manually enter the till number while&nbsp;others can only select from the list of Available Tills to Open the Till.&nbsp;This&nbsp;is controlled by a business flag \"Secure Manual Till Entry With Grant\" in BO Till Configuration and a resource id \"ui::backoffice::addnewtill\"</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Validate business rules - store is open, till is not open and has not been open today, drawer is empty, store amount has enough money.</li>\r\n\t<li>If till float is counted by denomination, aggregate them to calculate total.</li>\r\n\t<li>Create record in till entity if needed, move required amount of money from store safe to till, set till status to OPEN and drawer Id attribute to specified value.</li>\r\n\t<li>Create TLOG event including operation name and parameters as well as relevant configuration values</li>\r\n</ul>\r\n\r\n<p>If \"pop-up cash drawer during till open\"&nbsp;= TRUE in BO till configuration then the till open operation follows below steps:</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>During till open process, cash drawer is engaged and a new backoffice transaction is created in open status.</li>\r\n\t<li>Cash drawer is popped out to allow user to insert the till with cash&nbsp;access cash in existing till to&nbsp;count the float amount.\r\n\t<ul>\r\n\t\t<li>User will not be allowed to navigated to any other screens within store app, until user confirms or cancel this transaction.</li>\r\n\t\t<li>Till Status is updated to \"Pending Open\" and state is updated as&nbsp;\"Till Open\".</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Upon till open confirmation,&nbsp;cash drawer is disengaged upon receiving acknowledge from user that cash drawer&nbsp;is closed, and&nbsp;backoffice transaction is moved to closed status.</li>\r\n\t<li>If user chooses to cancel,&nbsp;cash drawer is disengaged&nbsp;and&nbsp;backoffice transaction is moved to cancelled&nbsp;status.</li>\r\n</ul>\r\n\r\n<p><strong>Fixed registers:</strong> User can only open the till with cash drawer assigned to the fixed register. If the cash drawer assigned to the register is already open then user can't open any other tills from this register.</p>\r\n\r\n<p><strong>Mobile registers:</strong> User can scan the cash drawer and open the tills until the till and cash drawers is in valid state, no restrictions unlike the fixed registers.&nbsp;</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n</ul>\r\n\r\n<div class=\"info\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px;\"><strong>Note</strong>: <span style=\"background-color: rgb(204, 255, 204);\">If central server cannot be reached, and</span>&nbsp;Store is running on an edge server, Till Open operations will be pulled from central using scheduled jobs if it was opened during that day. However, retailers can perform till open operations on edge server as well. Variance validation with till float will be skipped in edge mode.</div>\r\n\r\n<div class=\"warning\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px;\"><strong>Important</strong>: Till cannot be deleted if amount is persisted in the till from previous day.</div>\r\n\r\n<h3><a name=\"take-till-out-of-service-formerly-labeled-till-close\" id=\"take-till-out-of-service-formerly-labeled-till-close\"></a>Take Till Out of Service (formerly labeled \"Till Close\")</h3>\r\n\r\n<p>Till is tagged to prevent being used for any further transactions during that business day but it is not reconciled for the day. A till can be closed only when it is in open status.&nbsp;</p>\r\n\r\n<p>After closing the till, it cannot be opened further in the current business day but it can be reconciled.</p>\r\n\r\n<p>This menu option is not a common operation and the function can be hidden&nbsp;by enabling the business flag \"Hide Close Till Function\" in the BO Till Configuration</p>\r\n\r\n<h3><a name=\"till-disengage\" id=\"till-disengage\"></a>Till Disengage</h3>\r\n\r\n<p>During the day, the till can be engaged by any register/user. On completion of a transaction, the till will be systematically disengaged. In the event of a mechanical or communication error, the till may fail to disengage and become unusable. A store manager may choose to forcibly disengage the till, thus restoring its functionality.</p>\r\n\r\n<h3><a name=\"nbsp-close-till-for-the-day-formerly-till-reconcile\" id=\"nbsp-close-till-for-the-day-formerly-till-reconcile\"></a><a id=\"tillreconcile\" name=\"tillreconcile\"></a>&nbsp;Close Till for the Day (formerly \"Till Reconcile\")</h3>\r\n\r\n<p>A till is closed for the day via reconciliation, which is the process of verifying the amount of cash, check or travelers' check in a cash register by counting.&nbsp; The counted is compared to the expected amount which has been computed by POS during the day for that till.</p>\r\n\r\n<p>Reconciliation is generally completed at the end of the business day, however, the verification can also take place whenever a different associate takes over a register with a different Till.&nbsp; Tills which are in \"Open\" or \"Taken Out Of Service\" (formerly Closed) status can be reconciled.&nbsp; Once the till is Closed for Day (Reconciled) it cannot be re-opened until the next business day.</p>\r\n\r\n<p>During Till Reconciliation, Back Office prompts the user for the till float and the till amount.&nbsp;&nbsp;The till amount captures the total of all tenders maintained in a till (cash, checks, etc).&nbsp;&nbsp;Till float is the portion of cash from the till amount which will be persisted in the till for the next business date.&nbsp;The difference between the till amount and till float will be moved from the till to the store safe.&nbsp;&nbsp;These values may be combined through configuration, in which case, only the Till Amount will be requested.</p>\r\n\r\n<p>Tender counts can be entered as a simple total, or with detail. For cash tender, detail requires a breakdown by denomination (e.g. 20 5-dollar bills, 30 10-dollar bills, so on). For Check and Traveler's Check tenders, detail requires counts of check-type documents collected and the sum of tender amount for the check type. Till reconciliation can be \"blind\", which means that the expected till float is not displayed, but is still used for validation. If amount entered does not match the expected, then Backoffice requires a re-entry or a confirmation with an explanatory comment.</p>\r\n\r\n<h4><a name=\"foreign-or-alternate-currency\" id=\"foreign-or-alternate-currency\"></a><a id=\"foreign currency till reconcile\" name=\"foreign currency till reconcile\"></a>Foreign (or alternate) currency</h4>\r\n\r\n<p>If an alternate currency is collected during a cash transaction, users will be able to enter the total amount taken during reconciliation.&nbsp; The expected alternate currency amount will be displayed along with the existing expected base currency. This expected amount will be shown in the alternate currency, not in the base currency.</p>\r\n\r\n<ul>\r\n\t<li>tap \"+ Add Foreign Currency\"</li>\r\n\t<li>Select currency from dropdown</li>\r\n\t<li>Enter amount taken</li>\r\n</ul>\r\n\r\n<p>Once entered, the totals at the bottom will be updated with the converted amount.&nbsp; If the user selects a foreign currency in error, they can simply press the \"Remove\" button and the alternate currency line will be removed.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Once a till is reconciled, it cannot be used until the following business day.</div>\r\n\r\n<div class=\"warning\"><strong>Variance Confirmation</strong>: If BO&nbsp;store configuration has variance confirmation value set up, then in case of any \"till reconcile\"&nbsp;variance user will be&nbsp;asked&nbsp;to confirm the variance.</div>\r\n\r\n<h4><a name=\"behavior-with-different-configurations\" id=\"behavior-with-different-configurations\"></a>Behavior with Different Configurations</h4>\r\n\r\n<p>Two configurations dictate how tender is shifted from Till to Store Safe: \"Combine Reconciliation Amounts\" and \"Persist Amount In Till\"</p>\r\n\r\n<p><strong>Configuration type 1: </strong>\"Combine Reconciliation Amounts\" = False, (\"Persist Amount In Till\" is not considered)</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>Reconciliation prompts for both till amount and till float. Both entries are required to complete the reconciliation.</li>\r\n\t<li>Till amount captures all tender maintained in the till.</li>\r\n\t<li>Till float is the portion of the cash till amount which will remain in the till in order to start the next business day.</li>\r\n\t<li>The expected till amount is the total Cash and check-type tenders in the till</li>\r\n\t<li>If the entered till amount matches the expected till Amount, then no variance is captured.  Otherwise, backoffice will prompt for re-entry, or confirmation with a comment.  Variance will be captured if the user confirms the count.</li>\r\n\t<li>After till reconciliation, the till float remains in the till.  This amount is used as the as expected amount of&nbsp;the till open for the following business day.</li>\r\n\t<li>After till&nbsp;reconciliation, the difference between the cash i.e. till amount and the till&nbsp;float is moved to the store safe. This amount is added to the expected safe&nbsp;amount, and is available for bank deposit and store closure.</li>\r\n\t<li>After till&nbsp;reconciliation, check-type tenders are always moved to the store safe. This tender is then available for bank deposit.</li>\r\n</ul>\r\n\r\n<p><strong>Configuration type 2: </strong>\"Combine Reconciliation Amounts\" = True, \"Persist Amount In Till\" = False</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>Reconciliation prompts for only till amount.</li>\r\n\t<li>The expected till amount is the total cash and check-type tenders in the till.</li>\r\n\t<li>If the entered till amount matches the expected till amount, then no variance is captured.  Otherwise, Backoffice will prompt for re-entry, or confirmation with a comment.  Variance will be captured if the user confirms the count.</li>\r\n\t<li>After till&nbsp;reconciliation, the full cash till amount is moved to the store safe. No amount is persisted in the till.  This amount is added to the expected safe amount, and is available for bank deposit and store closure.</li>\r\n\t<li>After till reconciliation, check-type tenders are always moved to the store safe. This tender is then available for bank deposit.</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> The expected amount for each till open will match the configured default value, regardless of tender reconciled in the previous day.</div>\r\n\r\n<p><strong>Configuration type 3: </strong> \"Combine Reconciliation Amounts\" = True, \"Persist Amount In Till\" = True</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>Backoffice prompts for only till amount</li>\r\n\t<li>The expected till&nbsp;amount is the total cash and check-type tenders in the till</li>\r\n\t<li>If the entered till amount matches the expected till&nbsp;amount, then no variance is captured.  Otherwise, backoffice will prompt for re-entry, or confirmation with a comment.  Variance will be captured if the user confirms the count.</li>\r\n\t<li>After till reconciliation, the full cash&nbsp;till amount&nbsp;is persisted in the till. No amount is moved to the store&nbsp;safe . This amount is used as the as expected amount of the till&nbsp;open&nbsp;for the following business day.</li>\r\n\t<li>After till reconciliation, check-type tenders are always moved to the store&nbsp;safe. This tender is then available for bank deposit .</li>\r\n</ul>\r\n\r\n<h4><a name=\"close-till-for-the-day-formerly-till-reconcile-operation\" id=\"close-till-for-the-day-formerly-till-reconcile-operation\"></a><strong><a id=\"tillreconcile_cd\" name=\"tillreconcile_cd\"></a></strong>Close Till for the Day (formerly \"Till Reconcile\") Operation</h4>\r\n\r\n<p>Reconcile till operation is usually done by a store manager, but any user with right permission should be able to reconcile&nbsp;a till. The steps include:</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>Select the till that needs to be reconciled. Based on configuration \"Combined Reconcile\" = true/false and \"Persist amount in till\" = true/false, enter till float (the amount used to persist&nbsp;in the till) and till amount separately, else the total amount collected in the till can be entered. (Check explanation in&nbsp;above sections)</li>\r\n\t<li>Till float amount is not validated. Its just persisted in the till as till amount for successive&nbsp;days.</li>\r\n\t<li>Validate till amount - If the entered till amount does not match with amount collected in the till including&nbsp;till float, then comments for variance and confirmation is required.</li>\r\n\t<li>If amount is specified by denomination, aggregate them to calculate total. (Till float is always by total)</li>\r\n\t<li>Create record in till entity if needed, Based on configurations move money from till to store safe or persist in till, set till status to reconciled&nbsp;and drawer Id is cleared i.e. disassociated with the till.</li>\r\n\t<li>Create TLOG event including operation name and parameters as well as relavant configuration values.</li>\r\n</ul>\r\n\r\n<p>If \"pop-up cash drawer during till reconcile\"&nbsp;= TRUE in BO till configuration then the till reconcile operation follows below steps:</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>During till reconcile&nbsp;process, cash drawer linked to the till is engaged and a new backoffice transaction is created in open status.</li>\r\n\t<li>Cash drawer is popped out to allow user to&nbsp;count the float and/or&nbsp;till amount.\r\n\t<ul>\r\n\t\t<li>User will not be allowed to navigated to any other screens within store app, until user confirms or cancel this transaction.</li>\r\n\t\t<li>Till Status is not updated yet&nbsp;and state is updated as&nbsp;\"Till Reconcile\".</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Upon till reconcile confirmation,&nbsp;cash drawer is disengaged upon receiving acknowledge from user that cash drawer&nbsp;is closed, and&nbsp;backoffice transaction is moved to closed status.</li>\r\n\t<li>If user chooses to cancel,&nbsp;cash drawer is disengaged&nbsp;and&nbsp;backoffice transaction is moved to cancelled&nbsp;status.</li>\r\n</ul>\r\n\r\n<p><strong>Fixed registers:</strong> User can only reconcile the till with cash drawer assigned to the fixed register. If the cash drawer assigned to the register is not&nbsp;open or already reconciled then user can't reconcile&nbsp;any other open tills from this register. But user can still reconcile closed tills from this register</p>\r\n\r\n<p><strong>Mobile registers:</strong> User can scan the cash drawer and reconcile&nbsp;any tills until the till and cash drawers is in valid status/state, no restrictions unlike the fixed registers.&nbsp;</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong>&nbsp;Reconcile process will not engage cash drawer when&nbsp;\"pop-up cash drawer during till reconcile\"&nbsp;= TRUE. Closed tills can be reconciled from any registers.</div>\r\n\r\n<h3><a name=\"bank-deposit\" id=\"bank-deposit\"></a>Bank Deposit</h3>\r\n\r\n<p>Tender included in the Store Safe amount is eligible to be deposited to the Bank. Bank deposit is supported for store base currency code as well as altenrate currencies.&nbsp; Each deposit can include cash and/or check and/or traveler's check collected as store amount.&nbsp; Depending on configuration it can be counted as \"no Count\", \"total\" or \"by details\" (denominations, that is 20 5-dollar bills, 30 10-dollar bills, so on). If the amount is a check or a traveler's check, the details are by counts of the individual check documents collected along with sum of amount of all the checks. If it is configured to be \"No Count\", all the money collected as store amount will be deposited in a single transaction per currency code.</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> Bank Deposit can be configured to be entered&nbsp;as “no count”,&nbsp;“total” or “by denominations” but not as a combination.</div>\r\n\r\n<p><a id=\"BD_SuggestedCash_process\" name=\"BD_SuggestedCash_process\"></a>Additionally, when&nbsp;flag “Show suggested cash for Deposit” in BO&nbsp;store configuration is turned \"ON\" then bank deposit screen will show 2 more labels such as below to suggest store users on the cash that is available for deposit leaving the store float.</p>\r\n\r\n<ul>\r\n\t<li>Suggested cash for Deposit - This is calculated by&nbsp;subtracting store float amount during store open from&nbsp;Store safe amount. If this comes as negative then suggest cash for deposit will be shown as 0</li>\r\n\t<li>Store float/Configured store float - When flag \"<label for=\"mat-checkbox-5-input\">Calculate Suggested Deposit Using Configured Store Float</label>\" is turned on then store float amount is picked from BO configuration and not from store open operation, and that is used in calculation of suggested cash for deposit.</li>\r\n</ul>\r\n\r\n<p>If retailer is persisting amount in till, and flag \"<label for=\"mat-checkbox-4-input\">Include Till Amount To Calculate Suggested Deposit</label>\" is turned \"ON\" then the amount in till after reconciliation&nbsp;is also considered&nbsp;during calculation of&nbsp;suggested cash for deposit.</p>\r\n\r\n<h4><a name=\"foreign-or-alternate-currency\" id=\"foreign-or-alternate-currency\"></a><strong><a id=\"Foreign Currency Bank Deposit\" name=\"Foreign Currency Bank Deposit\"></a></strong>Foreign (or alternate) currency</h4>\r\n\r\n<p>If an alternate currency is collected during a cash transaction, users will be able to enter the total amount taken during the bank deposit.&nbsp; The expected alternate currency amount will be displayed along with the existing expected base currency. This expected amount will be shown in the alternate currency, not in the base currency.</p>\r\n\r\n<ul>\r\n\t<li>tap \"+ Add Foreign Currency\"</li>\r\n\t<li>Select currency from dropdown</li>\r\n\t<li>Enter amount taken</li>\r\n</ul>\r\n\r\n<p>Once entered, the totals at the bottom will be updated with the converted amount.&nbsp; If the user selects a foreign currency in error, they can simply press the \"Remove\" button and the alternate currency line will be removed.</p>\r\n\r\n<p>Bank Deposit operation is&nbsp;performed before the close of the store. There is no limit for a Bank deposit transaction, it can be performed any number of times until the close of store.&nbsp;Once the store is closed, bank deposit cannot be performed. The steps include:</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>Ensure that all or some tills are reconciled, and there is enough money to be deposited.</li>\r\n\t<li>Select bank deposit and the currency that needs to be deposited.</li>\r\n\t<li>Validate deposit amount or count per currency — if the entered deposit amount is more than available cash or entered deposit count is more than available count (applicable if configured as details) then hard error is displayed.</li>\r\n\t<li>Nothing to deposit — if store was just opened or none of the tills are reconciled in which case store amount will not be available.</li>\r\n\t<li>If bank deposit amount is specified by denomination, aggregate them to calculate total.</li>\r\n\t<li>Create record in backoffice transaction and update store amount entity, move required amount of money from store amount.</li>\r\n\t<li>Create TLOG event including operation name and parameters as well as relevant configuration values.</li>\r\n</ul>\r\n\r\n<h3><a name=\"payment-type-configuration-for-backoffice-operation\" id=\"payment-type-configuration-for-backoffice-operation\"></a><a id=\"payment type config at bo\" name=\"payment type config at bo\"></a>Payment Type Configuration for Backoffice Operation</h3>\r\n\r\n<p>By default, Backoffice provides three payment types&nbsp;i.e Cash, Check and Traveler's Check&nbsp;to count/include in Till Reconciliation, Bank Deposit.&nbsp; These also appear in the different back office reports.&nbsp;</p>\r\n\r\n<p>Depending upon the nature of their specific business,&nbsp;retailers can <a hqid=\"2017949\" href=\"/pospayment-configuration$Include In Drawer Count\">configure</a> two of these 'countable/reconcilable'&nbsp;payment types - Traveller's Check and&nbsp;Personal Check - either TO BE DISPLAYED and counted or NOT TO BE DISPLAYED or counted,&nbsp;at the Reconciliation, Bank Deposit screens along with various reports.</p>\r\n\r\n<div class=\"info\">NOTE: Cash payment type is by default displayed&nbsp;on these screens and reports and is not driven by any configuration.&nbsp;</div>\r\n\r\n<div class=\"warning\">Check and Traveler's check payment types&nbsp;are required to be present in the system. If you don't support these payment then disable it using above config. DONT DELETE these seed data, deleting will impact store close procedures.</div>\r\n\r\n<h3><a name=\"store-close\" id=\"store-close\"></a>Store Close</h3>\r\n\r\n<p>The Store should be closed after all the transactions are completed for the business day. Closing a store includes closing the current business day and recording the remaining Store Safe amount after the completion of all Till Pick-Ups, Till Reconciliations and Bank Deposits. All tills must be reconciled at a Store before it is eligible for Store Closure.</p>\r\n\r\n<p>On Store Closure, several processes are executed on the store's transactions, including Payment Reconciliation and Abandoned Order Cancellation. Payment Reconciliation will review all SAF transactions and incomplete Request Logs, and update the associated payment transaction with the latest status from the payment gateway. Abandoned Order Cancellation will cancel all open and suspended orders. Outstanding payments may be voided at this time. Once these processes are complete, the Store's status will be marked as Closed.</p>\r\n\r\n<p>Store amount typically uses the Store's base currency. Store Float can be configured to accept count as either a simple cash total, or with detail. Detail requires a breakdown by denomination (e.g. 20 5-dollar bills, 30 10-dollar bills, so on). Store Close can be \"blind\", which means that the expected Store float is not displayed, but is still used for validation. If the Store float entered does not match the expected, then Backoffice requires a re-entry or a confirmation with an explanatory comment.</p>\r\n\r\n<p>The till open procedure is considered a transaction, which consumes next available transaction number and is recorded in TLOG together with the entered float amount/denomination, till/drawer Ids, and relevant configuration values (default till float, blind flag, counting method, so on).</p>\r\n\r\n<div class=\"warning\"><strong>Important</strong>: Store amount can be configured to be entered&nbsp;either as a \"total\" or \"by denominations\" but not both.</div>\r\n\r\n<div class=\"warning\"><strong>Important</strong>: Store close is only for cash. \"Traveler's check\" and \"check\" if not deposited in bank will be carried to next business day.</div>\r\n\r\n<div class=\"tip\"><strong>Variance Confirmation</strong>: If BO&nbsp;store configuration has variance confirmation value set up, then in case of any \"store close\" variance user will be&nbsp;asked&nbsp;to&nbsp;confirm the&nbsp;variance.</div>\r\n\r\n<h4><a name=\"manual-store-close\" id=\"manual-store-close\"></a>Manual Store Close</h4>\r\n\r\n<p><strong>Description</strong>: Close store operation is usually done by a store manager. The steps include:</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>Validate all tills are closed for the day (reconciled) - all the tills should be reconciled, else a hard check error is displayed.</li>\r\n\t<li>Execute payment reconciliation.&nbsp; Refer this <a hqid=\"2017948\" href=\"/pospayment-process\">link</a> to get more on payment reconciliation process.</li>\r\n\t<li>Check for suspended transaction - if there are any suspended transaction during the day, list them and void/cancel after confirmation from user.&nbsp; &nbsp;This includes order in waiting room too.</li>\r\n\t<li>Cancel&nbsp;unconfirmed orders - all unconfirmed orders for the given store are canceled.&nbsp; This could&nbsp;happen due to&nbsp; reasons like; device runs out of battery while in middle of the transaction.&nbsp;&nbsp;\r\n\t<ul>\r\n\t\t<li>If there are any tendered order, system voids the tenders before order is marked as canceled.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Cancel open Back office transactions.</li>\r\n\t<li>Validate store is open - a store can be closed only when the store is in \"OPEN\" status.</li>\r\n\t<li>Validate input parameters - store amount (total or by denomination id's), location (read from the logged in user), currency codes (defaulted to store base currency), tender types (defaulted to cash),</li>\r\n\t<li>If store amount entered does not match expected store amount, ask user for an comments and/or confirmation.</li>\r\n\t<li>If store amount is specified by denomination, aggregate them to calculate total</li>\r\n\t<li>Set store safe to entered amount, set store status to CLOSED</li>\r\n\t<li>Upon Store Close transaction creation, raise event to kick off Tender Reconciliation transaction&nbsp;and post document to message queue.</li>\r\n\t<li>Create TLOG event including operation name and parameters as well as relevant configuration values.</li>\r\n</ul>\r\n\r\n<div class=\"info\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px;\"><strong>Note</strong>: If the Store close operation is performed when store is running on edge mode, then the same will be pushed to central during outbound&nbsp;sync. Since there will be a risk of central having some suspended/abandoned&nbsp;transaction or some tills might still be opened on central before it went offline. Store close sync operation will validate and reconcile all tills on central with expected amount, and also kill all suspended/abandoned transactions and then save store close operations on central during outbound sync.</div>\r\n\r\n<div class=\"tip\"><strong>Note: </strong>The Backoffice Store Operation has a Refresh button which allows the users to refresh the list of all the suspended orders. While a manager is performing the Backoffice operations, there can be some orders that are suspended during this time by&nbsp;the users. This&nbsp;button helps to show the list of all the suspended orders to keep the managers aware.&nbsp;</div>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> When the business flag <a href=\"https://omni.helpdocsonline.com/backoffice-process$store-open#DefaultStoreOpenDateFromSystem\"><b>Default Store Open Date from System</b></a> is set to True the application allows the associate to open the store twice during the same day. The first time when the store is open, the application defaults the date from the local device. Once the associate closes the store for the day and tries to re-open the store, the application adds 1 day to the current date and opens the store on a future date.<br>\r\nUsers cannot perform the Store close in such a scenario where the Store open date is in future date. The application throws a hard error and restricts the user from closing the store. The store could be closed the next day&nbsp;when the store open date and the system date are&nbsp;the same.</div>\r\n\r\n<h4><a name=\"auto-store-close\" id=\"auto-store-close\"></a>Auto Store Close</h4>\r\n\r\n<p>A store can be configured to be closed automatically by the system scheduler. This flag is located under&nbsp;Application Config -&gt; Manage POS Config -&gt; Backoffice Config -&gt; BO Store Config. The configuration includes user account, closing time, register id and setting auto store close to TRUE. A typical auto store close operation will be triggered by scheduler upon reaching the time of the business day and includes the operations below:</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n\t<li>Close all tills for the day (auto-reconcile all the tills), move expected till float and/or till amount to store amount or persist in till based on configuration explained in till reconcile section.</li>\r\n\t<li>Perform bank deposit and move all the amount collected in store amount across currencies.</li>\r\n\t<li>Void/cancel all suspended transactions.</li>\r\n\t<li>Void/cancel unconfirmed transactions.</li>\r\n\t<li>Finally perform store close operation with the expected store amount.</li>\r\n\t<li>Validate store is open - store should be Open, else store close will be skipped.</li>\r\n\t<li>Auto Store Close behavior with different closing timing configurations and with the business flag Default Store Open Date from System:&nbsp;</li>\r\n</ul>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 1168px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\">Local Device Date</th>\r\n\t\t\t<th scope=\"col\">Store Open Date</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 113px;\">Configured Time for Store Close</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 105px;\">Time the Store opened during the day</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 145px;\">BF Config - Default Store Open Date from System&nbsp;</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 318px;\">Application behavior</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 311px;\">Application behavior when the Auto Store close job is executed</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>16/03/2023</td>\r\n\t\t\t<td>16/03/2023</td>\r\n\t\t\t<td style=\"width: 98px;\">11:00:00 PM</td>\r\n\t\t\t<td style=\"width: 91px;\">10:00:00 AM</td>\r\n\t\t\t<td style=\"width: 131px;\">FALSE</td>\r\n\t\t\t<td style=\"width: 303px;\">Opening the store will create a Auto Store close job &nbsp;for 16-Mar-2023, 11 PM</td>\r\n\t\t\t<td style=\"width: 297px;\">Store is closed on 16-Mar-2023</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>16/03/2023</td>\r\n\t\t\t<td>25/03/2023</td>\r\n\t\t\t<td style=\"width: 98px;\">11:00:00 PM</td>\r\n\t\t\t<td style=\"width: 91px;\">10:00:00 AM</td>\r\n\t\t\t<td style=\"width: 131px;\">FALSE</td>\r\n\t\t\t<td style=\"width: 303px;\">Opening the store will create a Auto Store close job &nbsp;for 25-Mar-2023, 11 PM</td>\r\n\t\t\t<td style=\"width: 297px;\">Store is closed on 25-Mar-2023</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>16/03/2023</td>\r\n\t\t\t<td>16/03/2023</td>\r\n\t\t\t<td style=\"width: 98px;\">1:00:00 AM</td>\r\n\t\t\t<td style=\"width: 91px;\">10:00:00 AM</td>\r\n\t\t\t<td style=\"width: 131px;\">FALSE</td>\r\n\t\t\t<td style=\"width: 303px;\">Auto Store close will create a job to close the store for 17-Mar-2023, 1 AM&nbsp;</td>\r\n\t\t\t<td style=\"width: 297px;\">Store is closed on 17-Mar-2023</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>16/03/2023</td>\r\n\t\t\t<td>16/03/2023</td>\r\n\t\t\t<td style=\"width: 98px;\">11:00:00 PM</td>\r\n\t\t\t<td style=\"width: 91px;\">10:00:00 AM</td>\r\n\t\t\t<td style=\"width: 131px;\">TRUE</td>\r\n\t\t\t<td style=\"width: 303px;\">Opening the store will create a Auto Store close job &nbsp;for 16-Mar-2023, 11 PM</td>\r\n\t\t\t<td style=\"width: 297px;\">Store is closed on 16-Mar-2023</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>16/03/2023</td>\r\n\t\t\t<td>25/03/2023</td>\r\n\t\t\t<td style=\"width: 98px;\">11:00:00 PM</td>\r\n\t\t\t<td style=\"width: 91px;\">10:00:00 AM</td>\r\n\t\t\t<td style=\"width: 131px;\">TRUE</td>\r\n\t\t\t<td style=\"width: 303px;\">Opening the store will create a Auto Store close job &nbsp;for 25-Mar-2023, 11 PM</td>\r\n\t\t\t<td style=\"width: 297px;\">Store is closed on 25-Mar-2023</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>15/03/2023</td>\r\n\t\t\t<td>16/03/2023</td>\r\n\t\t\t<td style=\"width: 98px;\">1:00:00 AM</td>\r\n\t\t\t<td style=\"width: 91px;\">11:30:00 PM</td>\r\n\t\t\t<td style=\"width: 131px;\">TRUE</td>\r\n\t\t\t<td style=\"width: 303px;\">Opening the store will create a Auto Store close job for 16-Mar-2023, 1 AM &nbsp;<br>\r\n\t\t\t&nbsp;</td>\r\n\t\t\t<td style=\"width: 297px;\">Store will not be closed when the Auto Store Close job is executed on 16-Mar-2023 at 1 AM&nbsp;because there is a check not to close the store before 3 PM on a given day.&nbsp;<br>\r\n\t\t\tAnother Auto Store close job is created for 17- Mar -2023, 1 AM.&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>16/03/2023</td>\r\n\t\t\t<td>16/03/2023</td>\r\n\t\t\t<td style=\"width: 98px;\">1:00:00 AM</td>\r\n\t\t\t<td style=\"width: 91px;\">10:00:00 AM</td>\r\n\t\t\t<td style=\"width: 131px;\">TRUE</td>\r\n\t\t\t<td style=\"width: 303px;\">Auto Store close will create a job to close the store for 17-Mar-2023, 1 AM&nbsp;</td>\r\n\t\t\t<td style=\"width: 297px;\">Store is closed on 17-Mar-2023</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<div class=\"info\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px;\"><strong>Note</strong>: Before performing Automatic Store close on central, central server will check if there is any outbound sync of order/backoffice operations pending to be synced to central. Only when there is nothing to sync, the Auto store close operation will be performed on central server.</div>\r\n\r\n<div class=\"info\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px;\"><strong>Note</strong>: If tender reconciliation transaction is not created, store can still open for next business date.</div>\r\n\r\n<h4><a name=\"payment-reconciliation-handling-payment-void-due-to-order-cancelation\" id=\"payment-reconciliation-handling-payment-void-due-to-order-cancelation\"></a><strong>Payment Reconciliation - Handling Payment void due to order cancelation</strong></h4>\r\n\r\n<p>As part of the store close procedure, system tries to cancel all suspended and in-progress orders.&nbsp;&nbsp;</p>\r\n\r\n<p>If the in-progress order has one more payment (settlement/authorization/ refund transactions), the payment component tries to void those.&nbsp;If Void is successful, the respective payment transaction created gets closed, else remains open. This data can be used by external systems.&nbsp;&nbsp;Based on the payment type used and the configuration, void payment transactions are created.</p>\r\n\r\n<ul style=\"margin-left: 40px;\">\r\n</ul>\r\n\r\n<div id=\"\" style=\"left: 772.031px; top: 327.891px;\">&nbsp;</div>\r\n\r\n<div id=\"\" style=\"left: 772.031px; top: 327.891px;\">&nbsp;</div>\r\n\r\n<div id=\"\" style=\"left: 772.031px; top: 327.891px;\">&nbsp;</div>\r\n\r\n<div id=\"\" style=\"left: 772.031px; top: 327.891px;\">&nbsp;</div>\r\n\r\n<div id=\"\" style=\"left: 772.031px; top: 327.891px;\">&nbsp;</div>\r\n\r\n<div id=\"\" style=\"left: 772.031px; top: 327.891px;\">&nbsp;</div>\r\n\r\n<div id=\"\" style=\"left: 772.031px; top: 327.891px;\">&nbsp;</div>\r\n\r\n<div id=\"\" style=\"left: 772.031px; top: 327.891px;\">&nbsp;</div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 50939,
  "scraped_at": "2025-08-09T22:02:24.830770",
  "content_clean": "Home ››Manhattan Active® Omni››Store››Process & Configuration Guides››Point of Sale››POS Guides››BackOffice Transactions››Backoffice ››Backoffice Process Backoffice Process Backoffice ProcessDashboardStore OpenSystem Date is configured as Open DateOpening Twice scenarioOpen Date Not configured from System DateOpening Twice scenarioTill OpenBehavior with Different ConfigurationsTill Open OperationTake Till Out of Service (formerly labeled \"Till Close\")Till Disengage Close Till for the Day (formerly \"Till Reconcile\")Foreign (or alternate) currencyBehavior with Different ConfigurationsClose Till for the Day (formerly \"Till Reconcile\") OperationBank DepositForeign (or alternate) currencyPayment Type Configuration for Backoffice OperationStore CloseManual Store CloseAuto Store ClosePayment Reconciliation - Handling Payment void due to order cancelation Dashboard This guide outlines the Backoffice processes.  For details on any configurations referenced, see Backoffice Configuration. The dashboard is the landing page upon navigation to Back Office.  Here the user will see the current store open date, as well as the number of tills open, closed and reconciled for that day. Additionally, the number of registers for that location will be shown. Note: This number should equal the number of assigned registers for the store in master data. If a register is created, but is not in an assigned status, it will not be included in this count. As of Release 23.3, a new version of Back Office is available via Change in Behavior. This new Back Office will overwrite the existing one.  Within the new Back Office, the user will see a change in the grouping and labeling of some menu actions. The menu will now be grouped by operation. Additionally, the Close Till function will now be re-labeled \"Take Till Out of Service\" and the Till Reconciliation function will be re-labeled \"Close Till for Day\". Denominations are used to count and calculate the total value for the backoffice operation. It's only for ease of counting and to avoid manual errors. We do not save these user-entered denominations in the backend. Store Open Store should be opened prior to performing a sale transaction. Opening a store includes assigning a business day and counting initial amount of money in the store safe (store float). Business day should always be greater than the previous one (if any) but not necessarily the next one  - 'skips' can happen for example if store is closed on Sundays. Store Open Date can be either assigned manually or defaulted directly from the device OS date. System Date is configured as Open Date When the Default Store Open Date from System configuration is set to True, the Store Open date is defaulted from the device OS date and users do not have the ability to manually change the store open date in this scenario. There can be instances when the user accidentally closes the store during the day and then it is necessary to open twice, necessitating rolling forward of store open date. To avoid such a situation in the first place where the user may accidentally close the store, the application displays a warning message to the user while closing the store.  Users still have the ability to close the store but at least the application gives the warning message to keep them informed that they will be closing the store.  This warning message is prompted only when the users try to close the store before a specific time of the day.  Currently, the timing is hard coded to 3PM, which the application reads from the local time of the device. In case the user tries to close the store post 3PM the warning message is not displayed and store close is performed. Opening Twice scenario To avoid such a situation where the user may accidentally close the store, the application displays a warning message to the user while closing the store. Users still have the ability to close the store but at least the application gives the warning message to keep them informed that they will be closing the store. This warning message is prompted only when the users try to close the store before a specific time of the day. Currently, the timing is hard coded to 3PM, which the application reads from the local time of the device. In case the user tries to close the store post 3PM the warning message is not displayed and store close is performed. In spite of warnings, there can still be scenarios in which the store is closed and must be reopened - for example, associate mistakenly closes too early, or a big spender customer walks into the store after close and wants to make a purchase.  But with this business flag Default Store Open Date from System enabled, associates can still open the store again on the same day.  However, the new Store Open date automatically rolls forward and is now the current date +1 day i.e. the next business day. The procedure in such case is to allow the store to remain open overnight until it runs through the next day and is closed at that time. Open Date Not configured from System Date If the flag Default Store Open Date from System is set to False, the user can manually configure the Store Open Date. Opening Twice scenario In a scenario scenarios in which the store is closed and must be reopened, when the Open Date is not taken from the system date the user manually selects an Open date.  The only requirement is, this must be a future date.  If the store was closed for March 1, for example, it can't be reopened for March 1 or February 28. In case the store was somehow opened on a different future date due to reasons like the device date was incorrectly set to future date, or before setting the mentioned configuration to True the dates were not synced appropriately etc. then the same store cannot be open in date prior to already displayed on the device.  Whenever, user tries to open the store the application throws an error that the store was opened on a future date with the most recent store open date highlighted.  User can then only open the store on a later date than displayed on the device. The expected store float amount for first business day of the store - 'Day One' - is pulled from configuration.  For all other successive days it will be pulled from previous business days store close amount. If there is any variance in expected float and the entered store amount then it requires an mandatory explanation (comment) and/or a confirmation.  Store float uses store base currency as defined in Backoffice denomination table. Depending on configuration it can be counted as a total or by details (denominations, that is 20 5-dollar bills, 30 10-dollar bills, so on). Store opening can be \"blind\", which means that the expected store float is not displayed (but still used for validation). The store open procedure can be considered a transaction, which consumes next available transaction number and is recorded in TLOG together with the entered float amount/denominations and relevant configuration values (default store float, blind flag, counting method, and so on). Note: Each float element can configured to be entered either as a \"total\" or \"by denominations\" but not both. Important: We cannot open the store the same day more than once. If it is closed on a business day, the earliest it can be opened is the next day. Description: Open store operation is usually done by a store manager. The steps include: Validate input parameters - Business day, Store float amount (total or by denomination id's), location (read from the logged in user), currency codes (defaulted to store base currency), tender types (defaulted to cash) Validate store is closed- A store can be opened only when the store is in \"CLOSED\" status, or it is being opened for the first time. Validate business rules - store is closed, business day is greater than the previous one Validate store float - If inputted store float fails to match expected value, request explanation or re-entry: Case 1: Initial business date for a location: store float should equal the configured default value for new location Case 2: All subsequent business dates for the location: store float should equal the amount from previous business days store close amount If store open captures Store Float with detail, aggregate them to calculate total store amount. Update Store Ops Values - Set store amount to the entered amount by user, set business day, set store status to OPEN Create TLOG event including operation name and parameters as well as relevant configuration values Till Open A till,  the plastic tray used to sort cash denominations and checks, must be opened before it can be used. Opening a Till is a Store Ops transaction which includes associating the till with a cash drawer, and confirming the Till Float, or starting cash value. Till Float uses the store's base currency and represents only Cash tender. Till Float can be configured to accept count as either simple cash total, or with detail.  Detail requires a breakdown by denomination.The sequence of the currency denominations are displayed based on the created timestamp by default. Ex: Quantity 20: 5 dollar bills; Quantity 30: 10 dollar bills; etc. Till opening can be \"blind\". Blind opening means that the expected till float is not displayed on the screen for the user, but it is still used for validation purposes.If Till Float entered does not match the expected, then re-entry or confirmation is required, along with an explanatory comment. The till open procedure is considered a transaction, which consumes the next available transaction number and is recorded in the TLOG. This transaction includes the entered float amount, till and drawer IDs and relevant configuration values (default till float, blind flag, etc). Note: During a given business day, every till can be opened only once. And each float value can be configured to be entered either as a \"total\" or \"by denominations\" but not both. Behavior with Different Configurations When the till is opened for the first time then the expected till float is the configured default.  Subsequent till float behavior depends on the \"Combine Reconciliation Amounts\" and \"Persist Amount in Till\" configurations Configuration type 1: Combine Reconciliation Amounts = False (Persist Amount in Till is not considered) Till Amount = Total amount of cash tender in the till Expected Till Float = Till float entered by user during the till's most recent reconciliation transaction Configuration type 2: Combine Reconciliation Amounts = True AND Persist Amount in Till = False Till Amount = Total amount of cash tender in the till Expected Till Float = expected amount as per Back Office configuration Note: The expected amount for each Till Open will match the configured default value regardless of tender reconciled in the previous day since Persist Amount in Till = False. Configuration type 3: Combine Reconciliation Amounts = True AND Persist Amount in Till = True Till Amount = Total amount of cash tender in the till Expected Till Float = Till float entered by user during the till's most recent reconciliation transaction Note: For all types of configurations above, If the entered till amount matches the expected amount, no variance is captured.  Otherwise user is prompted to re-enter the amount, or confirm the originally entered amount with a comment. Variances will be captured if the user confirms the entered amount. Till Open Operation Open Till operation is usually done by a store manager, but any user with right permission should be able to open a till. The steps include: Validate input parameters - Drawer Id (till Id is not validated; if it's not found the new till will be created), till float (denomination Ids, counts/amounts), currency codes (defaulted to store base currency), tender types (defaulted to cash). Only those users who have the grants can manually enter the till number while others can only select from the list of Available Tills to Open the Till. This is controlled by a business flag \"Secure Manual Till Entry With Grant\" in BO Till Configuration and a resource id \"ui::backoffice::addnewtill\" Validate business rules - store is open, till is not open and has not been open today, drawer is empty, store amount has enough money. If till float is counted by denomination, aggregate them to calculate total. Create record in till entity if needed, move required amount of money from store safe to till, set till status to OPEN and drawer Id attribute to specified value. Create TLOG event including operation name and parameters as well as relevant configuration values If \"pop-up cash drawer during till open\" = TRUE in BO till configuration then the till open operation follows below steps: During till open process, cash drawer is engaged and a new backoffice transaction is created in open status. Cash drawer is popped out to allow user to insert the till with cash access cash in existing till to count the float amount. User will not be allowed to navigated to any other screens within store app, until user confirms or cancel this transaction. Till Status is updated to \"Pending Open\" and state is updated as \"Till Open\". Upon till open confirmation, cash drawer is disengaged upon receiving acknowledge from user that cash drawer is closed, and backoffice transaction is moved to closed status. If user chooses to cancel, cash drawer is disengaged and backoffice transaction is moved to cancelled status. Fixed registers: User can only open the till with cash drawer assigned to the fixed register. If the cash drawer assigned to the register is already open then user can't open any other tills from this register. Mobile registers: User can scan the cash drawer and open the tills until the till and cash drawers is in valid state, no restrictions unlike the fixed registers. Note: If central server cannot be reached, and Store is running on an edge server, Till Open operations will be pulled from central using scheduled jobs if it was opened during that day. However, retailers can perform till open operations on edge server as well. Variance validation with till float will be skipped in edge mode. Important: Till cannot be deleted if amount is persisted in the till from previous day. Take Till Out of Service (formerly labeled \"Till Close\") Till is tagged to prevent being used for any further transactions during that business day but it is not reconciled for the day. A till can be closed only when it is in open status. After closing the till, it cannot be opened further in the current business day but it can be reconciled. This menu option is not a common operation and the function can be hidden by enabling the business flag \"Hide Close Till Function\" in the BO Till Configuration Till Disengage During the day, the till can be engaged by any register/user. On completion of a transaction, the till will be systematically disengaged. In the event of a mechanical or communication error, the till may fail to disengage and become unusable. A store manager may choose to forcibly disengage the till, thus restoring its functionality. Close Till for the Day (formerly \"Till Reconcile\") A till is closed for the day via reconciliation, which is the process of verifying the amount of cash, check or travelers' check in a cash register by counting.  The counted is compared to the expected amount which has been computed by POS during the day for that till. Reconciliation is generally completed at the end of the business day, however, the verification can also take place whenever a different associate takes over a register with a different Till.  Tills which are in \"Open\" or \"Taken Out Of Service\" (formerly Closed) status can be reconciled.  Once the till is Closed for Day (Reconciled) it cannot be re-opened until the next business day. During Till Reconciliation, Back Office prompts the user for the till float and the till amount.  The till amount captures the total of all tenders maintained in a till (cash, checks, etc).  Till float is the portion of cash from the till amount which will be persisted in the till for the next business date. The difference between the till amount and till float will be moved from the till to the store safe.  These values may be combined through configuration, in which case, only the Till Amount will be requested. Tender counts can be entered as a simple total, or with detail. For cash tender, detail requires a breakdown by denomination (e.g. 20 5-dollar bills, 30 10-dollar bills, so on). For Check and Traveler's Check tenders, detail requires counts of check-type documents collected and the sum of tender amount for the check type. Till reconciliation can be \"blind\", which means that the expected till float is not displayed, but is still used for validation. If amount entered does not match the expected, then Backoffice requires a re-entry or a confirmation with an explanatory comment. Foreign (or alternate) currency If an alternate currency is collected during a cash transaction, users will be able to enter the total amount taken during reconciliation.  The expected alternate currency amount will be displayed along with the existing expected base currency. This expected amount will be shown in the alternate currency, not in the base currency. tap \"+ Add Foreign Currency\" Select currency from dropdown Enter amount taken Once entered, the totals at the bottom will be updated with the converted amount.  If the user selects a foreign currency in error, they can simply press the \"Remove\" button and the alternate currency line will be removed. Note: Once a till is reconciled, it cannot be used until the following business day. Variance Confirmation: If BO store configuration has variance confirmation value set up, then in case of any \"till reconcile\" variance user will be asked to confirm the variance. Behavior with Different Configurations Two configurations dictate how tender is shifted from Till to Store Safe: \"Combine Reconciliation Amounts\" and \"Persist Amount In Till\" Configuration type 1: \"Combine Reconciliation Amounts\" = False, (\"Persist Amount In Till\" is not considered) Reconciliation prompts for both till amount and till float. Both entries are required to complete the reconciliation. Till amount captures all tender maintained in the till. Till float is the portion of the cash till amount which will remain in the till in order to start the next business day. The expected till amount is the total Cash and check-type tenders in the till If the entered till amount matches the expected till Amount, then no variance is captured. Otherwise, backoffice will prompt for re-entry, or confirmation with a comment. Variance will be captured if the user confirms the count. After till reconciliation, the till float remains in the till. This amount is used as the as expected amount of the till open for the following business day. After till reconciliation, the difference between the cash i.e. till amount and the till float is moved to the store safe. This amount is added to the expected safe amount, and is available for bank deposit and store closure. After till reconciliation, check-type tenders are always moved to the store safe. This tender is then available for bank deposit. Configuration type 2: \"Combine Reconciliation Amounts\" = True, \"Persist Amount In Till\" = False Reconciliation prompts for only till amount. The expected till amount is the total cash and check-type tenders in the till. If the entered till amount matches the expected till amount, then no variance is captured. Otherwise, Backoffice will prompt for re-entry, or confirmation with a comment. Variance will be captured if the user confirms the count. After till reconciliation, the full cash till amount is moved to the store safe. No amount is persisted in the till. This amount is added to the expected safe amount, and is available for bank deposit and store closure. After till reconciliation, check-type tenders are always moved to the store safe. This tender is then available for bank deposit. Note: The expected amount for each till open will match the configured default value, regardless of tender reconciled in the previous day. Configuration type 3: \"Combine Reconciliation Amounts\" = True, \"Persist Amount In Till\" = True Backoffice prompts for only till amount The expected till amount is the total cash and check-type tenders in the till If the entered till amount matches the expected till amount, then no variance is captured. Otherwise, backoffice will prompt for re-entry, or confirmation with a comment. Variance will be captured if the user confirms the count. After till reconciliation, the full cash till amount is persisted in the till. No amount is moved to the store safe . This amount is used as the as expected amount of the till open for the following business day. After till reconciliation, check-type tenders are always moved to the store safe. This tender is then available for bank deposit . Close Till for the Day (formerly \"Till Reconcile\") Operation Reconcile till operation is usually done by a store manager, but any user with right permission should be able to reconcile a till. The steps include: Select the till that needs to be reconciled. Based on configuration \"Combined Reconcile\" = true/false and \"Persist amount in till\" = true/false, enter till float (the amount used to persist in the till) and till amount separately, else the total amount collected in the till can be entered. (Check explanation in above sections) Till float amount is not validated. Its just persisted in the till as till amount for successive days. Validate till amount - If the entered till amount does not match with amount collected in the till including till float, then comments for variance and confirmation is required. If amount is specified by denomination, aggregate them to calculate total. (Till float is always by total) Create record in till entity if needed, Based on configurations move money from till to store safe or persist in till, set till status to reconciled and drawer Id is cleared i.e. disassociated with the till. Create TLOG event including operation name and parameters as well as relavant configuration values. If \"pop-up cash drawer during till reconcile\" = TRUE in BO till configuration then the till reconcile operation follows below steps: During till reconcile process, cash drawer linked to the till is engaged and a new backoffice transaction is created in open status. Cash drawer is popped out to allow user to count the float and/or till amount. User will not be allowed to navigated to any other screens within store app, until user confirms or cancel this transaction. Till Status is not updated yet and state is updated as \"Till Reconcile\". Upon till reconcile confirmation, cash drawer is disengaged upon receiving acknowledge from user that cash drawer is closed, and backoffice transaction is moved to closed status. If user chooses to cancel, cash drawer is disengaged and backoffice transaction is moved to cancelled status. Fixed registers: User can only reconcile the till with cash drawer assigned to the fixed register. If the cash drawer assigned to the register is not open or already reconciled then user can't reconcile any other open tills from this register. But user can still reconcile closed tills from this register Mobile registers: User can scan the cash drawer and reconcile any tills until the till and cash drawers is in valid status/state, no restrictions unlike the fixed registers. Note: Reconcile process will not engage cash drawer when \"pop-up cash drawer during till reconcile\" = TRUE. Closed tills can be reconciled from any registers. Bank Deposit Tender included in the Store Safe amount is eligible to be deposited to the Bank. Bank deposit is supported for store base currency code as well as altenrate currencies.  Each deposit can include cash and/or check and/or traveler's check collected as store amount.  Depending on configuration it can be counted as \"no Count\", \"total\" or \"by details\" (denominations, that is 20 5-dollar bills, 30 10-dollar bills, so on). If the amount is a check or a traveler's check, the details are by counts of the individual check documents collected along with sum of amount of all the checks. If it is configured to be \"No Count\", all the money collected as store amount will be deposited in a single transaction per currency code. Note: Bank Deposit can be configured to be entered as “no count”, “total” or “by denominations” but not as a combination. Additionally, when flag “Show suggested cash for Deposit” in BO store configuration is turned \"ON\" then bank deposit screen will show 2 more labels such as below to suggest store users on the cash that is available for deposit leaving the store float. Suggested cash for Deposit - This is calculated by subtracting store float amount during store open from Store safe amount. If this comes as negative then suggest cash for deposit will be shown as 0 Store float/Configured store float - When flag \"Calculate Suggested Deposit Using Configured Store Float\" is turned on then store float amount is picked from BO configuration and not from store open operation, and that is used in calculation of suggested cash for deposit. If retailer is persisting amount in till, and flag \"Include Till Amount To Calculate Suggested Deposit\" is turned \"ON\" then the amount in till after reconciliation is also considered during calculation of suggested cash for deposit. Foreign (or alternate) currency If an alternate currency is collected during a cash transaction, users will be able to enter the total amount taken during the bank deposit.  The expected alternate currency amount will be displayed along with the existing expected base currency. This expected amount will be shown in the alternate currency, not in the base currency. tap \"+ Add Foreign Currency\" Select currency from dropdown Enter amount taken Once entered, the totals at the bottom will be updated with the converted amount.  If the user selects a foreign currency in error, they can simply press the \"Remove\" button and the alternate currency line will be removed. Bank Deposit operation is performed before the close of the store. There is no limit for a Bank deposit transaction, it can be performed any number of times until the close of store. Once the store is closed, bank deposit cannot be performed. The steps include: Ensure that all or some tills are reconciled, and there is enough money to be deposited. Select bank deposit and the currency that needs to be deposited. Validate deposit amount or count per currency — if the entered deposit amount is more than available cash or entered deposit count is more than available count (applicable if configured as details) then hard error is displayed. Nothing to deposit — if store was just opened or none of the tills are reconciled in which case store amount will not be available. If bank deposit amount is specified by denomination, aggregate them to calculate total. Create record in backoffice transaction and update store amount entity, move required amount of money from store amount. Create TLOG event including operation name and parameters as well as relevant configuration values. Payment Type Configuration for Backoffice Operation By default, Backoffice provides three payment types i.e Cash, Check and Traveler's Check to count/include in Till Reconciliation, Bank Deposit.  These also appear in the different back office reports. Depending upon the nature of their specific business, retailers can configure two of these 'countable/reconcilable' payment types - Traveller's Check and Personal Check - either TO BE DISPLAYED and counted or NOT TO BE DISPLAYED or counted, at the Reconciliation, Bank Deposit screens along with various reports. NOTE: Cash payment type is by default displayed on these screens and reports and is not driven by any configuration. Check and Traveler's check payment types are required to be present in the system. If you don't support these payment then disable it using above config. DONT DELETE these seed data, deleting will impact store close procedures. Store Close The Store should be closed after all the transactions are completed for the business day. Closing a store includes closing the current business day and recording the remaining Store Safe amount after the completion of all Till Pick-Ups, Till Reconciliations and Bank Deposits. All tills must be reconciled at a Store before it is eligible for Store Closure. On Store Closure, several processes are executed on the store's transactions, including Payment Reconciliation and Abandoned Order Cancellation. Payment Reconciliation will review all SAF transactions and incomplete Request Logs, and update the associated payment transaction with the latest status from the payment gateway. Abandoned Order Cancellation will cancel all open and suspended orders. Outstanding payments may be voided at this time. Once these processes are complete, the Store's status will be marked as Closed. Store amount typically uses the Store's base currency. Store Float can be configured to accept count as either a simple cash total, or with detail. Detail requires a breakdown by denomination (e.g. 20 5-dollar bills, 30 10-dollar bills, so on). Store Close can be \"blind\", which means that the expected Store float is not displayed, but is still used for validation. If the Store float entered does not match the expected, then Backoffice requires a re-entry or a confirmation with an explanatory comment. The till open procedure is considered a transaction, which consumes next available transaction number and is recorded in TLOG together with the entered float amount/denomination, till/drawer Ids, and relevant configuration values (default till float, blind flag, counting method, so on). Important: Store amount can be configured to be entered either as a \"total\" or \"by denominations\" but not both. Important: Store close is only for cash. \"Traveler's check\" and \"check\" if not deposited in bank will be carried to next business day. Variance Confirmation: If BO store configuration has variance confirmation value set up, then in case of any \"store close\" variance user will be asked to confirm the variance. Manual Store Close Description: Close store operation is usually done by a store manager. The steps include: Validate all tills are closed for the day (reconciled) - all the tills should be reconciled, else a hard check error is displayed. Execute payment reconciliation.  Refer this link to get more on payment reconciliation process. Check for suspended transaction - if there are any suspended transaction during the day, list them and void/cancel after confirmation from user.   This includes order in waiting room too. Cancel unconfirmed orders - all unconfirmed orders for the given store are canceled.  This could happen due to  reasons like; device runs out of battery while in middle of the transaction. If there are any tendered order, system voids the tenders before order is marked as canceled. Cancel open Back office transactions. Validate store is open - a store can be closed only when the store is in \"OPEN\" status. Validate input parameters - store amount (total or by denomination id's), location (read from the logged in user), currency codes (defaulted to store base currency), tender types (defaulted to cash), If store amount entered does not match expected store amount, ask user for an comments and/or confirmation. If store amount is specified by denomination, aggregate them to calculate total Set store safe to entered amount, set store status to CLOSED Upon Store Close transaction creation, raise event to kick off Tender Reconciliation transaction and post document to message queue. Create TLOG event including operation name and parameters as well as relevant configuration values. Note: If the Store close operation is performed when store is running on edge mode, then the same will be pushed to central during outbound sync. Since there will be a risk of central having some suspended/abandoned transaction or some tills might still be opened on central before it went offline. Store close sync operation will validate and reconcile all tills on central with expected amount, and also kill all suspended/abandoned transactions and then save store close operations on central during outbound sync. Note: The Backoffice Store Operation has a Refresh button which allows the users to refresh the list of all the suspended orders. While a manager is performing the Backoffice operations, there can be some orders that are suspended during this time by the users. This button helps to show the list of all the suspended orders to keep the managers aware. Note: When the business flag Default Store Open Date from System is set to True the application allows the associate to open the store twice during the same day. The first time when the store is open, the application defaults the date from the local device. Once the associate closes the store for the day and tries to re-open the store, the application adds 1 day to the current date and opens the store on a future date. Users cannot perform the Store close in such a scenario where the Store open date is in future date. The application throws a hard error and restricts the user from closing the store. The store could be closed the next day when the store open date and the system date are the same. Auto Store Close A store can be configured to be closed automatically by the system scheduler. This flag is located under Application Config -> Manage POS Config -> Backoffice Config -> BO Store Config. The configuration includes user account, closing time, register id and setting auto store close to TRUE. A typical auto store close operation will be triggered by scheduler upon reaching the time of the business day and includes the operations below: Close all tills for the day (auto-reconcile all the tills), move expected till float and/or till amount to store amount or persist in till based on configuration explained in till reconcile section. Perform bank deposit and move all the amount collected in store amount across currencies. Void/cancel all suspended transactions. Void/cancel unconfirmed transactions. Finally perform store close operation with the expected store amount. Validate store is open - store should be Open, else store close will be skipped. Auto Store Close behavior with different closing timing configurations and with the business flag Default Store Open Date from System: Local Device Date Store Open Date Configured Time for Store Close Time the Store opened during the day BF Config - Default Store Open Date from System Application behavior Application behavior when the Auto Store close job is executed 16/03/2023 16/03/2023 11:00:00 PM 10:00:00 AM FALSE Opening the store will create a Auto Store close job  for 16-Mar-2023, 11 PM Store is closed on 16-Mar-2023 16/03/2023 25/03/2023 11:00:00 PM 10:00:00 AM FALSE Opening the store will create a Auto Store close job  for 25-Mar-2023, 11 PM Store is closed on 25-Mar-2023 16/03/2023 16/03/2023 1:00:00 AM 10:00:00 AM FALSE Auto Store close will create a job to close the store for 17-Mar-2023, 1 AM Store is closed on 17-Mar-2023 16/03/2023 16/03/2023 11:00:00 PM 10:00:00 AM TRUE Opening the store will create a Auto Store close job  for 16-Mar-2023, 11 PM Store is closed on 16-Mar-2023 16/03/2023 25/03/2023 11:00:00 PM 10:00:00 AM TRUE Opening the store will create a Auto Store close job  for 25-Mar-2023, 11 PM Store is closed on 25-Mar-2023 15/03/2023 16/03/2023 1:00:00 AM 11:30:00 PM TRUE Opening the store will create a Auto Store close job for 16-Mar-2023, 1 AM Store will not be closed when the Auto Store Close job is executed on 16-Mar-2023 at 1 AM because there is a check not to close the store before 3 PM on a given day. Another Auto Store close job is created for 17- Mar -2023, 1 AM. 16/03/2023 16/03/2023 1:00:00 AM 10:00:00 AM TRUE Auto Store close will create a job to close the store for 17-Mar-2023, 1 AM Store is closed on 17-Mar-2023 Note: Before performing Automatic Store close on central, central server will check if there is any outbound sync of order/backoffice operations pending to be synced to central. Only when there is nothing to sync, the Auto store close operation will be performed on central server. Note: If tender reconciliation transaction is not created, store can still open for next business date. Payment Reconciliation - Handling Payment void due to order cancelation As part of the store close procedure, system tries to cancel all suspended and in-progress orders. If the in-progress order has one more payment (settlement/authorization/ refund transactions), the payment component tries to void those. If Void is successful, the respective payment transaction created gets closed, else remains open. This data can be used by external systems.  Based on the payment type used and the configuration, void payment transactions are created."
}