{
  "success": true,
  "permalink": "cancellations",
  "title": "Order Cancellation",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158714\" href=\"/digital-self-service-3\" class=\"breadcrumb-links\">Digital Self-Service</a></li><li> <span>››</span>Order Cancellation</li></ul>  \t\r\n\t\t<h2>Order Cancellations in Digital Self-Service</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/cancellations$overview\">Overview</a><ul><li><a href=\"/cancellations$cancellation-flow\">Cancellation Flow</a><ul><li><a href=\"/cancellations$cancelling-post-released-items\">Cancelling Post-Released Items</a></li><li><a href=\"/cancellations$authorization-reversal-or-refund-for-partial-order-cancellation\">Authorization Reversal or Refund for Partial Order Cancellation</a></li><li><a href=\"/cancellations$estimated-new-order-totals\">Estimated New Order Totals</a></li><li><a href=\"/cancellations$determining-item-eligibility\">Determining Item Eligibility</a></li><li><a href=\"/cancellations$implementing-a-user-exit-for-item-eligibility-nbsp\">Implementing a User Exit for Item Eligibility&nbsp;</a></li><li><a href=\"/cancellations$using-the-browser-back-button\">Using the Browser Back Button</a></li></ul></li><li><a href=\"/cancellations$customizing-for-your-brand\">Customizing for your Brand</a></li></ul></li><li><a href=\"/cancellations$configuration\">Configuration</a><ul><li><a href=\"/cancellations$cancel-reasons\">Cancel Reasons</a></li><li><a href=\"/cancellations$cart-configuration\">Cart Configuration</a></li></ul></li><li><a href=\"/cancellations$implementation-flavors\">Implementation Flavors</a></li><li><a href=\"/cancellations$feature-scope\">Feature Scope</a></li><li><a href=\"/cancellations$how-to-test\">How to Test</a></li></ul></div>\r\n\r\n<h3 data-pm-slice=\"0 0 []\"><a name=\"overview\" id=\"overview\"></a>Overview</h3>\r\n\r\n<p>In Digital Self-Service, customers can cancel items from orders placed in&nbsp;any channel (e-commerce, call center, point of sale)&nbsp;and fulfilled in any delivery method (ship to home, buy online pick up in&nbsp;store (BOPIS), ship to store). Cancellations are supported for ship to home and ship to store items until released status. BOPIS items can be canceled until they are picked up.</p>\r\n\r\n<p>Customers can initiate the self-service cancellation flow in a few different ways. One is via the link provided in a transactional&nbsp;email such as the pickup reminder. Another is if the retailer provides a link to cancel&nbsp;in the customer’s My Account page in e-commerce. A third way to initiate the flow is if the retailer offers a link in e-commerce to initiate cancel, even for customers who are not logged in.</p>\r\n\r\n<p>Customers can select items to cancel and a cancellation reason. Cancel&nbsp;reasons can optionally be shared with the reasons displayed in customer service, or they can be distinct and specific to Digital Self-Service.&nbsp;After selecting items, customers can view their estimated new order total. After confirming the cancellation,&nbsp;the customer receives a confirmation email. See <a href=\"https://omni.helpdocsonline.com/order-cancellation-2\">here </a>for more details.</p>\r\n\r\n<h4><a name=\"cancellation-flow\" id=\"cancellation-flow\"></a>Cancellation Flow</h4>\r\n\r\n<p>The cancel page is broken into three pages: a&nbsp;cancellation selection page, a cancellation preview page, and a cancellation confirmation page. The cancellation selection page lists items in two groups: items&nbsp;eligible for cancellation and items ineligible for cancellation. Items are deemed eligible for cancellation based on the order configuration in the order modification rules. For example, a ship to home item that's already been shipped is ineligible for cancellation, while a BOPIS item that is ready for pickup is eligible for cancellation.</p>\r\n\r\n<p>On the preview page, the customer can view their selected items and reasons, estimated new order total, and canceled items total. They can go back to edit their selections or confirm to cancel the selected items. Digital Self-Service integrates with the cart to&nbsp;provide&nbsp;an estimated new order total and canceled items total, before the customer commits to the cancellation.&nbsp;See here for more details on the&nbsp;<a href=\"http://omni.helpdocsonline.com/cart-and-preview-mode\">cart component</a>.</p>\r\n\r\n<p>After the user confirms cancellation, the confirmation UI displays a summary of the cancelled items.&nbsp;It is possible that a user will be canceling an&nbsp;item and that item's status changes from eligible to ineligible for cancellation. In these instances, the user will be notified and the cancellation will not be processed. The confirmation page will display a real time response of the order cancellation. If the cancellation request was fully successful or unsuccessful, the UI will display the correct response with updated order totals. If the order cancellation request or part of the request is in progress, the UI will state that cancellation has been requested and an email will be sent to the customer with cancellation details. For example, if an order line is being&nbsp;canceled by a customer but it is currently being picked by the store associate, this order line will be requested and an email will be sent to the customer to confirm once cancellation is successful.&nbsp;If the order is partially canceled, an auth reversal is executed for only the amount that the total has been reduced by canceling the chosen&nbsp;order line.</p>\r\n\r\n<p><img height=\"896\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/image(129).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1L2ltYWdlKDEyOSkucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUzOTI1fX19XX0_&Signature=ZtM6oDejnvnIBJgdHAhN1Ea6EADsQ33QOq92C5vwlCAMWn5AXN7WVFgTQhON63iDJ-yPkQ6mifsikul6mdo9mQX8HDBpk-RiB7XiqdfwtCf3VIiVdiCwcmk8RxrxCXnRHxBqFSjeYEkoyZwVw6gAY2ykRqeM~xiuHjbZ3R2MkA0~dR6kE8qlYg3AlhAfiA7bLvHT~~fVNk~G5m0rW8chO1g0tSF0V7LmiifqCWt9GrNQzTHVaS8WU6RPv~hk3SGocAYcUOcL-vuOuHDWtkgxk8Qp~y9T9XLwjwroJT~PIrL0yrKLzDzbIxtptQDKHxBXh7reuApvGSRhQXnzj8J91A__&Key-Pair-Id=K2TK3EG287XSFC\" width=\"691\"></p>\r\n\r\n<h5><a name=\"cancelling-post-released-items\" id=\"cancelling-post-released-items\"></a>Cancelling Post-Released Items</h5>\r\n\r\n<p>For details on cancellation of items which have already been released for fulfillment, see the <a href=\"https://omni.helpdocsonline.com/lateordercancellation\">Late Order Cancellation</a>&nbsp;guide.</p>\r\n\r\n<h5><a name=\"authorization-reversal-or-refund-for-partial-order-cancellation\" id=\"authorization-reversal-or-refund-for-partial-order-cancellation\"></a>Authorization Reversal or Refund for Partial Order Cancellation</h5>\r\n\r\n<p>When a partial cancellation is initiated from the self-service UI, a payment request is generated in 'CalculateAndExecute' mode, triggering immediate processing of the refund or authorization reversal.</p>\r\n\r\n<p>For example, an order is placed with two lines, each priced at $50, resulting in a total order amount of $100. At the time of order creation, a $100 authorization is created against the credit card payment method. If Line 1 is canceled, an authorization reversal of $50 is initiated for the canceled amount. This leaves a remaining authorization of $50, corresponding to Line 2, and the eligible refund amount at this point becomes $50. If Line 2 is subsequently canceled, another $50 authorization reversal is created, fully releasing the original $100 authorization.</p>\r\n\r\n<p lang=\"en-US\">In cases where the order has a prepaid settlement, meaning the payment has already been captured, a&nbsp;refund transaction is created instead of an authorization reversal when a line is canceled.</p>\r\n\r\n<h5><a name=\"estimated-new-order-totals\" id=\"estimated-new-order-totals\"></a>Estimated New Order Totals</h5>\r\n\r\n<p>On the preview page, the estimated new order totals are&nbsp;calculated by the cart component. These values are not yet saved in the order, as the user has not yet confirmed cancellation. The estimated new order totals (Order Summary) map to the below values in the cart:</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 700px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\" style=\"width: 129px;\"><strong>UI Field</strong></th>\r\n\t\t\t<th scope=\"col\" style=\"width: 343px;\"><strong>Order Data</strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 126px;\">Subtotal</td>\r\n\t\t\t<td style=\"width: 341px;\">Preview of the new order subtotal (sum of item prices times quantity for all lines), if the selected items are cancelled</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 126px;\">Shipping</td>\r\n\t\t\t<td style=\"width: 341px;\">Preview of the new order total charges, if the selected items are cancelled. This includes all charge types. The UI label, along with all others, can be modified as required if a retailer wants to name this \"Charges\" or something specific to their business.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 126px;\">Discounts</td>\r\n\t\t\t<td style=\"width: 341px;\">Preview of the new order total discounts, if the selected items are cancelled</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 126px;\">Tax</td>\r\n\t\t\t<td style=\"width: 341px;\">Preview of the new order total taxes, if the selected items are cancelled</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 126px;\">Total</td>\r\n\t\t\t<td style=\"width: 341px;\">Preview of the new order total, if the selected items are cancelled</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 126px;\">Old Order Total</td>\r\n\t\t\t<td style=\"width: 341px;\">Current order total, to show the customer the difference between the proposed new order total and the old order total</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 126px;\">Cancelled Items Total</td>\r\n\t\t\t<td style=\"width: 341px;\">Total value of items selected for cancellation</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>The new order totals are displayed on the confirmation UI, in scenarios where the cancellation is already processed. The new order totals are not displayed on the confirmation UI in scenarios where the item is requested for cancellation, but the fulfillment system has not yet responded. In these scenarios, the order line status is not yet cancelled in the order component, so the new order total would not accurately reflect the cancelled items. Totals displayed on the confirmation page come from the order instead of the cart.</p>\r\n\r\n<h5><a name=\"determining-item-eligibility\" id=\"determining-item-eligibility\"></a>Determining Item Eligibility</h5>\r\n\r\n<p>Items are deemed eligible or ineligible for cancellation based on a few factors:</p>\r\n\r\n<ul>\r\n\t<li>If an item is cancelled or requested for cancellation (\"CancellationRequestStatus\" is not null)</li>\r\n\t<li>An item must be in a status eligible for cancellation based on the restrictFromStatus defined in the Order Configuration UI. If a line is post-released, the item is only eligible for cancellation if the above criteria are met and 'Allow post-release cancellation' is enabled in the Order Configuration UI.</li>\r\n</ul>\r\n\r\n<p>The eligible mod types API is used by DSS to determine if an order line is eligible or ineligible for cancellation. If the OrderLine::Cancel mod type is listed in the OrderLinePermittedModTypes, then a line is eligible for cancellation. The eligible mod types API uses the logic described above to determine item eligibility.</p>\r\n\r\n<h5><a name=\"implementing-a-user-exit-for-item-eligibility-nbsp\" id=\"implementing-a-user-exit-for-item-eligibility-nbsp\"></a>Implementing a User Exit for Item Eligibility&nbsp;</h5>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 694px;\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 261px;\">User Exit</td>\r\n\t\t\t<td style=\"width: 398px;\">Sample Use Case</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 261px;\">Order:Order:UserExit:GetPermittedModTypes</td>\r\n\t\t\t<td style=\"width: 398px;\">This user exit can be used to customize the modification types permitted for an order. An example is if a BOPIS to Shipment conversion is not permitted based on dollar amount or some other custom criteria (e.g. order lines worth &gt;$5 can be shipped).</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>See&nbsp;<a hqid=\"2465753\" href=\"/ui-theming-customization\">here</a>&nbsp;for details on what can be customized in the Digital Self-Service UI.</p>\r\n\r\n<h5><a name=\"using-the-browser-back-button\" id=\"using-the-browser-back-button\"></a>Using the Browser Back Button</h5>\r\n\r\n<p>In addition to the in-app back&nbsp;button, the browser 'Back' button can&nbsp;be used to navigate backwards to edit cancellation selections.&nbsp;If the browser 'Back' button is used on the first screen, then the user is navigated back to the prior webpage (or, if a new browser tab was opened, then no update occurs). If the user clicks 'Back' on the second screen in the flow, the behavior is the same as that of the application back&nbsp;button; the user sees prior selections and can edit selected items and reasons&nbsp;and proceed again. If the user clicks 'Back' on the third (confirmation) screen in the flow, then the user is returned to the first page and the previously selected items will be displayed as ineligible for cancellation.</p>\r\n\r\n<p>The browser 'Reload' or 'Refresh' button behaves the same way as&nbsp;the 'Back' button.&nbsp;</p>\r\n\r\n<ol>\r\n</ol>\r\n\r\n<h4><a name=\"customizing-for-your-brand\" id=\"customizing-for-your-brand\"></a>Customizing for your Brand</h4>\r\n\r\n<p>Digital Self-Service can be customized to reflect the look and feel of an individual brand. See the&nbsp;<a href=\"https://omni.helpdocsonline.com/ui-theming-customization\">UI Theming & Customization Guide</a>&nbsp;for information on how the logo, fonts, colors, and labels can be customized.</p>\r\n\r\n<h3><a name=\"configuration\" id=\"configuration\"></a><a id=\"DSSCancelConfig\" name=\"DSSCancelConfig\"></a>Configuration</h3>\r\n\r\n<p>The following configuration is required. See below for more details.</p>\r\n\r\n<ul>\r\n\t<li>Configure your organization and user to be used for authentication - see the&nbsp;<a hqid=\"2465749\" href=\"/overview-authentication\">Authentication Guide</a>&nbsp;for detailed steps.&nbsp;This only needs to be done once per organization, so no action is required if it's already been done.</li>\r\n\t<li>Enable cancellation confirmation emails if required. See the<a hqid=\"2444800\" href=\"/transactional-emails\">&nbsp;Transactional Emails</a>&nbsp;guide.</li>\r\n\t<li>Customer-facing cancel reasons</li>\r\n\t<li>Cart configuration - see the <a href=\"https://omni.helpdocsonline.com/cart-and-preview-mode\">Cart Configuration Guide</a> for detailed steps. See below for more details on each of these configurations.</li>\r\n</ul>\r\n\r\n<h5><a name=\"cancel-reasons\" id=\"cancel-reasons\"></a><a id=\"DSS_Cancel_Reasons\" name=\"DSS_Cancel_Reasons\"></a>Cancel Reasons</h5>\r\n\r\n<p>Cancel reasons displayed in Digital Self-Service can be unique or&nbsp;shared with those used in the Contact Center. On the reasons UI, enable&nbsp;'Eligible for Self Service' for each reason&nbsp;with reason type 'Cancel' which should be displayed in Digital Self-Service. If eligible for self-service is true or null, then the reason is displayed in Digital Self-Service.</p>\r\n\r\n<h5><a name=\"cart-configuration\" id=\"cart-configuration\"></a>Cart Configuration</h5>\r\n\r\n<p>The Digital Self-Service cancellation UI requires&nbsp;the <a href=\"http://omni.helpdocsonline.com/cart-and-preview-mode\">cart component</a>&nbsp;to be configured. Please find more details in the cart guide.</p>\r\n\r\n<h3><a name=\"implementation-flavors\" id=\"implementation-flavors\"></a>Implementation Flavors</h3>\r\n\r\n<p>Full order cancellation: A hide/remove&nbsp;extension point is available at the order line level. When this extension point is enabled, customers are forced to select the 'Select all items' checkbox and reason code for the cancellation. This reason code will apply to all order lines.</p>\r\n\r\n<p>More information about configuring extension points can be found <a href=\"https://omni.helpdocsonline.com/ui-theming-customization$extension-points\">here</a>.</p>\r\n\r\n<h3><a name=\"feature-scope\" id=\"feature-scope\"></a>Feature Scope</h3>\r\n\r\n<p>The following is not supported:</p>\r\n\r\n<ul>\r\n\t<li>Order unit level cancellations are not possible (for example, canceling 1 of 2 eligible units)</li>\r\n\t<li>A maximum of 10 items are displayed on the DSS page. If more than 10 items exist, then the UI displays \"+X items\" to denote the items which are not displayed.</li>\r\n</ul>\r\n\r\n<h3><a name=\"how-to-test\" id=\"how-to-test\"></a>How to Test</h3>\r\n\r\n<ol>\r\n\t<li>Create an order.</li>\r\n\t<li>Navigate to the cancel URL directly by <a hqid=\"2465749\" href=\"/overview-authentication$Accessing DSS and Authentication\">forming the URL</a> in your browser, or launch the page from an email such as 'Ready for Pickup'.</li>\r\n\t<li>Select desired options and cancel item(s).</li>\r\n\t<li>Confirm cancellation in the order list UI.</li>\r\n</ol>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 17641,
  "scraped_at": "2025-08-09T22:33:45.446033"
}