{
  "success": true,
  "permalink": "capture-rfid-tags",
  "title": "Capture RFID Tags",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158410\" href=\"/store\" class=\"breadcrumb-links\">Store Inventory & Fulfillment</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158852\" href=\"/store-fulfillment\" class=\"breadcrumb-links\">Store Order Fulfillment</a></li><li> <span>››</span>Capture RFID Tags</li></ul>  \t\r\n\t\t<h1>Capture RFID Tags</h1>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/capture-rfid-tags$overview\">Overview</a></li><li><a href=\"/capture-rfid-tags$process\">Process</a><ul><li><a href=\"/capture-rfid-tags$search-options-for-capture-rfid-tags-list\">Search Options for 'Capture RFID Tags' List</a><ul><li><a href=\"/capture-rfid-tags$search-by-picklist-nbsp\">Search By Picklist&nbsp;</a></li><li><a href=\"/capture-rfid-tags$search-by-order-or-fulfillment-ids\">Search By Order or Fulfillment IDs</a></li><li><a href=\"/capture-rfid-tags$search-by-item-nbsp\">Search By Item&nbsp;</a></li></ul></li><li><a href=\"/capture-rfid-tags$capturing-rfid-tags\">Capturing RFID Tags</a></li><li><a href=\"/capture-rfid-tags$updates\">Updates</a></li><li><a href=\"/capture-rfid-tags$exceptions\">Exceptions</a></li></ul></li><li><a href=\"/capture-rfid-tags$services-nbsp\">Services&nbsp;</a></li></ul></div>\r\n\r\n<h4><a name=\"overview\" id=\"overview\"></a>Overview</h4>\r\n\r\n<p>Store associates can fulfill pickup, curbside and same day delivery orders&nbsp;by using handheld RFID readers to read unit-level tags. Capturing&nbsp;unit-level RFID tags ensures every unit's status is maintained and accounted for, thus, improving overall accuracy of inventory.</p>\r\n\r\n<p>The Capture RFID Tags is the process using which the unit-level tags are read and captured for these pickup&nbsp;orders and it comes into effect when the \"Picking - Prepare Pickups\" business flag in the RFID enabled flows of the Store RFID Parameters is enabled.&nbsp;It allows&nbsp;the associate&nbsp;to systematically read the picked units' RFID tags either immediately after submission of picking updates or at a later point in time right through the Confirm Pickup process.</p>\r\n\r\n<div class=\"tip\"><strong>Note:&nbsp;</strong>This process applies only to the RFID flow of pickup, curbside and same day delivery orders. It is not applicable&nbsp;for Ship to Address and Ship to Store orders.</div>\r\n\r\n<div class=\"tip\">To know more on the&nbsp;capture RFID tags activity during offline mode, please refer to the&nbsp;<a hqid=\"3324298\" href=\"/store-inventory-and-fulfillment-offline-support\">Store Offline Support</a>&nbsp;page.</div>\r\n\r\n<p>Refer to the&nbsp;<a hqid=\"2195072\" href=\"/storerfid\">Store RFID guide</a>&nbsp;for additional information on RFID support in stores.</p>\r\n\r\n<h4><a name=\"process\" id=\"process\"></a>Process</h4>\r\n\r\n<p>Associates can capture RFID tags&nbsp;once the picklist is picked. Permissions are required to capture tags. Refer to the <a href=\"https://omni.helpdocsonline.com/store-fulfillment-ui-resources$capturetags\">Store Fulfillment UI resources page</a> for additional details.</p>\r\n\r\n<p>Capturing of RFID tags&nbsp;is initiated from the list of 'ready to capture RFID tags' orders which systemically and automatically ensues immediately after picking. All picked fulfillments belonging to the picked picklist are displayed in the list for facilitating capture of their RFID tags.</p>\r\n\r\n<p>If RFID tags are not captured right away&nbsp;after Picking,&nbsp;the store associates can initiate the process from the 'Ready to capture RFID tags' list, which is accessed using the \"Capture RFID Tags\" Stores menu option. When the process is initiated using this option,&nbsp;one of the following search criteria can be used&nbsp;to lookup order(s) to capture their RFID tags:</p>\r\n\r\n<ul>\r\n\t<li>PicklistId</li>\r\n\t<li>OrderId</li>\r\n\t<li>FulfillmentId</li>\r\n\t<li>ItemId</li>\r\n</ul>\r\n\r\n<p>The 'Ready to capture RFID tags'&nbsp;orders list, which is accessed using the Stores menu option,&nbsp;displays unfulfilled orders whose RFID tags have not yet been captured. The orders are listed in the ascending order of their picked date and time.</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> If searched for, even those orders whose RFID tags have already been captured are displayed. However, RFID tags, once captured and submitted, cannot be edited. Consequently, such orders are displayed in the view only mode.</div>\r\n\r\n<p>Picker's user ID&nbsp;is also available on the list for each order. Every order also has an RFID tags read field which can be utilised to distinguish an order whose RFID tags have already been captured from those whose tags are remaining to be read and submitted.</p>\r\n\r\n<p>Associates can select the desired order from the list and then pull the RFID reader's trigger to capture its RFID tags. The reader attempts to read the RFID tags as long as the trigger is pulled. The associate is provided with the read progress once the trigger is released.&nbsp;The RFID reader's default range for this process&nbsp;is \"short,\" allowing it to focus on the nearest tags with greater accuracy.</p>\r\n\r\n<p>The \"listFulfillmentsForStaging\"&nbsp;API along with the \"isRequestedByEPCCaptureListScreen\" parameter set as true is used to list the orders ready for capturing their respective RFID tags.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Even though capturing RFID tags is an optional process, it is recommended that Store Associates capture RFID tags of as many orders as possible to make the most of the efficiencies which can be realized with the help of RFID capability.</div>\r\n\r\n<h5><a name=\"search-options-for-capture-rfid-tags-list\" id=\"search-options-for-capture-rfid-tags-list\"></a>Search Options for 'Capture RFID Tags' List</h5>\r\n\r\n<p>Search can be performed by&nbsp;entering or scanning the Item ID / Item&nbsp;barcode, OrderId, Fulfillment Id or PicklistId. OrderId is available on the pickup slip, so if the pickup slip is already printed, the associate can&nbsp;enter the&nbsp;OrderId to capture its RFID tags. Picklist ID is available on the Pick List and thus, if it has been printed, its ID can be entered / scanned to look for its orders and capture their RFID tags one order at a time.</p>\r\n\r\n<h6><a name=\"search-by-picklist-nbsp\" id=\"search-by-picklist-nbsp\"></a>Search By Picklist&nbsp;</h6>\r\n\r\n<p>RFID tags can be captured&nbsp;at the picklist&nbsp;level. Once a picklist is selected,&nbsp;associates&nbsp;can capture the RFID tags of the orders associated with it. This is achieved with the&nbsp;List&nbsp;Fulfillments&nbsp;for Staging&nbsp;service,&nbsp;with the \"isRequestedByEPCCaptureListScreen\" parameter set as true, which returns the list of orders on the picklist. Once the&nbsp;list of orders is returned, associates capture the RFID tags one order&nbsp;at a time. The&nbsp;picklist&nbsp;must be picked for it to be eligible for capturing its tags.</p>\r\n\r\n<p>Associates can immediately&nbsp;capture the RFID tags of the picked&nbsp;orders as picking is completed for a picklist, or can choose to do so&nbsp;at a later time.</p>\r\n\r\n<p>Since the RFID tag capture process is optional, associates can choose to capture the tags of&nbsp;a few or all of the orders on the picklist, or can&nbsp;choose not to capture the tags of any orders on the picklist.&nbsp;It is, however,&nbsp;recommended that Store Associates capture RFID tags of as many orders as possible, if not all,&nbsp;to make the most of the efficiencies which can be realized with the help of RFID capability.</p>\r\n\r\n<h6><a name=\"search-by-order-or-fulfillment-ids\" id=\"search-by-order-or-fulfillment-ids\"></a>Search By Order or Fulfillment IDs</h6>\r\n\r\n<p>RFID tags can be captured at the order or&nbsp;fulfillment level. Associates&nbsp;can search for&nbsp;the order or fulfillment from the ready to capture RFID tags list and subsequently capture and submit its tags. This is accomplished with the&nbsp;List&nbsp;Fulfillments&nbsp;for Staging&nbsp;service, with the \"isRequestedByEPCCaptureListScreen\" parameter set as true, which returns the requested order or fulfillment(s).</p>\r\n\r\n<p>Associates can immediately&nbsp;capture an&nbsp;order's RFID tags as&nbsp;soon as its picking is completed, or can choose to do so at a later time.&nbsp;</p>\r\n\r\n<h6><a name=\"search-by-item-nbsp\" id=\"search-by-item-nbsp\"></a>Search By Item&nbsp;</h6>\r\n\r\n<p>RFID tags can be captured at the item level. Associates&nbsp;can search for&nbsp;the orders containing&nbsp;a particular&nbsp;item&nbsp;from the&nbsp;ready to capture&nbsp;RFID tags list and then capture and submit their tags. This is achieved with the&nbsp;List&nbsp;Fulfillments&nbsp;for Staging&nbsp;service, with the \"isRequestedByEPCCaptureListScreen\" parameter set as true, which returns the order(s) containing the item.</p>\r\n\r\n<p>Associates can immediately&nbsp;capture the RFID tags of an&nbsp;order&nbsp;as&nbsp;soon as its picking is completed, or can choose to do so at a later time.</p>\r\n\r\n<h5><a name=\"capturing-rfid-tags\" id=\"capturing-rfid-tags\"></a><a id=\"Submit Staging\" name=\"Submit Staging\"></a>Capturing RFID Tags</h5>\r\n\r\n<p>For both pickup and same-day delivery&nbsp;orders, the associate selects an order from the 'ready to capture RFID tags' list and then captures the selected order's RFID tags&nbsp;using an RFID reader. Once all the tags for the order have been captured, the associate is able to submit them. After submission, the captured tags are persisted and then they cannot be edited. Additionally, after submission, the associate&nbsp;reverts to the list and then selects another order whose tags are required to be captured. Ideally, this process is repeated, by the store associate,&nbsp;until the list is exhausted.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Tags can be submitted only after all the units', belonging to the order, RFID tags have been captured.</div>\r\n\r\n<p>For more details on how the UI behaves, please refer to the following UI help guides:</p>\r\n\r\n<ul>\r\n\t<li><a href=\"https://mastore.helpdocsonline.com/capture-rfid-tags\">Capture RFID Tags&nbsp;through Stores menu item</a></li>\r\n\t<li><a href=\"https://mastore.helpdocsonline.com/pickup_orders$capture-rfid-tags-during-prepare-pickup\">Capture RFID Tags during Prepare Pickups</a></li>\r\n\t<li><a href=\"https://mastore.helpdocsonline.com/pickup_orders$capture-rfid-tags-during-confirm-pickup\">Capture RFID Tags during Confirm Pickups</a></li>\r\n\t<li><a href=\"https://mastore.helpdocsonline.com/pickup_orders$capture-rfid-tags-during-curbside-pickup\">Capture RFID Tags during Curbside Pickups</a></li>\r\n</ul>\r\n\r\n<h5><a name=\"updates\" id=\"updates\"></a>Updates</h5>\r\n\r\n<p>The Fulfillment Bulk Import Service is invoked when the Store Associates submit the captured RFID tags. This service does the following updates.</p>\r\n\r\n<ol>\r\n\t<li>Persist the captured RFID tags to the Fulfillment Line Units of the Fulfillment</li>\r\n\t<li>Move the captured RFID tags to \"Reserved\" status from \"Available\" in the Unit Inventory</li>\r\n</ol>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Any units which are cancelled right through the Confirm (or Curbside) Pickup process or returned to shelf are moved back to \"Available\".</div>\r\n\r\n<h5><a name=\"exceptions\" id=\"exceptions\"></a>Exceptions</h5>\r\n\r\n<p>Store Associates cannot pause the Capture RFID Tags process. The process, once started, should be completed by capturing all the required RFID tags and then submitting them. If the Store Associate tries to migrate away while the process is in progress, an error message is shown which asks them to either complete the process or lose the progress that they have made. If the Store Associate chooses to navigate away, they are required to start the process, for the respective fulfillment, from the very beginning.</p>\r\n\r\n<p>The Store application does not validate the status of the&nbsp;unit (EPC) when the tags are captured. For example, if a tag that is read happens to be in the reserved or departed status, the capture will be performed without showing an error to the store associate and the tag status will be updated accordingly.&nbsp;</p>\r\n\r\n<p>If&nbsp;a unit-level tag is damaged or missing or an RFID reader device is not available, the EPC ID or SGTIN can be scanned, with the help of a barcode scanner / the inbuilt device camera,&nbsp;by the associate if&nbsp;one of these barcodes&nbsp;is printed on the RFID tag.</p>\r\n\r\n<h4><a name=\"services-nbsp\" id=\"services-nbsp\"></a>Services&nbsp;</h4>\r\n\r\n<p>The&nbsp;APIs listed in the following table are referenced in this document.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" height=\"133\" style=\"width: 1214px;\" width=\"635\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\" style=\"width: 266px;\">Service</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 127px;\">Component</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 181px;\">Group</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 591px;\">Service Endpoint</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 263px;\"><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">List Fulfillments for Capture RFID Tags</span></td>\r\n\t\t\t<td style=\"width: 124px;\">Fulfillment</td>\r\n\t\t\t<td style=\"width: 178px;\">fulfillment-list-controller</td>\r\n\t\t\t<td style=\"width: 588px;\"><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">fulfillment/api/fulfillment/fulfillment/</span>listFulfillmentsForStaging</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 263px;\"><font face=\"Open Sans, arial, sans-serif\">Fulfillment Bulk Import</font></td>\r\n\t\t\t<td style=\"width: 124px;\">Fulfillment</td>\r\n\t\t\t<td style=\"width: 178px;\">Fulfillment Services</td>\r\n\t\t\t<td style=\"width: 588px;\"><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">fulfillment/api/fulfillment/fulfillment/</span>bulkImport</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<div>&nbsp;</div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 14421,
  "scraped_at": "2025-08-09T22:35:59.587865"
}