{
  "success": true,
  "permalink": "cashdrawermanagement-process",
  "title": "Cash Drawer Management",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158737\" href=\"/point-of-sale\" class=\"breadcrumb-links\">Point of Sale</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2225114\" href=\"/process-configuration-guides-4\" class=\"breadcrumb-links\">POS Classic Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2672964\" href=\"/pos-order-selling\" class=\"breadcrumb-links\">POS Order Selling</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2672965\" href=\"/special-transactions\" class=\"breadcrumb-links\">Special Transactions</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2165193\" href=\"/cash-drawer-management\" class=\"breadcrumb-links\">Cash Drawer Management</a></li><li> <span>››</span>Cash Drawer Management</li></ul>  \t\r\n\t\t<h2>Cash Drawer Management</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/cashdrawermanagement-process$pay-in\">Pay In</a></li><li><a href=\"/cashdrawermanagement-process$pay-out\">Pay Out</a></li><li><a href=\"/cashdrawermanagement-process$till-loan\">Till Loan</a></li><li><a href=\"/cashdrawermanagement-process$till-pickup\">Till Pickup</a></li><li><a href=\"/cashdrawermanagement-process$till-audit-drawer-count\">Till Audit (Drawer Count)</a></li><li><a href=\"/cashdrawermanagement-process$no-sale\">No Sale</a></li><li><a href=\"/cashdrawermanagement-process$till-pickup-alerts\">Till Pickup Alerts</a></li><li><a href=\"/cashdrawermanagement-process$services\">Services</a></li></ul></div>\r\n\r\n<p>Manhattan Active Omni solution provides the ability to carry on Cash Drawer management operations, which are essential to a store&#39;s daily operations.</p>\r\n\r\n<h4><a name=\"pay-in\" id=\"pay-in\"></a>Pay In</h4>\r\n\r\n<p>Pay In transaction is created to record cash added to the till which does not correspond to a sale. These are the result of revenues being entered into the system for tracking and accountability. Examples of Pay In may be when a customer comes in to pay for an inadvertent bad check. User with requisite permission can execute this transaction.</p>\r\n\r\n<p>Steps involved in Pay In are:</p>\r\n\r\n<ul>\r\n\t<li>A transaction number is generated when Pay In&nbsp;option is selected.&nbsp;&nbsp;</li>\r\n\t<li>User is prompted to enter the Pay In amount, reason&nbsp;and the description. It is imperative that the amount entered is in store&#39;s base currency.</li>\r\n\t<li>User is prompted to scan the cash drawer, if it is initiated from a mobile device. In case of fixed register, this step is not required. In both the cases, system validates if the till is valid and available for the current transaction.</li>\r\n\t<li>When a valid cash drawer is scanned, it gets engaged to the current transaction type and&nbsp;cash drawer is popped out.</li>\r\n\t<li>User inserts the Pay In amount to the drawer. &nbsp;Cash drawer is closed,&nbsp;till update is done and till is disengaged.</li>\r\n\t<li>Upon successful Pay In transaction execution:\r\n\t<ul>\r\n\t\t<li>Till amount is updated positively.</li>\r\n\t\t<li>A receipt is printed.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>Other&nbsp;aspects to Pay In are:</p>\r\n\r\n<ul>\r\n\t<li>In case Pay In is executed erroneously, user has the option to Post Void it. Followed by this, till amount gets reversed.</li>\r\n\t<li>A Post Void Pay In Receipt is printed.</li>\r\n\t<li>POSLog event is created whenever a Pay In transaction is created or Post Voided.</li>\r\n\t<li>Pay In amount gets accounted for during Till Reconciliation.</li>\r\n</ul>\r\n\r\n<p>Reports that get updated due to Pay In are:</p>\r\n\r\n<ul>\r\n\t<li>Store summary report:&nbsp;Miscellaneous&nbsp;section</li>\r\n\t<li>Till Summary: Till cash operations</li>\r\n\t<li>Transaction summary</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note:</strong>&nbsp;During a transaction, when the cash drawer pops out, users are expected to close it to complete the transaction. In case the cash drawer still remains open, the application waits for 5 seconds, and then displays a pop-up message &#39;Close Cash Drawer&#39; for the user to close it manually.</div>\r\n\r\n<h4><a name=\"pay-out\" id=\"pay-out\"></a>Pay Out</h4>\r\n\r\n<p>Pay Out transaction is created to record cash removed from the cash drawer during the shift, that&nbsp;does not correspond to a sale/return. These are the result of expenses being entered into the system for tracking and accountability.&nbsp;Examples of Pay Out, could be tips paid to employees as for SPIFF bonuses,&nbsp;or petty cash used to make purchase of some store supplies.</p>\r\n\r\n<p>Steps involved in Pay Out are:</p>\r\n\r\n<ul>\r\n\t<li>A transaction number is generated when Pay Out option is selected.&nbsp;&nbsp;</li>\r\n\t<li>User is prompted to scan the cash drawer, if it is initiated from a mobile device. In case of fixed register, this step is not required.</li>\r\n\t<li>When&nbsp;a valid cash drawer is scanned, it gets engaged to the current transaction and cash drawer is popped out.</li>\r\n\t<li>User is prompted to enter the Pay Out amount and the comments. User can take a money from till and&nbsp;count before entering the amount.</li>\r\n\t<li>Based on the configuration under Store Configuration&gt;&gt;displayRecEntryforPayout, user is prompted to enter the name of the person receiving the Pay Out.</li>\r\n\t<li>When user enters the amount, system checks if the Total amount entered is greater than the till amount. If so, a validation message is promoted to the user. User can either&nbsp;ensure that the Pay Out amount is equal to or lesser than the till amount or can override on the validation error to proceed.</li>\r\n\t<li>When user enters the amount, system checks if the Total amount entered results in reduced till float amount, but not lesser than the till amount. In this case, user is promoted with the warning message. Based on the confirmation, Pay Out Pick up can be executed successfully.\r\n\t<ul>\r\n\t\t<li>Example: Till Float=100.00, Till Amount=150.00\r\n\t\t<ul>\r\n\t\t\t<li>If the Pay Out amount is between 1.00&nbsp;and 50.00, no error or warning message is prompted.</li>\r\n\t\t\t<li>If the Pay Out amount is between 101.00&nbsp;and 150.00, a warning message is prompted. User can choose to continue or exit.&nbsp; If continues, Pay Out is executed successfully.</li>\r\n\t\t\t<li>If the Pay Out&nbsp;amount is greater than 150.00 an error message is shown, in this case, Pay Out&nbsp;cannot be completed.&nbsp;</li>\r\n\t\t</ul>\r\n\t\t</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<ul>\r\n\t<li>Cash drawer is closed, till update is done and till is disengaged.</li>\r\n\t<li>Upon successful Pay Out transaction execution:\r\n\t<ul>\r\n\t\t<li>Till amount is decremented.</li>\r\n\t\t<li>A receipt is printed.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>Other&nbsp;aspects to Pay Out transaction are:</p>\r\n\r\n<ul>\r\n\t<li>In case Pay Out is executed erroneously, user has the option to Post Void it. Followed by this, till amount gets reversed.</li>\r\n\t<li>A Post Void Pay Out Receipt is printed.</li>\r\n\t<li>POSLog event is created whenever a Pay Out transaction is created or Post Voided.</li>\r\n\t<li>Pay Out amount gets accounted for during Till Reconciliation.</li>\r\n</ul>\r\n\r\n<p>Reports that get updated due to Pay Out are:</p>\r\n\r\n<ul>\r\n\t<li>Store summary report:&nbsp;Miscellaneous&nbsp;section.</li>\r\n\t<li>Till Summary: Till cash operations.</li>\r\n\t<li>Transaction summary</li>\r\n</ul>\r\n\r\n<h4><a name=\"till-loan\" id=\"till-loan\"></a>Till Loan</h4>\r\n\r\n<p>Till Loan is a process where in the cash is added to a Payment Station from store safe amount. This is a permission driven action, which means the user should have the required permission to execute this operation. User can perform a Till Loan when no other transactions are in progress.&nbsp;&nbsp;</p>\r\n\r\n<p>Steps involved in Till Loan are:</p>\r\n\r\n<ul>\r\n\t<li>A transaction number is generated when Till Loan option is selected.&nbsp;&nbsp;</li>\r\n\t<li>The amount being entered can vary based on the configuration under Back Office&gt;&gt;tillConfiguration&gt;&gt;countTillLoanAmt.\r\n\t<ul>\r\n\t\t<li>If it is set to &quot;Total&quot;: user needs to enter the total amount to be loaned to the designated till. It is imperative that the amount entered is in the store&#39;s base currency.</li>\r\n\t\t<li>If it is set&nbsp;to &quot;Denomination&quot;: user is prompted to enter the number of bills and coins of each denomination in the base currency. System recalculates the total amount of loan as the user enters each denomination.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>User needs to select the reason for the Till Loan.</li>\r\n\t<li>When user enters the amount and clicks on process, system checks if the total amount entered is greater than the store amount. If so, a validation message is promoted to the user and Till Loan is not successful. User must ensure that the Till Loan amount is equal to or lesser than the store amount.</li>\r\n\t<li>User is prompted to scan the cash drawer, if it is initiated from a mobile device. In case of fixed register, this step is not required.</li>\r\n\t<li>When a valid cash drawer is scanned, it gets engaged to the current transaction&nbsp;and&nbsp;cash drawer is popped out.</li>\r\n\t<li>User inserts the Loan amount to the drawer. &nbsp;Cash drawer is closed,&nbsp;till update is done and till is disengaged.</li>\r\n\t<li>Upon successful Till Loan execution:\r\n\t<ul>\r\n\t\t<li>Till amount is updated positively.</li>\r\n\t\t<li>Store amount gets decremented by the loan amount.</li>\r\n\t\t<li>A receipt is printed.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>Other&nbsp;aspects to Till Loan</p>\r\n\r\n<ul>\r\n\t<li>In case Till Loan is executed erroneously, user has the option to Post Void it. Followed by this, till amount and store amount get reversed.</li>\r\n\t<li>A Post Void Till Loan Receipt is printed.</li>\r\n\t<li>POSLog event is created whenever a Till Loan transaction is created or Post Voided.</li>\r\n\t<li>Till Loan amount gets accounted for during Till Reconciliation.</li>\r\n</ul>\r\n\r\n<p>Reports that get updated due to Till Loan are:</p>\r\n\r\n<ul>\r\n\t<li>Store summary report:&nbsp;Miscellaneous&nbsp;section.</li>\r\n\t<li>Till Summary: Till cash operations.</li>\r\n\t<li>Transaction summary: Count of Till loan and its % age with respect to total number of transactions&nbsp;</li>\r\n</ul>\r\n\r\n<h4><a name=\"till-pickup\" id=\"till-pickup\"></a>Till Pickup</h4>\r\n\r\n<p>Till Pick Up is performed when removing cash from the drawer during the day when the cash drawer has too much cash or has reached the threshold. Cash, thus picked is deposited to store safe amount. The amount which is picked from the till does not make it to the final reconciliation as it is already made it to the store safe. It is included as part of the store close amount.</p>\r\n\r\n<p>Like another till function, this is a permission driven action, which means the user should have the required permission to execute this operation. User can perform a Till Pick up when no other transactions are in progress.&nbsp;&nbsp;</p>\r\n\r\n<p>Steps involved in Till Pick up are:</p>\r\n\r\n<ul>\r\n\t<li>A transaction number is generated when Till Pick up option is selected.&nbsp;&nbsp;</li>\r\n\t<li>User is prompted to scan the cash drawer, if it is initiated from a mobile device. In case of fixed register, this step is not required.</li>\r\n\t<li>When a valid cash drawer is scanned, it gets engaged to the current transaction and cash drawer is popped out.&nbsp;&nbsp;</li>\r\n\t<li>User can take a money from till and&nbsp;count before entering the amount.</li>\r\n\t<li>User is prompted to enter the amount to be picked. The amount being entered can vary based on the configuration under Back Office&gt;&gt;tillConfiguration&gt;&gt;countTillPickupAmt.\r\n\t<ul>\r\n\t\t<li>If it is set to &quot;Total&quot;: user needs to enter the total amount to be picked. It is imperative that the amount entered is in the store&#39;s base currency.</li>\r\n\t\t<li>If it is set&nbsp;to &quot;Denomination&quot;: user is prompted to enter the number of bills and coins of each denomination in the base currency. System recalculates the total amount as the user enters count for each denomination.</li>\r\n\t\t<li>Alternate currencies can also be picked up, however they can only be set to &quot;Total&quot;</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>When user is done, system checks if the Total amount entered results in reduced till float amount, but not lesser than the till amount. In this case, user is promoted with the warming message. Based on the confirmation, Till Pick up can be executed successfully.\r\n\t<ul>\r\n\t\t<li>Example: Till Float=100.00, Till Amount=1500.00\r\n\t\t<ul>\r\n\t\t\t<li>If the Till Pick up amount is between 1.00&nbsp;and 1400.00, no error or warning message is prompted.</li>\r\n\t\t\t<li>If the Till Pick up amount is between 1401.00&nbsp;and 1500.00, a warning message is prompted. User can choose to continue or exit. If continues, Till Pick up is executed successfully.</li>\r\n\t\t\t<li>If the Till Pick up amount is greater than 1500.00 an error message is shown, in this case, Till Pick up cannot be completed.&nbsp;</li>\r\n\t\t</ul>\r\n\t\t</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Cash drawer is closed, till update is done and till is disengaged.</li>\r\n\t<li>Upon successful Till Pick up execution:\r\n\t<ul>\r\n\t\t<li>Till amount is updated negatively.</li>\r\n\t\t<li>Store amount gets incremented by the picked up amount.</li>\r\n\t\t<li>A receipt is printed.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>Other&nbsp;aspects to Till Loan</p>\r\n\r\n<ul>\r\n\t<li>In case Till Pick up is executed erroneously, user has the option to Post Void it. Followed by this, till amount and store amount get reversed.</li>\r\n\t<li>A Post Void Till Pick up Receipt is printed.</li>\r\n\t<li>POSLog event is created whenever a Till Pick up transaction is created or Post Voided.</li>\r\n</ul>\r\n\r\n<p>Reports that get updated due to Till Pick up are:</p>\r\n\r\n<ul>\r\n\t<li>Store summary report:&nbsp;Miscellaneous&nbsp;section.</li>\r\n\t<li>Till Summary: Till cash operations.</li>\r\n\t<li>Transaction summary: Count of Till loan and its % age with respect to total number of transactions&nbsp;</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"till-audit-drawer-count\" id=\"till-audit-drawer-count\"></a>Till Audit (Drawer Count)</h4>\r\n\r\n<p>Till Audit is performed when manager wishes to count the cash in a given drawer.&nbsp; This action has no effect on reconciliation or close amounts; it is performed strictly for information.</p>\r\n\r\n<p>Like another till function, this is a permission driven action, which means the user should have the required permission to execute this operation from <a href=\"https://omni.helpdocsonline.com/pos-resources$tillauditcartgrant\">Cart </a>or <a href=\"https://omni.helpdocsonline.com/pos-resources$tillauditbogrant\">Home Screen Manager menu</a>. User can perform a Till Audit when no other transactions are in progress.&nbsp;&nbsp;</p>\r\n\r\n<p>Similar to&nbsp;</p>\r\n\r\n<p>Steps involved in Till Audit (Drawer Count)&nbsp;are:</p>\r\n\r\n<ul>\r\n\t<li>A transaction number is generated when Till Audit option is selected.&nbsp;&nbsp;</li>\r\n\t<li>User is prompted to scan the cash drawer, if it is initiated from a mobile device.&nbsp; (In case of fixed register, this step is not required.)</li>\r\n\t<li>When a valid cash drawer is scanned, it gets engaged to the current transaction and cash drawer is popped out.&nbsp;&nbsp;</li>\r\n\t<li>User can access the money in the till for counting purposes, before entering the amount.</li>\r\n\t<li>User is prompted to enter the amount to be picked. The process to enter the amount&nbsp;can vary based on the configuration under Back Office&gt;&gt;tillConfiguration&gt;&gt;countTillAuditAmt.\r\n\t<ul>\r\n\t\t<li>These settings are only relevant to the stores base local currency\r\n\t\t<ul>\r\n\t\t\t<li>If configured for acceptance&nbsp;at this location,&nbsp; foreign currencies can also be counted;&nbsp;however foreign currency (non local default currency)&nbsp;amounts can&nbsp;only be entered via &quot;Total&quot;.</li>\r\n\t\t</ul>\r\n\t\t</li>\r\n\t\t<li>For local currency -\r\n\t\t<ul>\r\n\t\t\t<li>If countTillAuditAmnt&nbsp;is set to &quot;Total&quot;: user needs to enter the total amount to be picked.</li>\r\n\t\t\t<li>If it is set&nbsp;to &quot;Detail&quot;: user is prompted to enter the number of bills and coins of each denomination in the base currency.\r\n\t\t\t<ul>\r\n\t\t\t\t<li>System recalculates the total amount as the user enters count for each denomination.</li>\r\n\t\t\t</ul>\r\n\t\t\t</li>\r\n\t\t</ul>\r\n\t\t</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>When user is done, system checks if the amount entered matches the system value for the amount in the till for that currency (local or alternate). If not, user is shown a variance message and must enter explanation.</li>\r\n\t<li>Cash drawer is closed, till audit is recorded in Backoffice and in the Electronic Journal, and till is disengaged.</li>\r\n\t<li>There is no effect on the Till Amount value in the database.</li>\r\n\t<li>A receipt is printed.</li>\r\n</ul>\r\n\r\n<p>Other&nbsp;aspects to Till Audit</p>\r\n\r\n<ul>\r\n\t<li>Till Audits can&#39;t be PostVoided.</li>\r\n</ul>\r\n\r\n<ul>\r\n\t<li>Till Audits are not reflected on any Reports at this time.</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"no-sale\" id=\"no-sale\"></a>No Sale</h4>\r\n\r\n<p><span style=\"color: rgb(51, 51, 51); font-family: -apple-system, BlinkMacSystemFont, &quot;Segoe UI&quot;, Roboto, &quot;Noto Sans&quot;, Ubuntu, &quot;Droid Sans&quot;, &quot;Helvetica Neue&quot;, sans-serif;\"><span style=\"font-family:arial,helvetica,sans-serif;\">No Sale transaction occurs in case the cash drawer needs to be opened for revenue-neutral reason like audit the drawer itself, or make change etc.&nbsp;</span> </span></p>\r\n\r\n<p>Steps involved in No Sale are:</p>\r\n\r\n<ul>\r\n\t<li>A transaction number is generated when No Sale option is selected.&nbsp;&nbsp;</li>\r\n\t<li>User is prompted to scan the cash drawer, if it is initiated from a mobile device. In case of fixed register, this step is not required.</li>\r\n\t<li>User selects the reason for No Sale transaction.</li>\r\n\t<li>Once done, cash drawer is closed.</li>\r\n</ul>\r\n\r\n<h4><a name=\"till-pickup-alerts\" id=\"till-pickup-alerts\"></a>Till Pickup Alerts</h4>\r\n\r\n<p><span style=\"font-family:arial,helvetica,sans-serif;\"><span style=\"color: rgb(51, 51, 51);\">Till Pickup alerts are systemically generated notifications and indicates that the till has reached certain amount in cash and is due to be picked up and money is deposited to store amount. This is driven off the configurations specified under Back Office&gt;&gt;tillPickupConfiguration. The threshold can be set up for each currency. An alert gets generated if any of the till reaches the threshold for any of the currencies, during the day. These alerts are displayed on the UI application with the till ID that have reached the threshold. Followed by this, if till is picked up, system evaluates the amount in the till, based on which the alert is either removed or retained.</span></span></p>\r\n\r\n<p><span style=\"font-family:arial,helvetica,sans-serif;\"><span style=\"color: rgb(51, 51, 51);\">Example: Threshold to generate alert once it reach 1500.00 or more. Current Amount in the till is 1800.00.&nbsp; If user picks amount greater than 300.00, the alert is removed.</span></span></p>\r\n\r\n<div class=\"info\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px;\">Note: Till Pick up alerts are not generated if the threshold is not configured or already an alert exists for that till.</div>\r\n\r\n<h4 style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; padding: 0px;\"><a name=\"services\" id=\"services\"></a>Services</h4>\r\n\r\n<p>The following APIs are the key APIs related to Manager Till Functions.&nbsp;Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 1213px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 259px;\">Service</th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 118px;\">Component</th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 300px;\">Group</th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 520px;\">Service Endpoint</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 256px;\">Transaction number generation</td>\r\n\t\t\t<td style=\"margin: 0px; width: 116px;\">Backoffice</td>\r\n\t\t\t<td style=\"margin: 0px; width: 297px;\">&nbsp;</td>\r\n\t\t\t<td style=\"margin: 0px; width: 517px;\">/backoffice/backOfficeTransaction/generateOpenTransaction/transactionType/ /{till state}?registerId={RegisterId}&locationId={StoreNumber}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 256px;\">Engage Till</td>\r\n\t\t\t<td style=\"margin: 0px; width: 116px;\"><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">Backoffice</span></td>\r\n\t\t\t<td style=\"margin: 0px; width: 297px;\">&nbsp;</td>\r\n\t\t\t<td style=\"margin: 0px; width: 517px;\">/backoffice/till/engage</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 256px;\">Update and Disenage Till</td>\r\n\t\t\t<td style=\"margin: 0px; width: 116px;\">Backoffice</td>\r\n\t\t\t<td style=\"margin: 0px; width: 297px;\">&nbsp;</td>\r\n\t\t\t<td style=\"margin: 0px; width: 517px;\">/posservice/payment/updateTillAndDisengageCashDrawer&nbsp;</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 21783,
  "scraped_at": "2025-08-09T22:35:42.159547"
}