{
  "success": true,
  "permalink": "ce-ban-customer",
  "title": "Ban Customer",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158742\" href=\"/customer-engagement-3\" class=\"breadcrumb-links\">Customer Engagement</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158395\" href=\"/process-configuration-guides-2\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2812052\" href=\"/ce-case-management\" class=\"breadcrumb-links\">Case Management</a></li><li> <span>››</span>Ban Customer</li></ul>  \t\r\n\t\t<h2>Ban Customer</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/ce-ban-customer$overview\">Overview</a></li><li><a href=\"/ce-ban-customer$banning-a-customer-from-the-agent-inbox\">Banning a Customer from the Agent Inbox</a></li><li><a href=\"/ce-ban-customer$unbanning-a-customer-from-the-customer-dashboard\">Unbanning a Customer from the Customer Dashboard</a><ul><li><a href=\"/ce-ban-customer$identifying-a-banned-customer\">Identifying a Banned Customer</a></li></ul></li><li><a href=\"/ce-ban-customer$banned-customer-dashboard-nbsp\">Banned Customer Dashboard&nbsp;</a><ul><li><a href=\"/ce-ban-customer$filters\">Filters</a></li><li><a href=\"/ce-ban-customer$columns\">Columns</a></li><li><a href=\"/ce-ban-customer$ban-unban-actions-nbsp\">Ban & Unban Actions&nbsp;</a></li></ul></li><li><a href=\"/ce-ban-customer$configurations-nbsp\">Configurations&nbsp;</a><ul><li><a href=\"/ce-ban-customer$ban-unban-reasons\">Ban & Unban Reasons</a></li></ul></li><li><a href=\"/ce-ban-customer$system-responses-to-banned-customers\">System Responses to Banned Customers</a><ul><li><a href=\"/ce-ban-customer$banned-customer-message-for-sms-and-live-chat\">Banned Customer Message for SMS and Live Chat</a></li><li><a href=\"/ce-ban-customer$banned-customer-email\">Banned Customer Email</a></li></ul></li></ul></div>\r\n\r\n<h3><a name=\"overview\" id=\"overview\"></a><a id=\"overview\" name=\"overview\"></a>Overview</h3>\r\n\r\n<p data-renderer-start-pos=\"15\">Agents may want to ban customers for many reasons, such as the customer is extremely rude, uses foul language or is a bot. Banning a customer will be an activity that occurs within the Agent Inbox. When a problematic customer reaches out and is communicating with the agent via the Agent Inbox, the agent may choose to ban him or her.</p>\r\n\r\n<p data-renderer-start-pos=\"351\">A customer ban applies only to interacting with agents via the Agent Inbox. A customer who is banned from communicating via the Agent Inbox may still order and return items. They may also communicate via phone or another method that does not involve an interaction channel that is routed to the Agent Inbox. All communication via the Agent Inbox is prohibited until the ban is lifted.</p>\r\n\r\n<p data-renderer-start-pos=\"655\">The ban may be lifted from the customer’s Customer Dashboard or from the Banned Customer Dashboard.&nbsp;</p>\r\n\r\n<p data-renderer-start-pos=\"655\">&nbsp;</p>\r\n\r\n<h3><a name=\"banning-a-customer-from-the-agent-inbox\" id=\"banning-a-customer-from-the-agent-inbox\"></a><a id=\"Interaction Creation\" name=\"Interaction Creation\"></a>Banning a Customer from the Agent Inbox</h3>\r\n\r\n<p>Customers can only be banned from the Agent Inbox, since the ban applies only to Agent Inbox interactions. Customers can be banned from either the Active or Done tab. However, it's expected that the majority of bans will occur from the Active tab as an immediate response to customer harassment or bot activity.&nbsp;</p>\r\n\r\n<p>The majority of bans occur directly from the active tab. The agent experienced an unpleasant interaction with a customer and took action to remedy the situation.&nbsp;</p>\r\n\r\n<p>To ban a customer, the agent will take the following steps:&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>Select the Interaction.&nbsp;</li>\r\n\t<li>In the customer blue banner, select the raindrop menu. Choose the Ban Customer action.&nbsp;</li>\r\n\t<li>Provide a reason for the ban. If applicable, provide notes.&nbsp;</li>\r\n\t<li>If the customer is anonymous, the agent can also choose to ban the IP address associated with the customer. This is reserved for anonymous customers only, since the goal is to reduce bot farm activity.&nbsp;</li>\r\n\t<li>From the Active tab, the system will immediately remove the interaction from the inbox; it will close the interaction and the corresponding case. The content of the interaction, such as the email or the live chat, is available as a transcript of the customer's behavior. For the Done tab, the system will simply set the customer to banned, as the corresponding interaction and case are closed.&nbsp;</li>\r\n\t<li>The system will communicate to the customer that they are no longer able to communicate with an agent (<a href=\"/ce-ban-customer$customermessage\">see Customer Message, below</a>). If the customer is utilizing Live Chat, they will not be able to fill out the satisfaction service.&nbsp;</li>\r\n</ol>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3 data-renderer-start-pos=\"342\" id=\"Display-category-and-subcategory-on-the-interaction-wrap-up-panel\"><a name=\"unbanning-a-customer-from-the-customer-dashboard\" id=\"unbanning-a-customer-from-the-customer-dashboard\"></a><a id=\"unban-customer-dashboard\" name=\"unban-customer-dashboard\"></a>Unbanning a Customer from the Customer Dashboard</h3>\r\n\r\n<p>Agents can unban customers from the Customer Dashboard. Registered customers and unregistered customers with at least one order or return will have a Customer Dashboard and can be unbanned.&nbsp;</p>\r\n\r\n<p>To unban a customer, the agent will take the following steps:&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>Select the raindrop menu to the right of the customer's name.&nbsp;</li>\r\n\t<li>Choose the Unban Customer Action.&nbsp;</li>\r\n\t<li>Provide a reason for the ban. If applicable, provide notes.&nbsp;</li>\r\n\t<li>The customer will be unbanned and able to communicate with agents via the Agent Inbox.&nbsp;</li>\r\n</ol>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"identifying-a-banned-customer\" id=\"identifying-a-banned-customer\"></a>Identifying a Banned Customer</h4>\r\n\r\n<p>On the Customer Dashboard, a banned customer is identified with the following visual indicators in the upper-left section: the user icon next to their name includes a crossed-out line and the word <em>Banned</em> is under their name. If a customer is both deactivated and banned, the system will display the visual indicators for a deactivated customer. Since the ban is only pertinent to access to customer service via the Agent Inbox, the visual cues are carried to other screens that include the customer's name in the upper-left section.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3><a name=\"banned-customer-dashboard-nbsp\" id=\"banned-customer-dashboard-nbsp\"></a><a id=\"banned-dashboard\" name=\"banned-dashboard\"></a>Banned Customer Dashboard&nbsp;</h3>\r\n\r\n<p>This dashboard provides managers with access to all customers who were banned or unbanned within the last 12 months; it does not include customers who have not been banned previously. Managers can use the dashboard to unban and ban customers, as well as look for factors for a ban, such as a specific agent, a particular reason, or a type of customer (registered vs. unregistered).&nbsp;The Banned Customer Dashboard is accessible from the following location: Manager Dashboard, raindrop menu next to the manager's name.&nbsp;</p>\r\n\r\n<h4><a name=\"filters\" id=\"filters\"></a>Filters</h4>\r\n\r\n<p>The ban customer provides the following filters; all columns are free-form, unless noted:&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>Customer First Name</li>\r\n\t<li>Customer Last Name</li>\r\n\t<li>Email</li>\r\n\t<li>Phone</li>\r\n\t<li>Ban Reason Drop-down - Provides all the ban reasons</li>\r\n\t<li>Unban Reason Drop-down - Provides all the unban reasons</li>\r\n\t<li>Agent First Name</li>\r\n\t<li>Agent Last Name</li>\r\n\t<li>Status Drop-down&nbsp;- banned or unbanned</li>\r\n</ul>\r\n\r\n<h4><a name=\"columns\" id=\"columns\"></a>Columns</h4>\r\n\r\n<ul>\r\n\t<li>Customer ID - This field is populated for registered users. It provides a hyperlink to the customer's Customer Dashboard. Managers can utilize this to learn more about the customer's spending habits and other metrics while evaluating their status.&nbsp;</li>\r\n\t<li>Customer First Name - For registered&nbsp;customers, this is the customer's first name. For all other customers, this is the first name the customer provided to access Live Chat.&nbsp;</li>\r\n\t<li>Customer Last Name&nbsp;- For registered customers, this is the customer's last&nbsp;name. For all other customers, this is the last name the customer provided to access Live Chat.&nbsp;</li>\r\n\t<li>Email - If the customer reached out via email, this is the email address they utilized. Otherwise, this is their registered customer email address or the address they provided to access Live Chat.</li>\r\n\t<li>Phone - If the customer reached out via sms, this is their phone number. Otherwise, this is their registered customer phone number.&nbsp;</li>\r\n\t<li>IP Address - If the customer was anonymous and the agent performed an IP address level ban, this is the customer's IP address.&nbsp;</li>\r\n\t<li>Status - Banned or Unbanned</li>\r\n\t<li>Reason - The reason is associated with the customer's status. If the status =&nbsp;Banned, this is the reason for the ban. If the status = Unbanned, this is the reason for the unban action.</li>\r\n\t<li>Case ID - The Case ID associated with the ban. When the agent banned the customer, the system closed the case and saved all correspondence between the agent and customer on the case. The manager can select the case hyperlink and review the contents while evaluating the ban.</li>\r\n\t<li>Agent - The agent's name who banned the customer.&nbsp;</li>\r\n\t<li>Date Banned - The date and time of the customer's initial ban. Most customers will only be banned one time, at most. In the event that the customer is banned multiple times, this column provides the date and time of the first ban. The time is presented in military time with the Agent's time zone indicated.&nbsp;</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"ban-unban-actions-nbsp\" id=\"ban-unban-actions-nbsp\"></a>Ban & Unban Actions&nbsp;</h4>\r\n\r\n<p>These actions are enabled based on the status of the customer. The manager must choose a record for one of the actions to be enabled. If the customer is currently banned, the Unban action is enabled; if the customer is currently unbanned, the Ban action is enabled.&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>Ban - If the manager chooses to ban a customer, they will need to provide a reason; these are the same reasons available when banning a customer from the Agent Inbox. Once banned, the customer may no longer communicate with agents via the Agent Inbox.</li>\r\n\t<li>Unban - If the manager chooses to unban a customer, they will need to provide a reason; these are the same reasons available when unbanning a customer from the Customer Dashboard. Once the ban is lifted, the customer may immediately communicate with agents via the Agent Inbox.&nbsp;</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3><a name=\"configurations-nbsp\" id=\"configurations-nbsp\"></a><a id=\"config\" name=\"config\"></a>Configurations&nbsp;</h3>\r\n\r\n<p>The ability to ban and&nbsp;unban customers is grant controlled. Access to the Banned Customers Dashboard is also grant controlled.&nbsp;Please see the <a hqid=\"2871113\" href=\"/customer-engagement-ui-resources\">UI Resources</a> page for grant information.&nbsp;</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: This functionality includes seed data for Ban Customer reasons. To include this seed data, copy the following from the base profile to your profile: int::intConfig.&nbsp;</div>\r\n\r\n<h4><a name=\"ban-unban-reasons\" id=\"ban-unban-reasons\"></a>Ban & Unban Reasons</h4>\r\n\r\n<p>When a customer is banned or unbanned, the user needs to provide a reason for their status change. This can later be used when researching the event or for reporting. Banned and unbanned reasons are defined on the Ban Customer Reason configuration in MUP UI.</p>\r\n\r\n<p><strong>For ban&nbsp;reasons,</strong> the following seed data is provided: BOT, Profanity & Belligerence. If a retailer requires additional ban reasons, they can define them on the Ban Customer Reason Configuration. For new ban&nbsp;reasons, you must select the Is Ban checkbox to define it as a ban reason.&nbsp;</p>\r\n\r\n<p><strong>For unban&nbsp;reasons</strong>, the following seed data is provided: Misunderstanding, Customer Loyalty. The retailer can define additional unban reasons, if they are required for the organization. New unban reasons are defined on the Ban Customer Reason Configuration. For new unban reasons, do<strong> not </strong>select the Is Ban checkbox.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3><a name=\"system-responses-to-banned-customers\" id=\"system-responses-to-banned-customers\"></a>System Responses to Banned Customers</h3>\r\n\r\n<p>When a customer is banned, the system will send an initial communication to them at the time of the ban, informing them of their current status. Each time they reach out, the system will share the same banned message with the customer.&nbsp;</p>\r\n\r\n<h4 data-renderer-start-pos=\"1482\"><a name=\"banned-customer-message-for-sms-and-live-chat\" id=\"banned-customer-message-for-sms-and-live-chat\"></a><a id=\"customermessage\" name=\"customermessage\"></a>Banned Customer Message for SMS and Live Chat</h4>\r\n\r\n<p data-renderer-start-pos=\"1482\">When the customer is banned and they reach out at a later date, the system will display the following message:</p>\r\n\r\n<p data-renderer-start-pos=\"1482\"><samp>\"Due to violations of our customer service policies, you are no longer able to contact our support team. If you this is an error, please reach out using another communication method\".</samp></p>\r\n\r\n<p data-renderer-start-pos=\"1482\">This default message is stored in KV Store and can be modified to provide an alternate contact number and other information. KV Store location:&nbsp;/localization/com-manh-cp-customerinteraction/labels/. Key:&nbsp;bannedCustomerMessage</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"banned-customer-email\" id=\"banned-customer-email\"></a>Banned Customer Email</h4>\r\n\r\n<p>When a customer is banned via email, the system will send them the following email response:&nbsp;</p>\r\n\r\n<p><samp><strong>Hi {customer name}</strong></samp></p>\r\n\r\n<p><samp>Our customer service center is no longer available to you. You were banned from service due to a recent interaction with an agent.</samp></p>\r\n\r\n<p><samp>If you feel this is an error, please reach out using another communication method.</samp></p>\r\n\r\n<p><samp>Thank You,<br>\r\nManhattan Outfitters</samp></p>\r\n\r\n<p>This is a default message and may be modified by the retailer. It is stored in the Email Template Configuration:&nbsp;see&nbsp;BannedCustomerNotificationEmail.</p>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 15094,
  "scraped_at": "2025-08-09T22:35:03.204613"
}