{
  "id": "2911288",
  "permalink": "ce-interaction-wrapup",
  "title": "Interaction Wrap up ",
  "type": "topic",
  "level": 4,
  "path": "Manhattan Active® Omni/Customer Engagement/Process & Configuration Guides/Interactions/Interaction Wrap up ",
  "raw_item": {
    "id": "2911288",
    "text": "Interaction Wrap up ",
    "title": "Interaction Wrap up ",
    "permalink": "ce-interaction-wrapup",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "t;2812056",
    "parent": "2812056",
    "created_date": "1640753377",
    "modified_date": "1750680299",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "3"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158742\" href=\"/customer-engagement-3\" class=\"breadcrumb-links\">Customer Engagement</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158395\" href=\"/process-configuration-guides-2\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2812056\" href=\"/ce-interactions\" class=\"breadcrumb-links\">Interactions</a></li><li> <span>››</span>Interaction Wrap up </li></ul>  \t\r\n\t\t<h2>Interaction Wrap up</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/ce-interaction-wrapup$overview\">Overview</a><ul><li><a href=\"/ce-interaction-wrapup$interaction-wrap-up-icon\">Interaction Wrap Up Icon</a></li></ul></li><li><a href=\"/ce-interaction-wrapup$interaction-creation\">Interaction Creation</a></li><li><a href=\"/ce-interaction-wrapup$auto-populate-order-id-in-interaction-wrap-up-for-order-creation-edits\">Auto-populate Order ID in Interaction Wrap-Up for Order Creation/Edits</a></li><li><a href=\"/ce-interaction-wrapup$view-interaction-nbsp-details\">View Interaction&nbsp;Details</a></li><li><a href=\"/ce-interaction-wrapup$edit-update-interactions\">Edit/Update Interactions</a></li><li><a href=\"/ce-interaction-wrapup$external-interaction-system-integration-nbsp\">External Interaction System Integration&nbsp;</a></li><li><a href=\"/ce-interaction-wrapup$high-level-flow-for-external-interaction-system\">High Level Flow for External Interaction System</a></li><li><a href=\"/ce-interaction-wrapup$configuration-nbsp\">Configuration&nbsp;</a></li><li><a href=\"/ce-interaction-wrapup$services\">Services</a></li><li><a href=\"/ce-interaction-wrapup$related-articles\">Related Articles</a></li></ul></div>\r\n\r\n<h3><a name=\"overview\" id=\"overview\"></a><a id=\"overview\" name=\"overview\"></a>Overview</h3>\r\n\r\n<p>Interactions are&nbsp;attached to a case so that the Contact center agents can have a record of every interaction the customer has had regarding a case and to understand the reason for creating the case as well as track the progress of the case.</p>\r\n\r\n<p>The contact center agent&nbsp;can use the interaction wrap-up panel to wrap up any interaction that the contact center agent has had with the customer. Performing&nbsp;an Interaction&nbsp;wrap-up creates a record of the&nbsp;interaction&nbsp;with the customer&nbsp;and&nbsp;a case is automatically&nbsp;created when the interaction wrap-up is submitted. One of the many&nbsp;benefits of having all of these&nbsp;interaction details attached to a case is that at any given point, an old or new contact center agent looking into a case can understand the previous conversation the customer has had regarding the case and the contact center agent can proactively handle the case without having to reach back to the customer to repeatedly inquire the issue the customer has been facing.&nbsp;</p>\r\n\r\n<p>A contact center agent can create a case based on&nbsp;interaction with the customer over one of the many interaction channels like Phone, E-mail, Chat, and Social. For example, if a&nbsp;contact center agent has a phone call with the customer regarding an issue&nbsp;the customer was facing, after the phone call, the contact center agent can log in the basic details of the call&nbsp;and decide to wrap up the interaction in the application. This will create a case&nbsp;and will have the phone interaction details attached to it automatically when the case is viewed later.</p>\r\n\r\n<p>Another example could be that the contact center agent is having a live chat session with the customer on an external system and has resolved an issue for the customer via the chat session itself. The contact center agent can&nbsp;use the interaction wrap-up panel to wrap up and create a case for the customer associated&nbsp;with the chat interaction to have a record of what the issue was and how the contact center agent was able to solve it.&nbsp;</p>\r\n\r\n<h4><a name=\"interaction-wrap-up-icon\" id=\"interaction-wrap-up-icon\"></a><a id=\"wrapup_icon\" name=\"wrapup_icon\"></a>Interaction Wrap Up Icon</h4>\r\n\r\n<p>The Interaction Wrap Up Icon is displayed on all customer engagement screens as an icon, with the exception of the Agent Inbox; on the Agent Inbox, it is a button available for live interactions only. The Interaction wrap up icon may be left in its original location or be docked to the far-left bottom of the screen. Agents can select the docked icon to access the Wrap Up popup and provide information.&nbsp;</p>\r\n\r\n<div class=\"tip\" style=\"text-align: justify;\"><strong>Note</strong>:&nbsp;Wrap Up from any screen other than the Agent Inbox creates a brand-new case. Since the Chat Conversation field cannot be null for creating a case, the system will create it by populating the Chat Conversation field to blank (\" \")</div>\r\n\r\n<h3><a name=\"interaction-creation\" id=\"interaction-creation\"></a><a id=\"interaction_creation\" name=\"interaction_creation\"></a>Interaction Creation</h3>\r\n\r\n<p>The base interaction wrap-up has the following input fields:&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>Interaction Type:&nbsp;These are the different types of interactions that can be wrapped up in the interaction wrap up panel. The number of interactions, defaulted interaction type, and sequence in which the drop-down list has to appear in the wrap up panel can all be configured in the&nbsp;'Interaction types' section&nbsp;of&nbsp;<a href=\"https://omni.helpdocsonline.com/customer_engagement_configurations$interaction-type-configuration\">Customer Engagement Confi</a>g. For interactions received in the Customer Engagement Agent Inbox, this value is hardcoded.</li>\r\n\t<li>Order No:&nbsp;The contact center agent can link the case to an&nbsp;order number, if available. If the order mentioned in this field is a valid order in the system, opening the case after creation will show the order number hyperlinked in the case details section and the order status. Clicking on the order number hyperlink will take you to the order status page.&nbsp;</li>\r\n\t<li><a href=\"/ce-interaction-wrapup$category in interaction wrap up\">Case Category and Subcategory:&nbsp;</a>Contact center users can&nbsp;capture the case category&nbsp;name and subcategory name on the interaction wrap up panel for every interaction so that they can quickly capture details of where agents are spending their time.&nbsp;</li>\r\n\t<li>Description: This is a section to provide a brief description of the interaction. When you wrap up a phone interaction, the interaction description will&nbsp;be saved as entered in the description box of the interaction wrap up panel. For email and chat interaction, the&nbsp;subject is mapped to the description.&nbsp;</li>\r\n\t<li>Resolution Name: The resolution reason for solving a case.&nbsp;</li>\r\n\t<li>Case Status: The default value is closed. This&nbsp;means the case will be closed when the interaction is closed. The agent may change the status to another value, such as open, in progress or waiting. If the agent chooses any status but Closed, the interaction is closed, but the case remains in the status that the agent selected; when another interaction is received for the same customer, the system will associate it with the case (not in Closed status). For example, if the agent sets the Case Status to 'Waiting', and chooses the Submit button on the Wrap Up, the interaction is closed. The Case Status is set to 'Waiting'. When a new interaction arrives in the Agent Inbox, the system will associate it with the case. This allows the organization to more easily manage customer issues that span multiple conversations, such as the customer sending pictures of a damaged product or providing warranty information.&nbsp;&nbsp;</li>\r\n</ol>\r\n\r\n<div class=\"warning\">The only required field on the Interaction Wrap up is the Interaction Type. If an organization has defined required fields for cases based on status, those values are not required if the case is closed from the Interaction Wrapup.</div>\r\n\r\n<p>The contact center agent can enter the above details and click&nbsp;submit to save the interaction while working on various screens within Customer Engagement. The advantage of this is that when the contact center agent does the wrap up from the customer dashboard screen, the customer details automatically get attached to the case.&nbsp;There might also be scenarios when the customer with whom the contact center agent is having a conversation is not in our system. In such cases, the contact center agent can wrap up the interaction from a more generic screen like the contact center agent dashboard or the Cases screen, in which the case will be created with all the interaction details entered, but no customer attached to it. The contact center agent can later create a customer and manually attach it to this particular case.</p>\r\n\r\n<ol start=\"7\">\r\n\t<li>More:&nbsp;The interaction wrap up also has a MORE button at the bottom of the screen. Clicking on this button will take the user to a screen which can be used to add or view additional details of the case.</li>\r\n\t<li>Submit:&nbsp;The user should click the button to wrap up the interaction. Clicking on this button internally calls the Interaction wrapup API, which creates a case first and then an interaction, and then manages to attach the case ID of the created case to the interaction. This enables the user to see the interaction attached to the case when the user views a case that was created as part of the interaction wrap up process.</li>\r\n</ol>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Currently, we don't have a way to create a customer manually (other than through the place order flow).&nbsp;</div>\r\n\r\n<h3 data-renderer-start-pos=\"342\" id=\"Display-category-and-subcategory-on-the-interaction-wrap-up-panel\"><a name=\"auto-populate-order-id-in-interaction-wrap-up-for-order-creation-edits\" id=\"auto-populate-order-id-in-interaction-wrap-up-for-order-creation-edits\"></a>Auto-populate Order ID in Interaction Wrap-Up for Order Creation/Edits</h3>\r\n\r\n<p data-renderer-start-pos=\"1482\">Contact center agents can capture the order number as part of the interaction wrap up process. In order to avoid manual errors while entering order IDs or having the agent copy and paste the order ID into the interaction wrap up panel there by increasing the number of clicks for capturing an interaction, the customer engagement application automatically populates order ID into the interaction wrap up panel when the agent views, edits or creates an order.</p>\r\n\r\n<p data-renderer-start-pos=\"1942\">Every time the agent creates, edits or views an order, the order ID gets auto-populated in the order number column within the interaction wrap up panel.</p>\r\n\r\n<p data-renderer-start-pos=\"2096\">The interaction wrap up panel is currently not visible while creating a new order. In such cases the agent will see the new created order id populated in the interaction wrap up panel when they land back on the customers' dashboard as soon as they place the order .</p>\r\n\r\n<div class=\"tip\" data-renderer-start-pos=\"2096\">\r\n<p><strong>Note:</strong></p>\r\n\r\n<ol>\r\n\t<li>If the user manually enters an order Id&nbsp;and proceeds to view, edit or create a different order without submitting the interaction wrap up, the initial order Id that was populated will be overridden with the new order that the agent is currently working on.</li>\r\n\t<li>If the agent captures the order Id&nbsp;for a customer and then changes to another customer using the customer search option by clicking on “More” in the interaction wrap up panel, it will automatically clear the order number captured for the first customer.</li>\r\n\t<li>If an order ID is auto-populated in the interaction wrap up panel and the agent moves to a generic page like the home page or another customers' dashboard, it will automatically clear the order number captured initially when you move out of the current customer context. i.e, when an order Id&nbsp;is populated, it will get automatically cleared out if you land on a different customers&nbsp;dashboard or the customer details are cleared from the ‘more’ section manually or automatically by landing on a generic page.</li>\r\n\t<li>Auto population of order number in the text message flow is not supported currently.&nbsp;</li>\r\n\t<li>Auto population of order number when agents are working with archived is not supported currently.</li>\r\n</ol>\r\n</div>\r\n\r\n<p data-renderer-start-pos=\"2365\">&nbsp;</p>\r\n\r\n<h3><a name=\"view-interaction-nbsp-details\" id=\"view-interaction-nbsp-details\"></a><a id=\"View Interaction Details\" name=\"View Interaction Details\"></a>View Interaction&nbsp;Details</h3>\r\n\r\n<p>Interactions wrapped up&nbsp;by a contact center agent on the UI&nbsp;or created using the backend API are displayed on the Case timeline section of the case. The contact center agent can get into the case management&nbsp;screen from the left navigation panel on the contact center agent dashboard and select a case, and then click on the 'view case details' option to view the case.&nbsp;If the case has any interaction associated with it,&nbsp;the contact center agent will be able to see the interaction in the case timeline section of the case.&nbsp;</p>\r\n\r\n<p>Also, if&nbsp;the user is aware of&nbsp;the customer for which the interaction was created, then all the interactions associated to the particular customer&nbsp;can be found on the Interaction panel available on the right end of the customer's dashboard.</p>\r\n\r\n<p>Subsequently, if the interaction wrap up was done with \"follow up = true\" then as mentioned earlier, the case will be created in an open status with the interaction associated with it. The&nbsp;list of open cases can be seen on the notifications tab of&nbsp;the customer dashboard.&nbsp;</p>\r\n\r\n<div class=\"info\">Tip: Interaction content may be imported&nbsp;as a JSON with HTML tags to display hyperlinks and text formatting. For example, hyperlinks in an email body may be clickable if using the &lt;a href=&gt;&lt;/a&gt; tags. Hyperlinks can also be pasted into the email body while composing an email. Clicking the hyperlink opens the link in a new browser tab.</div>\r\n\r\n<h3><a name=\"edit-update-interactions\" id=\"edit-update-interactions\"></a><a id=\"Edit-update Interactions\" name=\"Edit-update Interactions\"></a>Edit/Update Interactions</h3>\r\n\r\n<p>The interaction can be updated with the help of the back end APIs. There are two API's that can be used to update an interaction:</p>\r\n\r\n<ol>\r\n\t<li>Generic Interaction Wrapup&nbsp;API: This API can be used to create a new case and/or interaction. It enables the contact center agent to&nbsp;attach a new interaction to an existing case and&nbsp;edit&nbsp;an already existing interaction or&nbsp;a case.</li>\r\n</ol>\r\n\r\n<p style=\"margin-left: 40px;\">{{url}}/com-manh-cp-customerengagementfacade/api/interaction/wrapup</p>\r\n\r\n<div class=\"tip\" style=\"margin-left: 40px;\"><strong>Note</strong>: While passing an existing interaction ID through this API, it is mandatory to have the Case entity along with the interaction entity. Passing only the interaction entity in this API will not work. This API can also be used to create or update interactions and cases where the case entity is mandatory</div>\r\n\r\n<ol start=\"2\">\r\n\t<li>External Interaction Save API: This API&nbsp;can be used to create or update interactions.&nbsp;Case Id is not mandatory during update. However, the interaction Id is required to update the interaction. Interaction can be created or updated with or without the case ID. If&nbsp;the case ID is&nbsp;sent as blank or empty, then the interaction will disassociate&nbsp;from the case it was previously attached to and will not have any case ID&nbsp;attached to it - which means the interaction cannot be viewed on the UI. Hence, while using the external&nbsp;save API it&nbsp;is advisable to either provide a valid&nbsp;case ID&nbsp;in the request or remove the case ID&nbsp;attribute entirely&nbsp;from the request before posting the API so that&nbsp;the interaction will be retained to the original case and only the required data can be updated on it.&nbsp;</li>\r\n</ol>\r\n\r\n<div class=\"info\" style=\"margin-left: 40px;\">Refer to the<a href=\"/ce-interaction-wrapup$API\">&nbsp;Services section</a> below for External Save APIs&nbsp;that can be used.&nbsp;</div>\r\n\r\n<h3><a name=\"external-interaction-system-integration-nbsp\" id=\"external-interaction-system-integration-nbsp\"></a><a id=\"External CTI integration\" name=\"External CTI integration\"></a>External Interaction System Integration&nbsp;</h3>\r\n\r\n<p>The&nbsp;contact center agent can talk to the customer&nbsp;using an external interaction&nbsp;system&nbsp;to have a phone, email, chat, text conversation with the customer. During this conversation, the external&nbsp;system can fire a URL with the environment details along with the&nbsp;customer search field and any of the case or interaction entity attributes&nbsp;to the Customer Engagement application. Manhattan&nbsp;Active® Omni will fetch the customer data from the URL and open the customer's dashboard if the contact center agent is logged into the application. For example: If the customer is calling the external system from a&nbsp;registered phone number&nbsp;or if the customer is chatting, emailing the contact center agent with a valid email ID registered in our system, the URL fired from the external system will contain at least one of the customer search fields (Customer ID, First name, Last name, phoneNumber, Email ID) for the customers dashboard to open in the MAO screen. If the URL is fired with an invalid customer search field,&nbsp;the MAO screen will load with the contact center agent dashboard instead of the Customer Dashboard and the contact center agent can proceed with a manual customer search.&nbsp;</p>\r\n\r\n<p>Once the customer or contact center agent dashboard is opened based on the incoming URL, the contact center agent can record the&nbsp; Reference Order No, if any, and a detailed description of the interaction. If the contact center agent resolves the case successfully during the interaction,&nbsp;the interaction&nbsp;Wrap-Up Window can be closed by clicking Submit&nbsp;after recording the resolution, which will create a case and close it automatically. If the contact center agent is unable to resolve the case immediately during the interaction, the contact center agent can mark the case as Follow Up Required and close the Interaction<strong>&nbsp;</strong>Wrap-up&nbsp;window to create the case in Open status. The contact center agent can also add or view additional details of the case by clicking the&nbsp;More&nbsp;button available on the Interaction&nbsp;Wrap-up&nbsp;window before closing it.</p>\r\n\r\n<p>The incoming URL can also contain any case or interaction attribute values that are part of the Interaction wrap up or More screen. When the page loads, if the attribute available in the URL is part of the UI, the page will load with the fields pre-populated in the interaction wrap up UI. The URL can also have any extended or additional case or interaction attribute values that may or may not be part of the UI. When the contact center agent wraps up the interaction by clicking submit on the Interaction wrap up panel, all the valid case/Interaction data coming in as part of the URL gets persisted across the case and interaction respectively.</p>\r\n\r\n<div class=\"tip\">\r\n<p><strong>Note</strong>: When the external CTI system is firing the URL with the phone number,&nbsp;Manhattan&nbsp;Active® Omni expects the phone number to be sent in exactly the same format that is displayed on the customer dashboard.</p>\r\n\r\n<p><u>For example:</u><br>\r\n1. If the phone number is displayed as (678) 597-7070&nbsp;on the customer dashboard, then the external system has to send the URL as&nbsp;https://{{Environment URL}}/customerengagementfacade/app/customerdashboard?phoneNumber=(678) 597-7070<br>\r\n2. If the&nbsp;phone number is displayed as 6785977070&nbsp;on the customer dashboard,&nbsp;then the external system has to send the URL as&nbsp;https://{{Environment URL}}/customerengagementfacade/app/customerdashboard?phoneNumber=6785977070</p>\r\n</div>\r\n\r\n<div class=\"info\">\r\n<p><strong>The format of the attributes you are sending in the URL should match the format of these attributes in the response json.&nbsp;</strong></p>\r\n\r\n<p><u>For example:&nbsp;</u></p>\r\n\r\n<ol>\r\n\t<li>Summary should be sent as <strong>Case-CaseTitle</strong> in the URL</li>\r\n\t<li>Priority should be sent as <strong>Case-CasePriorityId</strong></li>\r\n\t<li>Resolution should be sent as<strong> Case-CaseSolution</strong></li>\r\n\t<li>Email Type should be <strong>Email-EmailTypeId</strong></li>\r\n\t<li>Due date should be sent&nbsp;as <strong>Case-DueDate</strong> in the correct date format E.g. 2023-01-09T23:59:00</li>\r\n</ol>\r\n\r\n<p><strong><em>Below is a Sample URL with all fields populated on the interaction wrap-up panel and ‘More’ screen for an email interaction:</em></strong></p>\r\n\r\n<p>&lt;&lt;URL&gt;&gt;/customerengagementfacade/app/customerdashboard?customerId=RN1009&InteractionType=Email&Email-EmailTypeId=General&Email-Subject=product damaged&Case-CaseStatusId=Open&Case-OrderId=OM-3919855453&Case-Description=Customer received damaged product&Case-DueDate=2023-01-09T23:59:00&Case-CasePriorityId=High&Case-CaseResolutionDesc=We informed the customer that the damaged item will be replaced soon&Case-CaseSolution=Replacement Order Create&Case-Team=Ants&Case-CaseTitle=Replacement order 98665 created for customer&Case-CaseCategoryId=Membership&Case-CaseSubCategoryId=Inquiry Order&IsWrapUpRequired=Y</p>\r\n</div>\r\n\r\n<div class=\"warning\">During the CTI flow, note that the case category, sub Category, Resolution, Status, Priority, and Origin should all be valid&nbsp;values available in the respective seed data and in the same format as defined in the seed data for it to show up in the UI. If not valid or if the case formatting is incorrect, then the value will show up as blank in the interaction wrap-up panel when the page loads.</div>\r\n\r\n<h3><a name=\"high-level-flow-for-external-interaction-system\" id=\"high-level-flow-for-external-interaction-system\"></a><a id=\"High Level flow for External CTI integration\" name=\"High Level flow for External CTI integration\"></a>High Level Flow for External Interaction System</h3>\r\n\r\n<p>This interaction wrap up can be used to wrap various interactions with the customer. On wrapping up an interaction, a case will be created with the respective interaction type associated to it.</p>\r\n\r\n<p>The diagram below explains the process and sequence of checks done during the interaction wrap up&nbsp;when the page loads with the URL fired from an External Interaction system</p>\r\n\r\n<p><img height=\"1582\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/interaction%20wrap%20up.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1L2ludGVyYWN0aW9uJTIwd3JhcCUyMHVwLnBuZyIsIkNvbmRpdGlvbiI6eyJEYXRlTGVzc1RoYW4iOnsiQVdTOkVwb2NoVGltZSI6MTc1NDc1MTk1NH19fV19&Signature=Kbuopd3hXAHVUxCI3OCbPBnpwHp-6cqQMiTE6OxJuDjsVJsWxtoMrAFfuj2nq-2PMgND2timosi1zXIbPoD7WLMRqIVhei3UrSHeEYUd4kwVlzu75gajH9IUIopA5Ot35v5gR1eQlTaNyrJHVHSNM2Jy7KF~k4JYTvtIjE50yh4uwI1xgPODdz3YergUt1J2abyQhTTJ1u3UsXjqWH6CnttwRShKRw0DROmaozSG7LwtZjJU1c8w6wwc8PcB03O1FhZtOg2OorYRemdJlfk-urVHmq0q42MadM-mzF~yK7DsFFNiPcZQrnwo7WixnJxBFndGcD5QjVeuTJNpiZQY7A__&Key-Pair-Id=K2TK3EG287XSFC\" width=\"1024\"></p>\r\n\r\n<div class=\"tip\" style=\"text-align: justify;\">Note: In case of wrapping up a case with third party integration for interaction - to retain the interaction details on the case, a custom approach is required to omit the&nbsp;ChatConversation key value pair from the save case call so that the system does not override it with blank (\" \").</div>\r\n\r\n<h3><a name=\"configuration-nbsp\" id=\"configuration-nbsp\"></a>Configuration&nbsp;</h3>\r\n\r\n<p>The grant required to view the interaction wrap up panel is&nbsp;customerengagementfacade::interactionwrap::admin&nbsp;</p>\r\n\r\n<p><strong>Interaction Type:&nbsp;</strong>These are the different types of interactions that can be wrapped up in the interaction wrap up panel. These interaction types have to be configured in the Customer Engagement Configuration in order to appear in the interaction type drop-down in the wrap up panel. The number of interactions, default&nbsp;interaction type, and sequence in which the drop-down list has to appear in the wrap up panel can all be configured in the&nbsp;<a hqid=\"2429187\" href=\"/customer_engagement_configurations\">Customer Engagement Config</a>&nbsp;under the 'Interaction types' section.&nbsp;&nbsp;</p>\r\n\r\n<p><strong>Email send and reply grants:&nbsp;</strong>Since the interaction wrap up can be called based on the URL&nbsp;sent from the third party interaction system, it could be possible for&nbsp;the customer using external systems to handle various interaction types and use MAO to wrap up the interactions. In such cases, when the user is sending email, it&nbsp;might be confusing to&nbsp;have the email send and reply buttons in MAO&nbsp;as well. Hence, these buttons are now permission controlled.&nbsp;</p>\r\n\r\n<p>User will&nbsp;not be able to use the \"Send email\" and \"Reply\" buttons on the Case detail screen if they do not have the permissions. Refer&nbsp;<a href=\"https://omni.helpdocsonline.com/customer-engagement-ui-resources\">Grants and Resources</a>&nbsp;to find the respective permissions.</p>\r\n\r\n<p><strong><a id=\"category in interaction wrap up\" name=\"category in interaction wrap up\"></a>Display Case Category and Case&nbsp;subcategory on the Interaction Wrap Up Panel:&nbsp;</strong></p>\r\n\r\n<p data-renderer-start-pos=\"786\">To enable display of category and sub category on the interaction wrap up panel, perform the following steps:</p>\r\n\r\n<ul data-indent-level=\"1\">\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"899\">Navigate to&nbsp;<strong data-renderer-mark=\"true\">Menu&nbsp;</strong>&gt;&nbsp;<strong data-renderer-mark=\"true\">Proactive&nbsp;</strong>&gt;<strong data-renderer-mark=\"true\">&nbsp;Proactive Menu</strong>&nbsp;&gt;&nbsp;<strong data-renderer-mark=\"true\">Functional Config</strong>&nbsp;&gt;<strong data-renderer-mark=\"true\">&nbsp;Review Behavior Changes</strong>.&nbsp;</p>\r\n\t</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"996\">For the record with&nbsp;<strong data-renderer-mark=\"true\">Change Name</strong>&nbsp;as 'OM - Category & Subcategory for Interaction Wrapup' set&nbsp;<strong data-renderer-mark=\"true\">Enabled&nbsp;</strong>to 'true'. If not enabled by the&nbsp;<strong data-renderer-mark=\"true\">Must Enable By Date</strong>&nbsp;listed in this UI, the theme will automatically be enabled on this date.&nbsp;</p>\r\n\t</li>\r\n</ul>\r\n\r\n<h3><a name=\"services\" id=\"services\"></a><a id=\"API\" name=\"API\"></a>Services</h3>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><strong><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service</font></strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Component</strong></th>\r\n\t\t\t<th scope=\"col\" style=\"width: 112px;\"><strong>Group</strong></th>\r\n\t\t\t<th scope=\"col\" style=\"width: 198px;\"><strong><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service Endpoint</font></strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Create case and interaction for Interaction wrapup&nbsp;</td>\r\n\t\t\t<td>&nbsp;Customer engagement Facade</td>\r\n\t\t\t<td style=\"width: 109px;\">Interaction Wrap Up Services&nbsp;</td>\r\n\t\t\t<td style=\"width: 196px;\"><br>\r\n\t\t\tPOST /api/interaction/wrapup</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Create Email Interaction</td>\r\n\t\t\t<td>Customer Interaction</td>\r\n\t\t\t<td style=\"width: 109px;\">Email Services</td>\r\n\t\t\t<td style=\"width: 196px;\">POST /api/customerinteraction/email</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Save Email interaction&nbsp;</td>\r\n\t\t\t<td>Customer Interaction</td>\r\n\t\t\t<td style=\"width: 109px;\">Email Services</td>\r\n\t\t\t<td style=\"width: 196px;\">POST/api/customerinteraction/email/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Create Phone Interaction</td>\r\n\t\t\t<td>Customer Interaction</td>\r\n\t\t\t<td style=\"width: 109px;\">Phone Services</td>\r\n\t\t\t<td style=\"width: 196px;\">POST /api/customerinteraction/phone</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Save Phone Interaction&nbsp;</td>\r\n\t\t\t<td>Customer Interaction</td>\r\n\t\t\t<td style=\"width: 109px;\">Phone Services</td>\r\n\t\t\t<td style=\"width: 196px;\">POST/api/customerinteraction/phone/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Create Chat Interaction</td>\r\n\t\t\t<td>Customer Interaction</td>\r\n\t\t\t<td style=\"width: 109px;\">Chat Services</td>\r\n\t\t\t<td style=\"width: 196px;\">POST/api/customerinteraction/chat</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Save Chat Interaction</td>\r\n\t\t\t<td>Customer Interaction</td>\r\n\t\t\t<td style=\"width: 109px;\">Chat Services</td>\r\n\t\t\t<td style=\"width: 196px;\">POST/api/customerinteraction/chat/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Create Social Interaction</td>\r\n\t\t\t<td>Customer Interaction</td>\r\n\t\t\t<td style=\"width: 109px;\">Social Services</td>\r\n\t\t\t<td style=\"width: 196px;\">POST/api/customerinteraction/social</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Save Social Interaction&nbsp;</td>\r\n\t\t\t<td>Customer Interaction</td>\r\n\t\t\t<td style=\"width: 109px;\">Social&nbsp;Services</td>\r\n\t\t\t<td style=\"width: 196px;\">POST/api/customerinteraction/social/save</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: The SAVE API's&nbsp;will create an interaction if it does not exist, or update an existing interaction if it already exists&nbsp;</div>\r\n\r\n<h3><a name=\"related-articles\" id=\"related-articles\"></a>Related Articles</h3>\r\n\r\n<div class=\"info\"><ul class=\"related-articles\"><li><a href=\"/interaction-configuration\" hqid=\"3526209\">Interaction Configuration</a></li><li><a href=\"/live-chat\" hqid=\"3338657\">Chat</a></li><li><a href=\"/ce-email-interactions\" hqid=\"2911287\">Emails </a></li><li><a href=\"/text_messaging\" hqid=\"2631481\">Text Messaging</a></li></ul></div>\r\n\r\n<p>&nbsp;</p>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 30391,
  "scraped_at": "2025-08-09T22:00:54.319585",
  "content_clean": "Home ››Manhattan Active® Omni››Customer Engagement››Process & Configuration Guides››Interactions ››Interaction Wrap up Interaction Wrap up OverviewInteraction Wrap Up IconInteraction CreationAuto-populate Order ID in Interaction Wrap-Up for Order Creation/EditsView Interaction DetailsEdit/Update InteractionsExternal Interaction System Integration High Level Flow for External Interaction SystemConfiguration ServicesRelated Articles Overview Interactions are attached to a case so that the Contact center agents can have a record of every interaction the customer has had regarding a case and to understand the reason for creating the case as well as track the progress of the case. The contact center agent can use the interaction wrap-up panel to wrap up any interaction that the contact center agent has had with the customer. Performing an Interaction wrap-up creates a record of the interaction with the customer and a case is automatically created when the interaction wrap-up is submitted. One of the many benefits of having all of these interaction details attached to a case is that at any given point, an old or new contact center agent looking into a case can understand the previous conversation the customer has had regarding the case and the contact center agent can proactively handle the case without having to reach back to the customer to repeatedly inquire the issue the customer has been facing. A contact center agent can create a case based on interaction with the customer over one of the many interaction channels like Phone, E-mail, Chat, and Social. For example, if a contact center agent has a phone call with the customer regarding an issue the customer was facing, after the phone call, the contact center agent can log in the basic details of the call and decide to wrap up the interaction in the application. This will create a case and will have the phone interaction details attached to it automatically when the case is viewed later. Another example could be that the contact center agent is having a live chat session with the customer on an external system and has resolved an issue for the customer via the chat session itself. The contact center agent can use the interaction wrap-up panel to wrap up and create a case for the customer associated with the chat interaction to have a record of what the issue was and how the contact center agent was able to solve it. Interaction Wrap Up Icon The Interaction Wrap Up Icon is displayed on all customer engagement screens as an icon, with the exception of the Agent Inbox; on the Agent Inbox, it is a button available for live interactions only. The Interaction wrap up icon may be left in its original location or be docked to the far-left bottom of the screen. Agents can select the docked icon to access the Wrap Up popup and provide information. Note: Wrap Up from any screen other than the Agent Inbox creates a brand-new case. Since the Chat Conversation field cannot be null for creating a case, the system will create it by populating the Chat Conversation field to blank (\" \") Interaction Creation The base interaction wrap-up has the following input fields: Interaction Type: These are the different types of interactions that can be wrapped up in the interaction wrap up panel. The number of interactions, defaulted interaction type, and sequence in which the drop-down list has to appear in the wrap up panel can all be configured in the 'Interaction types' section of Customer Engagement Config. For interactions received in the Customer Engagement Agent Inbox, this value is hardcoded. Order No: The contact center agent can link the case to an order number, if available. If the order mentioned in this field is a valid order in the system, opening the case after creation will show the order number hyperlinked in the case details section and the order status. Clicking on the order number hyperlink will take you to the order status page. Case Category and Subcategory: Contact center users can capture the case category name and subcategory name on the interaction wrap up panel for every interaction so that they can quickly capture details of where agents are spending their time. Description: This is a section to provide a brief description of the interaction. When you wrap up a phone interaction, the interaction description will be saved as entered in the description box of the interaction wrap up panel. For email and chat interaction, the subject is mapped to the description. Resolution Name: The resolution reason for solving a case. Case Status: The default value is closed. This means the case will be closed when the interaction is closed. The agent may change the status to another value, such as open, in progress or waiting. If the agent chooses any status but Closed, the interaction is closed, but the case remains in the status that the agent selected; when another interaction is received for the same customer, the system will associate it with the case (not in Closed status). For example, if the agent sets the Case Status to 'Waiting', and chooses the Submit button on the Wrap Up, the interaction is closed. The Case Status is set to 'Waiting'. When a new interaction arrives in the Agent Inbox, the system will associate it with the case. This allows the organization to more easily manage customer issues that span multiple conversations, such as the customer sending pictures of a damaged product or providing warranty information. The only required field on the Interaction Wrap up is the Interaction Type. If an organization has defined required fields for cases based on status, those values are not required if the case is closed from the Interaction Wrapup. The contact center agent can enter the above details and click submit to save the interaction while working on various screens within Customer Engagement. The advantage of this is that when the contact center agent does the wrap up from the customer dashboard screen, the customer details automatically get attached to the case. There might also be scenarios when the customer with whom the contact center agent is having a conversation is not in our system. In such cases, the contact center agent can wrap up the interaction from a more generic screen like the contact center agent dashboard or the Cases screen, in which the case will be created with all the interaction details entered, but no customer attached to it. The contact center agent can later create a customer and manually attach it to this particular case. More: The interaction wrap up also has a MORE button at the bottom of the screen. Clicking on this button will take the user to a screen which can be used to add or view additional details of the case. Submit: The user should click the button to wrap up the interaction. Clicking on this button internally calls the Interaction wrapup API, which creates a case first and then an interaction, and then manages to attach the case ID of the created case to the interaction. This enables the user to see the interaction attached to the case when the user views a case that was created as part of the interaction wrap up process. Note: Currently, we don't have a way to create a customer manually (other than through the place order flow). Auto-populate Order ID in Interaction Wrap-Up for Order Creation/Edits Contact center agents can capture the order number as part of the interaction wrap up process. In order to avoid manual errors while entering order IDs or having the agent copy and paste the order ID into the interaction wrap up panel there by increasing the number of clicks for capturing an interaction, the customer engagement application automatically populates order ID into the interaction wrap up panel when the agent views, edits or creates an order. Every time the agent creates, edits or views an order, the order ID gets auto-populated in the order number column within the interaction wrap up panel. The interaction wrap up panel is currently not visible while creating a new order. In such cases the agent will see the new created order id populated in the interaction wrap up panel when they land back on the customers' dashboard as soon as they place the order . Note: If the user manually enters an order Id and proceeds to view, edit or create a different order without submitting the interaction wrap up, the initial order Id that was populated will be overridden with the new order that the agent is currently working on. If the agent captures the order Id for a customer and then changes to another customer using the customer search option by clicking on “More” in the interaction wrap up panel, it will automatically clear the order number captured for the first customer. If an order ID is auto-populated in the interaction wrap up panel and the agent moves to a generic page like the home page or another customers' dashboard, it will automatically clear the order number captured initially when you move out of the current customer context. i.e, when an order Id is populated, it will get automatically cleared out if you land on a different customers dashboard or the customer details are cleared from the ‘more’ section manually or automatically by landing on a generic page. Auto population of order number in the text message flow is not supported currently. Auto population of order number when agents are working with archived is not supported currently. View Interaction Details Interactions wrapped up by a contact center agent on the UI or created using the backend API are displayed on the Case timeline section of the case. The contact center agent can get into the case management screen from the left navigation panel on the contact center agent dashboard and select a case, and then click on the 'view case details' option to view the case. If the case has any interaction associated with it, the contact center agent will be able to see the interaction in the case timeline section of the case. Also, if the user is aware of the customer for which the interaction was created, then all the interactions associated to the particular customer can be found on the Interaction panel available on the right end of the customer's dashboard. Subsequently, if the interaction wrap up was done with \"follow up = true\" then as mentioned earlier, the case will be created in an open status with the interaction associated with it. The list of open cases can be seen on the notifications tab of the customer dashboard. Tip: Interaction content may be imported as a JSON with HTML tags to display hyperlinks and text formatting. For example, hyperlinks in an email body may be clickable if using the <a href=></a> tags. Hyperlinks can also be pasted into the email body while composing an email. Clicking the hyperlink opens the link in a new browser tab. Edit/Update Interactions The interaction can be updated with the help of the back end APIs. There are two API's that can be used to update an interaction: Generic Interaction Wrapup API: This API can be used to create a new case and/or interaction. It enables the contact center agent to attach a new interaction to an existing case and edit an already existing interaction or a case. {{url}}/com-manh-cp-customerengagementfacade/api/interaction/wrapup Note: While passing an existing interaction ID through this API, it is mandatory to have the Case entity along with the interaction entity. Passing only the interaction entity in this API will not work. This API can also be used to create or update interactions and cases where the case entity is mandatory External Interaction Save API: This API can be used to create or update interactions. Case Id is not mandatory during update. However, the interaction Id is required to update the interaction. Interaction can be created or updated with or without the case ID. If the case ID is sent as blank or empty, then the interaction will disassociate from the case it was previously attached to and will not have any case ID attached to it - which means the interaction cannot be viewed on the UI. Hence, while using the external save API it is advisable to either provide a valid case ID in the request or remove the case ID attribute entirely from the request before posting the API so that the interaction will be retained to the original case and only the required data can be updated on it. Refer to the Services section below for External Save APIs that can be used. External Interaction System Integration The contact center agent can talk to the customer using an external interaction system to have a phone, email, chat, text conversation with the customer. During this conversation, the external system can fire a URL with the environment details along with the customer search field and any of the case or interaction entity attributes to the Customer Engagement application. Manhattan Active® Omni will fetch the customer data from the URL and open the customer's dashboard if the contact center agent is logged into the application. For example: If the customer is calling the external system from a registered phone number or if the customer is chatting, emailing the contact center agent with a valid email ID registered in our system, the URL fired from the external system will contain at least one of the customer search fields (Customer ID, First name, Last name, phoneNumber, Email ID) for the customers dashboard to open in the MAO screen. If the URL is fired with an invalid customer search field, the MAO screen will load with the contact center agent dashboard instead of the Customer Dashboard and the contact center agent can proceed with a manual customer search. Once the customer or contact center agent dashboard is opened based on the incoming URL, the contact center agent can record the  Reference Order No, if any, and a detailed description of the interaction. If the contact center agent resolves the case successfully during the interaction, the interaction Wrap-Up Window can be closed by clicking Submit after recording the resolution, which will create a case and close it automatically. If the contact center agent is unable to resolve the case immediately during the interaction, the contact center agent can mark the case as Follow Up Required and close the Interaction Wrap-up window to create the case in Open status. The contact center agent can also add or view additional details of the case by clicking the More button available on the Interaction Wrap-up window before closing it. The incoming URL can also contain any case or interaction attribute values that are part of the Interaction wrap up or More screen. When the page loads, if the attribute available in the URL is part of the UI, the page will load with the fields pre-populated in the interaction wrap up UI. The URL can also have any extended or additional case or interaction attribute values that may or may not be part of the UI. When the contact center agent wraps up the interaction by clicking submit on the Interaction wrap up panel, all the valid case/Interaction data coming in as part of the URL gets persisted across the case and interaction respectively. Note: When the external CTI system is firing the URL with the phone number, Manhattan Active® Omni expects the phone number to be sent in exactly the same format that is displayed on the customer dashboard. For example: 1. If the phone number is displayed as (678) 597-7070 on the customer dashboard, then the external system has to send the URL as https://{{Environment URL}}/customerengagementfacade/app/customerdashboard?phoneNumber=(678) 597-7070 2. If the phone number is displayed as 6785977070 on the customer dashboard, then the external system has to send the URL as https://{{Environment URL}}/customerengagementfacade/app/customerdashboard?phoneNumber=6785977070 The format of the attributes you are sending in the URL should match the format of these attributes in the response json. For example: Summary should be sent as Case-CaseTitle in the URL Priority should be sent as Case-CasePriorityId Resolution should be sent as Case-CaseSolution Email Type should be Email-EmailTypeId Due date should be sent as Case-DueDate in the correct date format E.g. 2023-01-09T23:59:00 Below is a Sample URL with all fields populated on the interaction wrap-up panel and ‘More’ screen for an email interaction: <<URL>>/customerengagementfacade/app/customerdashboard?customerId=RN1009&InteractionType=Email&Email-EmailTypeId=General&Email-Subject=product damaged&Case-CaseStatusId=Open&Case-OrderId=OM-3919855453&Case-Description=Customer received damaged product&Case-DueDate=2023-01-09T23:59:00&Case-CasePriorityId=High&Case-CaseResolutionDesc=We informed the customer that the damaged item will be replaced soon&Case-CaseSolution=Replacement Order Create&Case-Team=Ants&Case-CaseTitle=Replacement order 98665 created for customer&Case-CaseCategoryId=Membership&Case-CaseSubCategoryId=Inquiry Order&IsWrapUpRequired=Y During the CTI flow, note that the case category, sub Category, Resolution, Status, Priority, and Origin should all be valid values available in the respective seed data and in the same format as defined in the seed data for it to show up in the UI. If not valid or if the case formatting is incorrect, then the value will show up as blank in the interaction wrap-up panel when the page loads. High Level Flow for External Interaction System This interaction wrap up can be used to wrap various interactions with the customer. On wrapping up an interaction, a case will be created with the respective interaction type associated to it. The diagram below explains the process and sequence of checks done during the interaction wrap up when the page loads with the URL fired from an External Interaction system Note: In case of wrapping up a case with third party integration for interaction - to retain the interaction details on the case, a custom approach is required to omit the ChatConversation key value pair from the save case call so that the system does not override it with blank (\" \"). Configuration The grant required to view the interaction wrap up panel is customerengagementfacade::interactionwrap::admin Interaction Type: These are the different types of interactions that can be wrapped up in the interaction wrap up panel. These interaction types have to be configured in the Customer Engagement Configuration in order to appear in the interaction type drop-down in the wrap up panel. The number of interactions, default interaction type, and sequence in which the drop-down list has to appear in the wrap up panel can all be configured in the Customer Engagement Config under the 'Interaction types' section. Email send and reply grants: Since the interaction wrap up can be called based on the URL sent from the third party interaction system, it could be possible for the customer using external systems to handle various interaction types and use MAO to wrap up the interactions. In such cases, when the user is sending email, it might be confusing to have the email send and reply buttons in MAO as well. Hence, these buttons are now permission controlled. User will not be able to use the \"Send email\" and \"Reply\" buttons on the Case detail screen if they do not have the permissions. Refer Grants and Resources to find the respective permissions. Display Case Category and Case subcategory on the Interaction Wrap Up Panel: To enable display of category and sub category on the interaction wrap up panel, perform the following steps: Navigate to Menu > Proactive > Proactive Menu > Functional Config > Review Behavior Changes. For the record with Change Name as 'OM - Category & Subcategory for Interaction Wrapup' set Enabled to 'true'. If not enabled by the Must Enable By Date listed in this UI, the theme will automatically be enabled on this date. Services Service Component Group Service Endpoint Create case and interaction for Interaction wrapup Customer engagement Facade Interaction Wrap Up Services POST /api/interaction/wrapup Create Email Interaction Customer Interaction Email Services POST /api/customerinteraction/email Save Email interaction Customer Interaction Email Services POST/api/customerinteraction/email/save Create Phone Interaction Customer Interaction Phone Services POST /api/customerinteraction/phone Save Phone Interaction Customer Interaction Phone Services POST/api/customerinteraction/phone/save Create Chat Interaction Customer Interaction Chat Services POST/api/customerinteraction/chat Save Chat Interaction Customer Interaction Chat Services POST/api/customerinteraction/chat/save Create Social Interaction Customer Interaction Social Services POST/api/customerinteraction/social Save Social Interaction Customer Interaction Social Services POST/api/customerinteraction/social/save Note: The SAVE API's will create an interaction if it does not exist, or update an existing interaction if it already exists Related Articles Interaction ConfigurationChatEmails Text Messaging"
}