{
  "id": "2046190",
  "permalink": "config-ui",
  "title": "Config UI",
  "type": "topic",
  "level": 3,
  "path": "Administrator Tools/Master Data Guides/Master Data Guide - Omni/Config UIs",
  "raw_item": {
    "id": "2046190",
    "text": "Config UIs",
    "title": "Config UIs",
    "permalink": "config-ui",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "t;2161520",
    "parent": "2161520",
    "created_date": "1532410049",
    "modified_date": "1743768677",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "2"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"2161445\" href=\"/administrators\" class=\"breadcrumb-links\">Administrator Tools</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3502177\" href=\"/new-folder-5\" class=\"breadcrumb-links\">Master Data Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2161520\" href=\"/master-data-guide\" class=\"breadcrumb-links\">Master Data Guide - Omni</a></li><li> <span>››</span>Config UI</li></ul>  \t\r\n\t\t<h2>Config UIs</h2>\r\n\r\n<p><span contenteditable=\"false\" tabindex=\"-1\"></span></p>\r\n\r\n<h3><a name=\"store-configuration-override\" id=\"store-configuration-override\"></a>Store Configuration Override</h3>\r\n\r\n<div class=\"info\"><span contenteditable=\"false\" tabindex=\"-1\"><ul><li><a href=\"/config-ui$store-configuration-override\">Store Configuration Override</a><ul><li><a href=\"/config-ui$prerequisites\">Prerequisites</a><ul><li><a href=\"/config-ui$organization-level\">Organization Level</a></li><li><a href=\"/config-ui$store-profile-level\">Store Profile Level</a></li><li><a href=\"/config-ui$location-level\">Location Level</a></li></ul></li><li><a href=\"/config-ui$business-configuration\">Business Configuration</a><ul><li><a href=\"/config-ui$organization-level\">Organization Level</a></li><li><a href=\"/config-ui$store-profile-type-level\">Store Profile Type Level</a></li><li><a href=\"/config-ui$location-level\">Location Level</a></li></ul></li><li><a href=\"/config-ui$deleting-a-profile\">Deleting a Profile</a></li></ul></li><li><a href=\"/config-ui$grid-tile-view\">Grid/Tile View</a></li><li><a href=\"/config-ui$mup-configuration-uis\">MUP Configuration UIs</a><ul><li><a href=\"/config-ui$permissions\">Permissions</a></li></ul></li></ul></span></div>\r\n\r\n<p>Certain profile-based Store Fulfillment, Store Inventory&nbsp;and Point of Sale configuration can be overridden for a store or group of stores. Overrides are&nbsp;defined for a profile purpose, which is a functional grouping of one or more related&nbsp;configuration tables. Refer to the <a href=\"https://omni.helpdocsonline.com/master-data-guide$profilepurpose\">Master Data Guide</a> for additional information for profile purposes. The three levels of hierarchical configuration are:</p>\r\n\r\n<ul>\r\n\t<li>Organization - This configuration level applies to all locations in the organization, unless an override has been created for the location. This is the default configuration level unless steps are taken to override the profile purpose at the store profile or location level.</li>\r\n\t<li>Store profile level - The store profile type allows a group of stores in an&nbsp;organization to share the same configuration for a profile purpose. For example, a retailer could create a store profile type&nbsp;for their outlet stores and define a fulfillment configuration that differs from their non-outlet stores. Store profile types are assigned to locations in the Location UI.&nbsp;Store profile type-level overrides are optional and must be manually configured.</li>\r\n\t<li>Location - This is the most specific level of configuration and applies only to the override store. Location-level overrides are optional and must be manually defined.</li>\r\n</ul>\r\n\r\n<p>If the configuration for a location is defined at multiple levels, the most specific configuration level is used. For example, assume an organization exists with 100 locations and the retailer would like a group of 3 pilot stores to enable functionality before other stores:</p>\r\n\r\n<ul>\r\n\t<li>Locations 1 - 100 reside in Organization A</li>\r\n\t<li>Locations 1-3 are pilot stores</li>\r\n\t<li>Locations 4-100 are non-pilot/regular stores</li>\r\n\t<li>The retailer creates a store profile type called &quot;Pilot&quot; and assigns locations 1-3 to that store profile type ID</li>\r\n\t<li>Since the retailer uses Store Fulfillment and Store Inventory, they create profile overrides for the Pilot store profile type for the related&nbsp;profile purposes (following the steps outlined in this document.)</li>\r\n\t<li>The store fulfillment and inventory configuration for stores 1, 2 and 3 is retrieved from the Pilot store profile type override, while the configuration for the remaining 97 stores falls back to the organization level values.</li>\r\n</ul>\r\n\r\n<h4><a name=\"prerequisites\" id=\"prerequisites\"></a>Prerequisites</h4>\r\n\r\n<h5><a name=\"organization-level\" id=\"organization-level\"></a><a id=\"provisioning-profile-organization\" name=\"provisioning-profile-organization\"></a>Organization Level</h5>\r\n\r\n<p>To maintain, configuration / master data at the organization level follow the below-mentioned steps.</p>\r\n\r\n<ol>\r\n\t<li>Navigate to the <strong>Provisioning Profiles UI</strong></li>\r\n\t<li>Select the active Provisioning Profile for the current organization and click on view</li>\r\n\t<li>In the Edit Provisioning Profile UI, click on the Provisioning Profile Detail tab.</li>\r\n\t<li>The list of all the Profile Purposes is displayed</li>\r\n\t<li>Search for the required Profile Purpose for which you want to change or set the organization level profile</li>\r\n\t<li>Once a Profile Purpose is selected, you can either choose to copy / edit the configuration for the selected profile purpose.\r\n\t<ol>\r\n\t\t<li>Copy &ndash; Can be used to copy the data from the existing profile that the profile purpose is associated to a new profile id</li>\r\n\t\t<li>Edit &ndash; Change the existing profile id and assign a new profile id to be used for the profile purpose</li>\r\n\t</ol>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Example: Let&#39;s say we want to create a new organization and assign a new profile id for the Store RFID configuration.</p>\r\n\r\n<ol>\r\n\t<li>In the provisioning profile UI, search for srf, a list of all the profile purposes for the store rfid component is listed.</li>\r\n\t<li>Click on the Edit pencil icon for the Profile Purpose Id srf::rfconfig</li>\r\n\t<li>In the popup, select the new profile id and click on save</li>\r\n</ol>\r\n\r\n<h5><a name=\"store-profile-level\" id=\"store-profile-level\"></a><a id=\"provisioning-profile-store-profile\" name=\"provisioning-profile-store-profile\"></a>Store Profile Level</h5>\r\n\r\n<p>To create a store profile type override for a group of locations, follow the below-mentioned steps.</p>\r\n\r\n<ol>\r\n\t<li>In the <strong>Locations UI</strong>, select a Store Profile Type Id for a location to associate that location with a Store Profile type. For example, if the same configuration must be set for all the outlet stores, then all the outlet stores can be assigned the Outlet Store Profile Type.</li>\r\n\t<li>Create a new profile id for the Store Profile Type</li>\r\n\t<li>Navigate to the <strong>Provisioning Profiles UI</strong></li>\r\n\t<li>Select the active Provisioning Profile for the current organization and click on view</li>\r\n\t<li>In the Edit Provisioning Profile UI, click on the Provisioning Profile Detail tab.</li>\r\n\t<li>The list of all the Profile Purposes is displayed</li>\r\n\t<li>Click on Add</li>\r\n\t<li>On the following screen, select the profile purpose that needs to be maintained at the store profile type. For example, type and select srf::rfconfig</li>\r\n\t<li>Type the Store Profile Type Id, for example, Outlet</li>\r\n\t<li>Select the newly created profile id and click on save</li>\r\n</ol>\r\n\r\n<p>Example: Let&rsquo;s say, we want to roll out the RFID features to only a few stores</p>\r\n\r\n<ol>\r\n\t<li>The locations for which rfid must be enabled can be set to the same Store Profile Type id.</li>\r\n\t<li>In the provisioning profile UI, click on Add</li>\r\n\t<li>Select the Profile purpose Id srf::rfconfig</li>\r\n\t<li>Enter the Store Profile Type Id</li>\r\n\t<li>Select the new profile id and click on save</li>\r\n</ol>\r\n\r\n<h5><a name=\"location-level\" id=\"location-level\"></a><a id=\"provisioning-profile-location\" name=\"provisioning-profile-location\"></a>Location Level</h5>\r\n\r\n<p>To maintain configuration or data at a location level, follow the below-mentioned steps.</p>\r\n\r\n<ol>\r\n\t<li>Create a new profile id for the location in the <strong>Profile UI</strong></li>\r\n\t<li>Navigate to the <strong>Provisioning Profiles UI</strong></li>\r\n\t<li>Select the active Provisioning Profile for the current organization and click on view</li>\r\n\t<li>In the Edit Provisioning Profile UI, click on the Provisioning Profile Detail tab</li>\r\n\t<li>The list of all the Profile Purposes is displayed</li>\r\n\t<li>Click on Add</li>\r\n\t<li>In the following screen, select the profile purpose that needs to be maintained at the store profile type. For example, type and select srf::rfconfig</li>\r\n\t<li>Type the location Id, for example Str-1045</li>\r\n\t<li>Select the newly created profile id and click on save.</li>\r\n</ol>\r\n\r\n<h4><a name=\"business-configuration\" id=\"business-configuration\"></a>Business Configuration</h4>\r\n\r\n<p>Accessing and updating the configuration at the three levels:</p>\r\n\r\n<ul>\r\n\t<li><a href=\"/config-ui$OrganizationLevel\">Organization</a>&nbsp;- This&nbsp;option is shown&nbsp;on the config UI only if the user has set up the location level profile within the <a href=\"https://omni.helpdocsonline.com/config-ui$provisioning-profile-organization\">provisioning profile.</a>&nbsp;</li>\r\n\t<li><a href=\"/config-ui$LocationLevel\">Location</a>&nbsp;-&nbsp;This&nbsp;option&nbsp;is shown&nbsp;on the config UI only&nbsp;if the user has set up the location level profile within the <a href=\"https://omni.helpdocsonline.com/config-ui$provisioning-profile-store-profile\">provisioning profile.</a><a href=\"https://omni.helpdocsonline.com/config-ui$provisioning-profile-location\">&nbsp;</a></li>\r\n\t<li><a href=\"/config-ui$StoreProfileTypeLevel\">Store Profile Type</a>&nbsp;&ndash; This drop-down list is shown on the config UI&nbsp;only if the user has set up a profile for a location group (i.e., Store Profile Type), within a <a href=\"https://omni.helpdocsonline.com/config-ui$provisioning-profile-store-profile\">provisioning profile.</a></li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note:&nbsp;</strong>This section is displayed only if the conditions listed in the&nbsp;<a href=\"/config-ui$Prerequisites\">Prerequisites</a>&nbsp;section below are met. Also, if you select the location level in the selection panel and navigate to another config UI page and then return to this page, the system remembers the selection. The default organization selection is displayed when you navigate to a page for the first time or when you navigate to a different application and then return to this page.&nbsp;</div>\r\n\r\n<h5><a name=\"organization-level\" id=\"organization-level\"></a><a id=\"OrganizationLevel\" name=\"OrganizationLevel\"><span style=\"color:#000000;\">Organization Level</span></a></h5>\r\n\r\n<p>Users who have the required permission can change the configuration/master data for an entity at the organization level so that the configured data set can be used for a specific organization.&nbsp;Organization level data can be created, updated or deleted for location overridable entities. A warning message indicating the level of the managed dataset/profile&nbsp;is displayed.&nbsp;For example, when adding a record to the organization level profile, which is used by a specific store/location, the warning message&nbsp;&ldquo;Configuration managed by organization: &lt;<em>organization</em>&gt;&rdquo; is displayed and indicates&nbsp;the organization for which the data is configured.&nbsp;Users are warned about the level/profile when adding, editing or deleting related entities such as Carrier Package Types for a specific Carrier as well as performing these operations on the child entities.</p>\r\n\r\n<p>To create a specific configuration/master data for an entity at the organization level, perform the following steps:</p>\r\n\r\n<ol>\r\n\t<li>From the omnifacade or masterdatafacade config UI menu, select the menu option for the entity that you want to configure the organization-level data. By default, the Organization option is selected for the&nbsp;<strong>Manage Configuration for</strong>&nbsp;field. For example, enter&nbsp;<strong>Carriers</strong>&nbsp;in the search menu. All the carriers at the organization level are displayed.</li>\r\n\t<li>The organization-level data set for the selected entity is displayed. You can perform the following actions:</li>\r\n</ol>\r\n\r\n<ul>\r\n\t<li><strong>Delete</strong>&nbsp;&ndash; Select the required option from the displayed data set. Tap&nbsp;<strong>Delete</strong>. Deletes the selected option and the organization-level profile data is updated.</li>\r\n\t<li><strong>View</strong>&nbsp;&ndash; Select the required option from the displayed data set. Tap&nbsp;<strong>View</strong>. The Edit &lt;<em>entity</em>&gt; screen is displayed. Modify the attributes, if required, and tap&nbsp;<strong>Save</strong>.</li>\r\n\t<li><strong>Add</strong>&nbsp;&ndash; Tap&nbsp;<strong>Add</strong>. The Add &lt;<em>entity</em>&gt; screen is displayed. The message &ldquo;Configuration managed by organization: &lt;<em>organization name</em>&gt;&rdquo; is displayed and indicates the organization for which the data is configured. Enter the attributes for the entity and tap&nbsp;<strong>Save</strong>. The configuration is saved at the organization level.</li>\r\n</ul>\r\n\r\n<ol>\r\n</ol>\r\n\r\n<h5><a name=\"store-profile-type-level\" id=\"store-profile-type-level\"></a><a id=\"StoreProfileTypeLevel\" name=\"StoreProfileTypeLevel\"><span style=\"color:#000000;\">Store Profile Type Level</span></a></h5>\r\n\r\n<p>Users, who have the required permission, can change the store profile type level at which the configuration entity data is set up so that the configured data set can be used for a specific store profile type.</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong>&nbsp;The&nbsp;Store Profile Type drop-down list is available only if the user has set up the provisioning profile at the store profile type level.</div>\r\n\r\n<p>To create a specific configuration/master data for an entity at the store profile type level, perform the following steps:</p>\r\n\r\n<ol>\r\n\t<li>From the omnifacade or masterdatafacade config UI menu, select the menu option for the entity that you want to configure the store profile type-level data. By default, the&nbsp;<strong>Organization</strong>&nbsp;option is selected for the&nbsp;<strong>Manage Configuration for</strong>&nbsp;field.&nbsp;</li>\r\n\t<li>Select the&nbsp;<strong>Store Profile Type</strong>&nbsp;option in the&nbsp;<strong>Manage Configuration for</strong>&nbsp;field and select an appropriate option from the drop-down list. &nbsp;If the profile does not exist for the selected store profile type, then the message &quot;Data not found&quot; is displayed. The store profile type-level data set for the selected entity is displayed, if the specific store profile type exists.</li>\r\n</ol>\r\n\r\n<p style=\"margin-left:.5in;\">You can perform the following actions:</p>\r\n\r\n<ul>\r\n\t<li><strong>Delete</strong>&nbsp;&ndash; Select the required option from the displayed data set. Tap&nbsp;<strong>Delete</strong>. Deletes the selected option and the store profile type level data is updated.</li>\r\n\t<li><strong>View</strong>&nbsp;&ndash; Select the required option from the displayed data set. Tap&nbsp;<strong>View</strong>. The Edit &lt;<em>entity</em>&gt; screen is displayed. Modify the attributes, if required, and tap&nbsp;<strong>Save</strong>. The modifications made to the entity are saved.</li>\r\n\t<li><strong>Add</strong>&nbsp;&ndash; Tap&nbsp;<strong>Add</strong>. The Add &lt;<em>entity</em>&gt; screen is displayed. The message &ldquo;Configuration managed by store profile type: &lt;<em>store profile type name</em>&gt;&rdquo; is displayed and indicates the store profile type for which the data is configured. Enter the attributes for the entity and tap&nbsp;<strong>Save</strong>. The configuration is saved at the store profile type level.</li>\r\n</ul>\r\n\r\n<h5><a name=\"location-level\" id=\"location-level\"></a><a id=\"LocationLevel\" name=\"LocationLevel\"><span style=\"color:#000000;\">Location Level</span></a></h5>\r\n\r\n<p>Users, who have the required permission, can change the location level at which the configuration entity data is set up so that the configured data set can be used for a specific location.</p>\r\n\r\n<p>To create a specific configuration/master data for an entity at the location level, perform the following steps:</p>\r\n\r\n<ol>\r\n\t<li>From the omnifacade or masterdatafacade config UI menu, select the menu option for the entity that&nbsp;you want to configure the location-level data. By default, the Organization option is selected for the&nbsp;<strong>Manage Configuration for</strong>&nbsp;field.&nbsp;</li>\r\n\t<li>Select the&nbsp;<strong>Location</strong>&nbsp;option in the&nbsp;<strong>Manage Configuration for</strong>&nbsp;field and enter the required location ID in the Location option. If the profile does not exist for the selected location, then the message &quot;Data not found&quot; is displayed. The location-level data set for the selected entity is displayed, if the location specific profile exists. You can perform the following actions:</li>\r\n</ol>\r\n\r\n<ul>\r\n\t<li><strong>Delete</strong>&nbsp;&ndash; Select the required option from the displayed data set. Tap&nbsp;<strong>Delete</strong>. Deletes the selected option and the location-level profile data is updated.</li>\r\n\t<li><strong>View</strong>&nbsp;&ndash; Select the required option from the displayed data set. Tap&nbsp;<strong>View</strong>. The Edit &lt;<em>entity</em>&gt; screen is displayed. Modify the attributes, if required, and tap&nbsp;<strong>Save</strong>.</li>\r\n\t<li><strong>Add</strong>&nbsp;&ndash; Tap&nbsp;<strong>Add</strong>. The Add &lt;<em>entity</em>&gt; screen is displayed. The message &ldquo;Configuration managed by location: &lt;<em>location name</em>&gt;&rdquo; is displayed and indicates the location for which the data is configured. Enter the attributes for the entity and tap&nbsp;<strong>Save</strong>. The configuration is saved at the location level.</li>\r\n</ul>\r\n\r\n<ol>\r\n\t<li value=\"4\">If the location specific profile does not exist and store profile type level exists for that location, then the data for that store profile type level is displayed. The message &ldquo;This data is used by selected Organization.&rdquo; is displayed.</li>\r\n\t<li>If neither the location specific nor store profile type level profile exists, then the message &ldquo;Selected Location uses Organization level data&rdquo; is displayed.&nbsp;</li>\r\n</ol>\r\n\r\n<h4><a name=\"deleting-a-profile\" id=\"deleting-a-profile\"></a>Deleting a Profile</h4>\r\n\r\n<p>Deleting a profile is possible only through the backend. This is not possible from the UI.</p>\r\n\r\n<h3><a name=\"grid-tile-view\" id=\"grid-tile-view\"></a>Grid/Tile View</h3>\r\n\r\n<p>For configuration entities that are displayed in auto-generated UIs, users can view the config data in a grid or tile format. The tile view&nbsp;is displayed as the default view, and can be changed to grid view if desired by the user. In both formats,&nbsp;20 records are shown per page.</p>\r\n\r\n<p>Note - Sorting in grid mode&nbsp;is currently unavailable.&nbsp;</p>\r\n\r\n<h3><a name=\"mup-configuration-uis\" id=\"mup-configuration-uis\"></a><a id=\"storeconfiguisonmup\" name=\"storeconfiguisonmup\"></a>MUP Configuration UIs</h3>\r\n\r\n<p>Newer configuration UIs are created in the Manhattan UI platform (MUP). Menu links for these UIs exist in the&nbsp;Omni home page (omnifacade). Upon clicking the menu link, the UI opens in a&nbsp; MUP facade browser tab where menu links for other MUP config UIs exist.&nbsp;</p>\r\n\r\n<h5><a name=\"permissions\" id=\"permissions\"></a>Permissions</h5>\r\n\r\n<p>Users must be given permissions to access MUP UIs and to perform granular actions once inside the UI. Wildcard permissions are supported (i.e., omui::*). Users are able to add access to different menus from MUP UI by using menu maintainence.</p>\r\n\r\n<h6>Menu permissions</h6>\r\n\r\n<p>Menu resources&nbsp;follow this pattern:</p>\r\n\r\n<p><em>omui::&lt;component&gt;::menu::&lt;Entity&gt;</em></p>\r\n\r\n<p>Examples:&nbsp;</p>\r\n\r\n<ul>\r\n\t<li><strong>omui::fulfillment::menu::TransferType</strong></li>\r\n\t<li><strong>omui::storefacade::menu::storeRfidParameters</strong></li>\r\n\t<li><strong>omui::inventory::menu::smartSyncConfig</strong></li>\r\n\t<li><strong>omui::inventory::menu::reservationRequest</strong></li>\r\n</ul>\r\n\r\n<p>Wildcard permissions are supported for MUP UI menu access (i.e., omui::fulfillment::menu::*)</p>\r\n\r\n<h6>Action permissions</h6>\r\n\r\n<p>Granular action level resources within a UI follow this pattern:</p>\r\n\r\n<p><em>omui::&lt;component&gt;::&lt;Entity&gt;::&lt;Child Entity&gt;::&lt;Action&gt;</em></p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:1000px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th>\r\n\t\t\t<p>Resource ID</p>\r\n\t\t\t</th>\r\n\t\t\t<th>Resource Description</th>\r\n\t\t\t<th>Scope of control</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p><em>omui::&lt;component name&gt;::&lt;function&gt;::details</em></p>\r\n\r\n\t\t\t<p>Example&nbsp;- <strong>omui::parcel::upgradedfacilityaccount::details</strong></p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Read access to config UI</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>DETAILS button</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p><em>omui::{component name}::{function}::create</em></p>\r\n\r\n\t\t\t<p>Example&nbsp;- <strong>omui::parcel::upgradedfacilityaccount::create</strong></p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Allows you to create new records in the config UI</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>CREATE button</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p><em>omui::{component name}::{function}::delete</em></p>\r\n\r\n\t\t\t<p>Example&nbsp;- <strong>omui::parcel::upgradedfacilityaccount::delete</strong></p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Allows you to delete records in the config UI</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>DELETE button</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p><em>omui::{component name}::{function}::edit</em></p>\r\n\r\n\t\t\t<p>Example&nbsp;- <strong>omui::parcel::upgradedfacilityaccount::edit</strong></p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Allows you to edit records in the config UI</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>EDIT button</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p><em>omui::{component name}::{function}::create</em></p>\r\n\r\n\t\t\t<p>Example&nbsp;- <strong>omui::inventory</strong><strong>::smartsyncconfig</strong><strong>::create</strong></p>\r\n\t\t\t</td>\r\n\t\t\t<td>Allows you to create new records in the smart sync config UI</td>\r\n\t\t\t<td>CREATE button</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p><em>omui::{component name}::{function}::edit</em></p>\r\n\r\n\t\t\t<p>Example&nbsp;- <strong>omui::inventory</strong><strong>::smartsyncconfig::edit</strong></p>\r\n\t\t\t</td>\r\n\t\t\t<td>Allows you to edit records in the smart sync config UI</td>\r\n\t\t\t<td>EDIT button</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p><em>omui::{component name}::{function}::delete</em></p>\r\n\r\n\t\t\t<p>Example&nbsp;- <strong>omui::inventory</strong><strong>::smartsyncconfig::delete</strong></p>\r\n\t\t\t</td>\r\n\t\t\t<td>Allows you to delete records in the smart sync config UI</td>\r\n\t\t\t<td>DELETE button</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p><em>omui::{component name}::{function}::create</em></p>\r\n\r\n\t\t\t<p>Example&nbsp;- <strong>omui::inventory</strong><strong>::reservationrequest</strong><strong>::create</strong></p>\r\n\t\t\t</td>\r\n\t\t\t<td>Allows you to create new records in the reservation request UI</td>\r\n\t\t\t<td>CREATE button</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p><em>omui::{component name}::{function}::create</em></p>\r\n\r\n\t\t\t<p>Example&nbsp;- <strong>omui::inventory</strong><strong>::reservationrequest</strong><strong>::edit</strong></p>\r\n\t\t\t</td>\r\n\t\t\t<td>Allows you to edit records in the reservation request UI</td>\r\n\t\t\t<td>EDIT button</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p><em>omui::{component name}::{function}::create</em></p>\r\n\r\n\t\t\t<p>Example&nbsp;- <strong>omui::inventory</strong><strong>::reservationrequest::delete</strong></p>\r\n\t\t\t</td>\r\n\t\t\t<td>Allows you to delete records in the reservation request UI</td>\r\n\t\t\t<td>DELETE button</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>Examples:</p>\r\n\r\n<ul>\r\n\t<li>Permissions for a granular action that contain a child entity are&nbsp;<strong>omui::storefacade::storeconfig::storeexceptions::add</strong>,&nbsp;<strong>omui::storefacade::storeconfig::storeexceptions::edit</strong> and&nbsp;<strong>omui::storefacade::storeconfig::storeexceptions::delete</strong>.&nbsp;</li>\r\n\t<li>Permissions for a granular action which do&nbsp;not contain a child entity is <strong>omui::fulfillment::transfertype::edit </strong>and&nbsp;<strong>omui::fulfillment::transfertype::delete</strong>.</li>\r\n</ul>\r\n\r\n<p>Wildcard permissions are supported for granular actions (i.e., omui::fulfillment::transfertype::*).</p>\r\n\r\n<p><strong>Steps for viewing&nbsp;Records on &#39;Store Fulfillment&nbsp;Transfer Types&#39; UI:</strong></p>\r\n\r\n<p>a) Go to Omni&gt; Manage Store Fulfillment Configuration&gt;&nbsp;Store Fulfillment Transfer Types to open the &#39;Store Fulfillment Transfer Types&#39; UI page.</p>\r\n\r\n<p><img height=\"1849\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/5292/image.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1LzUyOTIvaW1hZ2UucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUyNTczfX19XX0_&Signature=FImPd2fVCCBfw5V1p5UG-ozYSsdmSaMHp3sG2lZC-DK1Ws9csYd7Sj5luQXtd29MQy-JOIYbjntirA8TKfPJ0~A~SoZO73YosdSrKuPyOd1siOjyTbKlO9MnyFLGs-H0IlVTeRuv20NF7S2h3wNhgfDkeuT6j4a7gF8Z1MOiici-rAFuHWt3GDQL~Hmm7hAcFsrV7k0HIL3vgEJlfZo1yTPNpl3RqqzChLDlo7axnrNySJOQA8fstszYo0ellZo17LxHfXmlJPOX5PrIwkVQtWI6yLWe7IQJS3Y3qK-gjnCuzr0krjb4MqggGSZ90a851feAOgIR-iZK0QER6GM7xg__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 243px; height: 296px;\" width=\"1024\" /></p>\r\n\r\n<p>b) In &#39;Store Fulfillment Transfer Types&#39;&nbsp; UI click on &#39;Store-like&#39; icon&nbsp;<img height=\"1147\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/2379/image.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1LzIzNzkvaW1hZ2UucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUyNTczfX19XX0_&Signature=p1YJi~8nLTD5ifYxKu1oLX2aZTn0ssty3muUWfRXGzyK5DDJa55o1tNpspTDORznEH5n8hbcHYdpfCVakW4jEagbr0qCUwrT0mp4a52UeCSIcQ4iaMI9HvPjHKo4FOwduEc7m0LvFUN8fEvneIv9gGIsYwNkM2y3IBWSS1xkPIwybPden2VRcCmw9kDIjyuXgtph8lhT1joDIp5iR0MT2vdJ9vut7pcfpbrXxsMDKhfn3NxF~c5mKFecLrmk0ZZT~wCDOQsWEcjGuY0~3z0yQT5ecOM6i~uPnmO1Q9NPZkQXwf6~hIt~3yhjcxxjH4A6uWfZ-nHFWZDqiVbka1xNzw__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 32px; height: 36px;\" width=\"1024\" />&nbsp; on the top right of screen to open the &#39;Store Profile Type&#39; records filter.</p>\r\n\r\n<p>c) After the&nbsp;&#39;Store Profile Type&#39; filter opens on right side of screen, select the required filter selection from drop down&nbsp;like &#39;Regular&#39;&nbsp;and hit &#39;APPLY&#39; button.</p>\r\n\r\n<p><img height=\"376\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/154/image.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1LzE1NC9pbWFnZS5wbmciLCJDb25kaXRpb24iOnsiRGF0ZUxlc3NUaGFuIjp7IkFXUzpFcG9jaFRpbWUiOjE3NTQ3NTI1NzN9fX1dfQ__&Signature=DjZq2VFtb-2qjPpgtcEQ07G88XvN9BDWOluuYvOnbTRJm0xTk-6b1c5Xp-XQ3idkaxSLqYmFOZCI5ZA~SsvDgBk98t0CgoUm63l9611FbYxDk-bQuZhayL8QAEhNdTPHXxU7p-HpBVELNpg5ygxst7W74MFRQuxqK0nZRvVbax-6URDotB9HqTsqxp4Y-ejHyhiWZm7KBr1mOdYjmTHYI~0Ey7qc9N9ekAsr8lDmr8hDgkNO0-2p3Nle6lQAdu8aCdPgBSsd8HgV-liy-zEVKbtrkARjo-6rU-E0UPHOVTA3SaeH~6rmevdOf4rZIq0IWEFBnXHJR7UEnmJdeox87Q__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 819px; height: 301px;\" width=\"1024\" /></p>\r\n\r\n<p>d) This will display all the relevant records according to the filter applied.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 27995,
  "scraped_at": "2025-08-09T22:11:13.980871",
  "content_clean": "Home ››Administrator Tools››Master Data Guides››Master Data Guide - Omni ››Config UI Config UIs Store Configuration Override Store Configuration OverridePrerequisitesOrganization LevelStore Profile LevelLocation LevelBusiness ConfigurationOrganization LevelStore Profile Type LevelLocation LevelDeleting a ProfileGrid/Tile ViewMUP Configuration UIsPermissions Certain profile-based Store Fulfillment, Store Inventory and Point of Sale configuration can be overridden for a store or group of stores. Overrides are defined for a profile purpose, which is a functional grouping of one or more related configuration tables. Refer to the Master Data Guide for additional information for profile purposes. The three levels of hierarchical configuration are: Organization - This configuration level applies to all locations in the organization, unless an override has been created for the location. This is the default configuration level unless steps are taken to override the profile purpose at the store profile or location level. Store profile level - The store profile type allows a group of stores in an organization to share the same configuration for a profile purpose. For example, a retailer could create a store profile type for their outlet stores and define a fulfillment configuration that differs from their non-outlet stores. Store profile types are assigned to locations in the Location UI. Store profile type-level overrides are optional and must be manually configured. Location - This is the most specific level of configuration and applies only to the override store. Location-level overrides are optional and must be manually defined. If the configuration for a location is defined at multiple levels, the most specific configuration level is used. For example, assume an organization exists with 100 locations and the retailer would like a group of 3 pilot stores to enable functionality before other stores: Locations 1 - 100 reside in Organization A Locations 1-3 are pilot stores Locations 4-100 are non-pilot/regular stores The retailer creates a store profile type called \"Pilot\" and assigns locations 1-3 to that store profile type ID Since the retailer uses Store Fulfillment and Store Inventory, they create profile overrides for the Pilot store profile type for the related profile purposes (following the steps outlined in this document.) The store fulfillment and inventory configuration for stores 1, 2 and 3 is retrieved from the Pilot store profile type override, while the configuration for the remaining 97 stores falls back to the organization level values. Prerequisites Organization Level To maintain, configuration / master data at the organization level follow the below-mentioned steps. Navigate to the Provisioning Profiles UI Select the active Provisioning Profile for the current organization and click on view In the Edit Provisioning Profile UI, click on the Provisioning Profile Detail tab. The list of all the Profile Purposes is displayed Search for the required Profile Purpose for which you want to change or set the organization level profile Once a Profile Purpose is selected, you can either choose to copy / edit the configuration for the selected profile purpose. Copy – Can be used to copy the data from the existing profile that the profile purpose is associated to a new profile id Edit – Change the existing profile id and assign a new profile id to be used for the profile purpose Example: Let's say we want to create a new organization and assign a new profile id for the Store RFID configuration. In the provisioning profile UI, search for srf, a list of all the profile purposes for the store rfid component is listed. Click on the Edit pencil icon for the Profile Purpose Id srf::rfconfig In the popup, select the new profile id and click on save Store Profile Level To create a store profile type override for a group of locations, follow the below-mentioned steps. In the Locations UI, select a Store Profile Type Id for a location to associate that location with a Store Profile type. For example, if the same configuration must be set for all the outlet stores, then all the outlet stores can be assigned the Outlet Store Profile Type. Create a new profile id for the Store Profile Type Navigate to the Provisioning Profiles UI Select the active Provisioning Profile for the current organization and click on view In the Edit Provisioning Profile UI, click on the Provisioning Profile Detail tab. The list of all the Profile Purposes is displayed Click on Add On the following screen, select the profile purpose that needs to be maintained at the store profile type. For example, type and select srf::rfconfig Type the Store Profile Type Id, for example, Outlet Select the newly created profile id and click on save Example: Let’s say, we want to roll out the RFID features to only a few stores The locations for which rfid must be enabled can be set to the same Store Profile Type id. In the provisioning profile UI, click on Add Select the Profile purpose Id srf::rfconfig Enter the Store Profile Type Id Select the new profile id and click on save Location Level To maintain configuration or data at a location level, follow the below-mentioned steps. Create a new profile id for the location in the Profile UI Navigate to the Provisioning Profiles UI Select the active Provisioning Profile for the current organization and click on view In the Edit Provisioning Profile UI, click on the Provisioning Profile Detail tab The list of all the Profile Purposes is displayed Click on Add In the following screen, select the profile purpose that needs to be maintained at the store profile type. For example, type and select srf::rfconfig Type the location Id, for example Str-1045 Select the newly created profile id and click on save. Business Configuration Accessing and updating the configuration at the three levels: Organization - This option is shown on the config UI only if the user has set up the location level profile within the provisioning profile. Location - This option is shown on the config UI only if the user has set up the location level profile within the provisioning profile. Store Profile Type – This drop-down list is shown on the config UI only if the user has set up a profile for a location group (i.e., Store Profile Type), within a provisioning profile. Note: This section is displayed only if the conditions listed in the Prerequisites section below are met. Also, if you select the location level in the selection panel and navigate to another config UI page and then return to this page, the system remembers the selection. The default organization selection is displayed when you navigate to a page for the first time or when you navigate to a different application and then return to this page. Organization Level Users who have the required permission can change the configuration/master data for an entity at the organization level so that the configured data set can be used for a specific organization. Organization level data can be created, updated or deleted for location overridable entities. A warning message indicating the level of the managed dataset/profile is displayed. For example, when adding a record to the organization level profile, which is used by a specific store/location, the warning message “Configuration managed by organization: <organization>” is displayed and indicates the organization for which the data is configured. Users are warned about the level/profile when adding, editing or deleting related entities such as Carrier Package Types for a specific Carrier as well as performing these operations on the child entities. To create a specific configuration/master data for an entity at the organization level, perform the following steps: From the omnifacade or masterdatafacade config UI menu, select the menu option for the entity that you want to configure the organization-level data. By default, the Organization option is selected for the Manage Configuration for field. For example, enter Carriers in the search menu. All the carriers at the organization level are displayed. The organization-level data set for the selected entity is displayed. You can perform the following actions: Delete – Select the required option from the displayed data set. Tap Delete. Deletes the selected option and the organization-level profile data is updated. View – Select the required option from the displayed data set. Tap View. The Edit <entity> screen is displayed. Modify the attributes, if required, and tap Save. Add – Tap Add. The Add <entity> screen is displayed. The message “Configuration managed by organization: <organization name>” is displayed and indicates the organization for which the data is configured. Enter the attributes for the entity and tap Save. The configuration is saved at the organization level. Store Profile Type Level Users, who have the required permission, can change the store profile type level at which the configuration entity data is set up so that the configured data set can be used for a specific store profile type. Note: The Store Profile Type drop-down list is available only if the user has set up the provisioning profile at the store profile type level. To create a specific configuration/master data for an entity at the store profile type level, perform the following steps: From the omnifacade or masterdatafacade config UI menu, select the menu option for the entity that you want to configure the store profile type-level data. By default, the Organization option is selected for the Manage Configuration for field. Select the Store Profile Type option in the Manage Configuration for field and select an appropriate option from the drop-down list.  If the profile does not exist for the selected store profile type, then the message \"Data not found\" is displayed. The store profile type-level data set for the selected entity is displayed, if the specific store profile type exists. You can perform the following actions: Delete – Select the required option from the displayed data set. Tap Delete. Deletes the selected option and the store profile type level data is updated. View – Select the required option from the displayed data set. Tap View. The Edit <entity> screen is displayed. Modify the attributes, if required, and tap Save. The modifications made to the entity are saved. Add – Tap Add. The Add <entity> screen is displayed. The message “Configuration managed by store profile type: <store profile type name>” is displayed and indicates the store profile type for which the data is configured. Enter the attributes for the entity and tap Save. The configuration is saved at the store profile type level. Location Level Users, who have the required permission, can change the location level at which the configuration entity data is set up so that the configured data set can be used for a specific location. To create a specific configuration/master data for an entity at the location level, perform the following steps: From the omnifacade or masterdatafacade config UI menu, select the menu option for the entity that you want to configure the location-level data. By default, the Organization option is selected for the Manage Configuration for field. Select the Location option in the Manage Configuration for field and enter the required location ID in the Location option. If the profile does not exist for the selected location, then the message \"Data not found\" is displayed. The location-level data set for the selected entity is displayed, if the location specific profile exists. You can perform the following actions: Delete – Select the required option from the displayed data set. Tap Delete. Deletes the selected option and the location-level profile data is updated. View – Select the required option from the displayed data set. Tap View. The Edit <entity> screen is displayed. Modify the attributes, if required, and tap Save. Add – Tap Add. The Add <entity> screen is displayed. The message “Configuration managed by location: <location name>” is displayed and indicates the location for which the data is configured. Enter the attributes for the entity and tap Save. The configuration is saved at the location level. If the location specific profile does not exist and store profile type level exists for that location, then the data for that store profile type level is displayed. The message “This data is used by selected Organization.” is displayed. If neither the location specific nor store profile type level profile exists, then the message “Selected Location uses Organization level data” is displayed. Deleting a Profile Deleting a profile is possible only through the backend. This is not possible from the UI. Grid/Tile View For configuration entities that are displayed in auto-generated UIs, users can view the config data in a grid or tile format. The tile view is displayed as the default view, and can be changed to grid view if desired by the user. In both formats, 20 records are shown per page. Note - Sorting in grid mode is currently unavailable. MUP Configuration UIs Newer configuration UIs are created in the Manhattan UI platform (MUP). Menu links for these UIs exist in the Omni home page (omnifacade). Upon clicking the menu link, the UI opens in a  MUP facade browser tab where menu links for other MUP config UIs exist. Permissions Users must be given permissions to access MUP UIs and to perform granular actions once inside the UI. Wildcard permissions are supported (i.e., omui::*). Users are able to add access to different menus from MUP UI by using menu maintainence. Menu permissions Menu resources follow this pattern: omui::<component>::menu::<Entity> Examples: omui::fulfillment::menu::TransferType omui::storefacade::menu::storeRfidParameters omui::inventory::menu::smartSyncConfig omui::inventory::menu::reservationRequest Wildcard permissions are supported for MUP UI menu access (i.e., omui::fulfillment::menu::*) Action permissions Granular action level resources within a UI follow this pattern: omui::<component>::<Entity>::<Child Entity>::<Action> Resource ID Resource Description Scope of control omui::<component name>::<function>::details Example - omui::parcel::upgradedfacilityaccount::details Read access to config UI DETAILS button omui::{component name}::{function}::create Example - omui::parcel::upgradedfacilityaccount::create Allows you to create new records in the config UI CREATE button omui::{component name}::{function}::delete Example - omui::parcel::upgradedfacilityaccount::delete Allows you to delete records in the config UI DELETE button omui::{component name}::{function}::edit Example - omui::parcel::upgradedfacilityaccount::edit Allows you to edit records in the config UI EDIT button omui::{component name}::{function}::create Example - omui::inventory::smartsyncconfig::create Allows you to create new records in the smart sync config UI CREATE button omui::{component name}::{function}::edit Example - omui::inventory::smartsyncconfig::edit Allows you to edit records in the smart sync config UI EDIT button omui::{component name}::{function}::delete Example - omui::inventory::smartsyncconfig::delete Allows you to delete records in the smart sync config UI DELETE button omui::{component name}::{function}::create Example - omui::inventory::reservationrequest::create Allows you to create new records in the reservation request UI CREATE button omui::{component name}::{function}::create Example - omui::inventory::reservationrequest::edit Allows you to edit records in the reservation request UI EDIT button omui::{component name}::{function}::create Example - omui::inventory::reservationrequest::delete Allows you to delete records in the reservation request UI DELETE button Examples: Permissions for a granular action that contain a child entity are omui::storefacade::storeconfig::storeexceptions::add, omui::storefacade::storeconfig::storeexceptions::edit and omui::storefacade::storeconfig::storeexceptions::delete. Permissions for a granular action which do not contain a child entity is omui::fulfillment::transfertype::edit and omui::fulfillment::transfertype::delete. Wildcard permissions are supported for granular actions (i.e., omui::fulfillment::transfertype::*). Steps for viewing Records on 'Store Fulfillment Transfer Types' UI: a) Go to Omni> Manage Store Fulfillment Configuration> Store Fulfillment Transfer Types to open the 'Store Fulfillment Transfer Types' UI page. b) In 'Store Fulfillment Transfer Types'  UI click on 'Store-like' icon   on the top right of screen to open the 'Store Profile Type' records filter. c) After the 'Store Profile Type' filter opens on right side of screen, select the required filter selection from drop down like 'Regular' and hit 'APPLY' button. d) This will display all the relevant records according to the filter applied."
}