{
  "id": "2674494",
  "permalink": "cross-org-visibility",
  "title": "Cross-Organization Visibility",
  "type": "topic",
  "level": 4,
  "path": "Manhattan Active® Omni/Order Management/Process & Configuration Guides/Customer Service/Cross-Organization Visibility",
  "raw_item": {
    "id": "2674494",
    "text": "Cross-Organization Visibility",
    "title": "Cross-Organization Visibility",
    "permalink": "cross-org-visibility",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "129583",
    "parent": "f;129583",
    "created_date": "1607006534",
    "modified_date": "1747900983",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "9"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158820\" href=\"/customer-service\" class=\"breadcrumb-links\">Customer Service</a></li><li> <span>››</span>Cross-Organization Visibility</li></ul>  \t\r\n\t\t<h2>Cross-Organization Visibility</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/cross-org-visibility$overview\">Overview</a></li><li><a href=\"/cross-org-visibility$cross-org-order-visibility-in-the-customer-transactions-ui-in-contact-center\">Cross-Org Order Visibility in the Customer Transactions UI in Contact Center</a></li><li><a href=\"/cross-org-visibility$cross-org-order-visibility-in-the-customer-transactions-ui-in-customer-engagement\">Cross-Org Order Visibility in the Customer Transactions UI in Customer Engagement</a></li><li><a href=\"/cross-org-visibility$display-user-friendly-org-name-in-the-org-selection-drop-down\">Display User-Friendly Org Name in the Org Selection Drop-down</a></li><li><a href=\"/cross-org-visibility$cross-org-order-visibility-in-the-order-list-and-order-line-list\">Cross-Org Order Visibility in the Order List and Order Line List</a><ul><li><a href=\"/cross-org-visibility$cross-org-actions-in-the-order-list-and-order-line-list\">Cross-Org Actions in the Order List and Order Line List</a></li><li><a href=\"/cross-org-visibility$cross-org-filter-capabilities\">Cross-Org Filter Capabilities</a></li></ul></li><li><a href=\"/cross-org-visibility$how-cross-org-visibility-works\">How Cross-Org Visibility Works</a></li><li><a href=\"/cross-org-visibility$grants-resources\">Grants & Resources</a></li><li><a href=\"/cross-org-visibility$configuration\">Configuration</a></li><li><a href=\"/cross-org-visibility$feature-scope\">Feature Scope</a></li><li><a href=\"/cross-org-visibility$troubleshooting\">Troubleshooting</a><ul><li><a href=\"/cross-org-visibility$i-don-t-see-the-order-types-or-other-filter-data-in-the-dropdown-that-i-have-configured-for-the-child-orgs\">I don't see the Order Types (or other filter data) in the dropdown that I have configured for the child orgs</a></li><li><a href=\"/cross-org-visibility$i-m-not-able-to-view-nbsp-the-interaction-wrap-up-panel-in-customer-engagement-with-the-grants-added-only-at-the-child-level\">I'm not able to view&nbsp;the interaction wrap up panel in customer engagement with the grants added only at the child level</a></li><li><a href=\"/cross-org-visibility$case-configuration-is-throwing-permissions-error-after-switching-organization-to-child-org\">Case configuration is throwing permissions error after switching organization to child org</a></li></ul></li><li><a href=\"/cross-org-visibility$related-articles\">Related Articles</a></li></ul></div>\r\n\r\n<h3><a name=\"overview\" id=\"overview\"></a>Overview</h3>\r\n\r\n<p data-renderer-start-pos=\"11\">In multi-brand and multi-country organization hierarchies, Customer Service Representatives (CSRs) often have access to multiple organizations at different levels in the hierarchy. For example, an org hierarchy has levels:</p>\r\n\r\n<p><img height=\"255\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/image(9).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1L2ltYWdlKDkpLnBuZyIsIkNvbmRpdGlvbiI6eyJEYXRlTGVzc1RoYW4iOnsiQVdTOkVwb2NoVGltZSI6MTc1NDc1MTU5N319fV19&Signature=q93v78N0bOVxJayrKfniEZRNZEd9YDA1lPb8grOqdm4KF26v~b7r6zVpX3wK55KNitDe1ecRDbbNmLg3BT29YlcWAlSLdJ8TAjGEW60p7F-Xg5Y1qYj21YG68-F7ydy25YNzpRKZ6tIp~w5gFQ4SXb2a5IfUqNVS9HIyCk-RQm3lF8WIAFBbr0wW71WPaTJWmYElRFNk4TXVuI1dFf2HxTdYcIHf5FMu7d3M5Duixcpimppu~dQlQQWimHb-FveVHvtIpS1fS8iNF2zGGR0vjKJxri5dKGlYOcPpe5BBh3uf8MebhJRf4tvv0YOYvKtB90C~wOYid-loFASAz6bShA__&Key-Pair-Id=K2TK3EG287XSFC\" width=\"678\"></p>\r\n\r\n<p data-renderer-start-pos=\"280\">A CSR may be responsible for orders across multiple brands and countries. The Cross-Org Order Visibility feature enables CSRs to search, view, and edit orders across organizations on the Order List, Order Line List, and Customer Transactions UIs.</p>\r\n\r\n<p data-renderer-start-pos=\"532\">For example, a CSR responsible for orders in all European countries in Brand A and Brand B needs to search using Customer Email in the Order List, and that search should find orders in all relevant organizations, so the CSR does not need to ask the customer the country/brand in which the order was placed.</p>\r\n\r\n<p data-renderer-start-pos=\"841\">Another use case is for customers who place orders across multiple organizations, including customers who shop at stores in different countries or customers who shop across different brands. When CSRs view the Customer Transaction list, they can see the complete list of orders for a customer, even if they are placed in different orgs.</p>\r\n\r\n<p data-renderer-start-pos=\"841\">This feature is supported for 3-level organizational hierarchies (for example,&nbsp;Group &gt; Brand &gt; Country) as well as&nbsp;4-level organizational hierarchies (for example, Group &gt; Region &gt; Brand &gt; Country).</p>\r\n\r\n<h3 data-renderer-start-pos=\"6672\" id=\"Cross-Org-Order-Visibility-in-the-Customer-Transactions-UI\"><a name=\"cross-org-order-visibility-in-the-customer-transactions-ui-in-contact-center\" id=\"cross-org-order-visibility-in-the-customer-transactions-ui-in-contact-center\"></a>Cross-Org Order Visibility in the Customer Transactions UI in Contact Center</h3>\r\n\r\n<p data-renderer-start-pos=\"6732\">When cross-org visibility is enabled in the <a href=\"https://omni.helpdocsonline.com/call-center-configuration$view-orders-across-organizations\">Call Center Configuration UI</a>, users can view orders across multiple organizations. Users can proceed with actions such as view order status, return, and cancel.</p>\r\n\r\n<p data-renderer-start-pos=\"6732\">Once the user leaves the Customer Transactions UI, the context is set to a single organization, and the cross-org features are no longer available. For instance, if a user views orders for the UK, France, and Germany organizations on the Customer Transactions UI and then clicks 'View Order Status' for a UK order, the user's context is set to UK and all configurations and data are retrieved from the UK org's active profile. If the user leaves the Customer Transactions UI to search for an item and create an order while the Europe org is selected, configurations and data are loaded from the Europe org's active profile. This includes all contact center configurations, items displayed in the item search,&nbsp;locations displayed in the Store Locator popup, and so on.</p>\r\n\r\n<div class=\"info\" data-renderer-start-pos=\"6732\"><strong>Note: </strong>Any time a user navigates to the Home page within the Contact Center application, they are automatically switched to the parent organization. The intention of switching back to the parent org is for CSRs who service multiple child organizations and would want to search/view across those organizations when they return to the home page. Ensure users have sufficient customer service permission in the parent organization.</div>\r\n\r\n<div class=\"info\" data-renderer-start-pos=\"6732\"><strong>Note</strong>: when the user switches organizations, the selected organization&nbsp;details will not change in the session storage while&nbsp;changing the organization from home page and navigating to a different page&nbsp;that opens in any other window tab. The current behaviour from base is that the session storage&nbsp;will always load in the context of logged-in user's org and not the switched org.&nbsp;</div>\r\n\r\n<h3 data-renderer-start-pos=\"1179\"><a name=\"cross-org-order-visibility-in-the-customer-transactions-ui-in-customer-engagement\" id=\"cross-org-order-visibility-in-the-customer-transactions-ui-in-customer-engagement\"></a>Cross-Org Order Visibility in the Customer Transactions UI in Customer Engagement</h3>\r\n\r\n<p data-renderer-start-pos=\"6732\">When cross-org visibility is enabled in the <a href=\"https://omni.helpdocsonline.com/call-center-configuration$view-orders-across-organizations\">Call Center Configuration UI</a>, users can view orders across multiple organizations in the Customer Transactions UI in customer engagement. Users can proceed with actions such as view order status, return, and cancel.</p>\r\n\r\n<p data-renderer-start-pos=\"6732\">Once the user leaves the Customer Transactions UI, the context is set to a single organization, and the cross-org features are no longer available. For instance, if a user views orders for the UK, France, and Germany organizations on the Customer Transactions UI and then clicks 'View Order Status' for a UK order, the user's context is set to UK and all configurations and data are retrieved from the UK org's active profile.&nbsp;</p>\r\n\r\n<div class=\"info\" data-renderer-start-pos=\"6732\"><strong>Note</strong>:<br>\r\n• If you select the parent organization, you will be able to view all the transactions of the parent and child organization for the selected customer.<br>\r\n• If you select the child organization, you will be able to view only the transactions of the selected organization and not the parent organization.</div>\r\n\r\n<div class=\"info\" data-renderer-start-pos=\"6732\">Cross org visibility in the customer Engagement transaction list page is only supported for the actual transactions (orders) on the screen.&nbsp; The customer metrics section on top of the transactions page does not support cross org visibility.</div>\r\n\r\n<h3 data-test-id=\"title-text\" data-testid=\"title-text\" id=\"title-text\"><a name=\"display-user-friendly-org-name-in-the-org-selection-drop-down\" id=\"display-user-friendly-org-name-in-the-org-selection-drop-down\"></a><a id=\"org name org id\" name=\"org name org id\"></a>Display User-Friendly Org Name in the Org Selection Drop-down</h3>\r\n\r\n<p>Users can&nbsp;view a user-friendly version of the organization Id in the org selection drop-down within the contact center and customer engagement pages.&nbsp;</p>\r\n\r\n<p>This is enabled by the&nbsp;“Display Organization Name in the organization selection dropdown“ configuration in the call center configuration.&nbsp;</p>\r\n\r\n<div class=\"tip\">\r\n<p><strong>Note</strong>:</p>\r\n\r\n<ol>\r\n\t<li>If this config attribute is enabled and the organization name is null for an organization, then instead of showing a blank row,&nbsp;the org selection drop-down will show the organization ID instead.&nbsp;</li>\r\n\t<li>If this configuration is enabled in the parent organization, then it will not automatically show the org name for the child organizations in the organization selection drop-down.&nbsp;</li>\r\n</ol>\r\n</div>\r\n\r\n<div class=\"warning\" data-renderer-start-pos=\"1179\">Displaying organization name instead of the organization ID is only supported in the contact center and customer engagement pages.&nbsp;</div>\r\n\r\n<h3 data-renderer-start-pos=\"1179\"><a name=\"cross-org-order-visibility-in-the-order-list-and-order-line-list\" id=\"cross-org-order-visibility-in-the-order-list-and-order-line-list\"></a>Cross-Org Order Visibility in the Order List and Order Line List</h3>\r\n\r\n<p data-renderer-start-pos=\"1245\">When cross-org visibility is enabled in the Order List and Order Line List UIs, users will see a few changes:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"1358\">An ‘Organization' filter field is displayed in the search criteria.</li>\r\n\t<li data-renderer-start-pos=\"1429\">An ‘Organization' column field is displayed in the results list.</li>\r\n\t<li data-renderer-start-pos=\"1497\">Order and order line search results are returned for multiple organizations.</li>\r\n</ul>\r\n\r\n<p data-renderer-start-pos=\"1577\">The organization column in the results list shows the organization to which each order belongs. Users can sort using the organization column.</p>\r\n\r\n<p data-renderer-start-pos=\"1720\">The organization filter displays the list of organizations based on the intersection of:</p>\r\n\r\n<ol>\r\n\t<li data-renderer-start-pos=\"1812\">Organizations the user has access to, per the Org User list defined in the User &gt; Org User UI</li>\r\n\t<li data-renderer-start-pos=\"1909\">The organization currently selected in the top right corner of the UI and all its children, grandchildren, and so on.</li>\r\n</ol>\r\n\r\n<p data-renderer-start-pos=\"2024\">The list of organizations in this filter refreshes each time the user selects a different organization in the top right dropdown. The organization filter dropdown displays \"organization id: organization name\" if organization name is not null. If organization name is null, the filter dropdown displays \"organization id.\" The values in this dropdown are sorted alphabetically.</p>\r\n\r\n<p data-renderer-start-pos=\"2024\">The organization filter can be used in saved filters.&nbsp;Saved filters are specific to a single&nbsp;organization. Only the filters saved for the currently-selected organization are displayed. If a saved filter is required in multiple organizations, then it must be duplicated in each organization.</p>\r\n\r\n<div class=\"tip\" data-renderer-start-pos=\"2024\"><strong>Note</strong>: Switching organizations clears filter selections and the results list. If switching organizations while using the same filter, consider creating&nbsp;a saved filter in each organization.</div>\r\n\r\n<div class=\"info\" data-renderer-start-pos=\"2024\"><strong>Note</strong>: The Retain search criteria in the filter panel enables you to retain search criteria when switching organizations. However, this depends on the View Order Across Organizations check box on the List UI Configuration. The retain search filter will retain search criteria across organizations, only if View Order Across Organizations is selected for the current org as well as all the organizations that the user has access to.</div>\r\n\r\n<div class=\"warning\" data-renderer-start-pos=\"2024\">\r\n<p>The retain search filter will behave unexpectedly if View Order Across Organizations is selected/unselected (mixed configurations) for the current org as well as all the organizations that the user has access to.</p>\r\n</div>\r\n\r\n<h4 data-renderer-start-pos=\"2155\" id=\"Cross-Org-Actions-in-the-Order-List-and-Order-Line-List\"><a name=\"cross-org-actions-in-the-order-list-and-order-line-list\" id=\"cross-org-actions-in-the-order-list-and-order-line-list\"></a>Cross-Org Actions in the Order List and Order Line List</h4>\r\n\r\n<p data-renderer-start-pos=\"2212\">When cross-org visibility is enabled, only single select actions are available. If a user selects multiple orders, then actions are disabled. A tooltip appears if a user hovers over the disabled buttons.</p>\r\n\r\n<div class=\"info\" data-renderer-start-pos=\"2418\"><strong>Note</strong>: Currently, multi-select actions are not supported on the Order List and Order Line List UIs when cross-org visibility is enabled. Users must single-select orders to perform actions including send order status, cancel, hold, un-hold, allocate, and release.</div>\r\n\r\n<h4 data-renderer-start-pos=\"2675\" id=\"Cross-Org-Filter-Capabilities\"><a name=\"cross-org-filter-capabilities\" id=\"cross-org-filter-capabilities\"></a>Cross-Org Filter Capabilities</h4>\r\n\r\n<p data-renderer-start-pos=\"2706\">Filtering using configuration data such as users, order types, and reason codes cannot be easily retrieved for a list of organizations and thus has some limitations. These profile-based entities differ from transactional entities like orders and locations which have orgId stamped on the entity, which can be retrieved using a GET call across a list of orgs.</p>\r\n\r\n<p data-renderer-start-pos=\"3067\">To use these configuration-based filters, you must maintain data at the parent level/level of the current org selection. This can be done in a few ways:</p>\r\n\r\n<ol>\r\n\t<li data-renderer-start-pos=\"3223\">Maintain the data/profile at the parent level (for example,&nbsp;Europe org owns the order type profile, and France and Italy orgs share the order type profile data from the parent)</li>\r\n\t<li data-renderer-start-pos=\"3395\">Maintain two copies of data at the parent and child level (for example, if France has order types A and B and Italy has order types C and D, then a copy of these order types must be maintained for the Europe org - A, B, C, and D)</li>\r\n</ol>\r\n\r\n<p data-renderer-start-pos=\"3620\">For example, if a retailer has the following org structure: Group &gt; Brand &gt; Country. If the Order Type profile is maintained at the country level, then:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"3776\">If the org selected in the top right Organization dropdown is ‘Group’, then the list of order types cannot be retrieved from the country organizations. The list of order types needs to be duplicated for the Group org’s profile in order to view them when ‘Group’ is selected.</li>\r\n\t<li data-renderer-start-pos=\"4050\">If the org selected in the top right Organization dropdown is ‘Brand’, then the list of order types cannot be retrieved from the country organizations. The list of order types needs to be duplicated for the Brand org’s profile in order to view them when ‘Brand’ is selected.</li>\r\n</ul>\r\n\r\n<p data-renderer-start-pos=\"4324\">If data is already maintained at the highest level/current org selection, then no change in configuration is needed. For example, if the Order Type profile is maintained at the Group level and shared for all Brands and Countries, then:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"4563\">If the org selected is ‘Group’, the list of order types can be retrieved.</li>\r\n\t<li data-renderer-start-pos=\"4639\">If the org selected is a Brand, the list of order types can be retrieved, because data is pulled from the active profile for the Brand org, which is maintained at the Group level</li>\r\n\t<li data-renderer-start-pos=\"4821\">If the org selected is a Country, the list of order types can be retrieved, because data is pulled from the active profile for the Country org, which is maintained at the Group level</li>\r\n</ul>\r\n\r\n<p data-renderer-start-pos=\"5007\">If data is maintained at a lower level and needs to be duplicated for CSRs to view it at higher-level orgs, there may be scenarios where middle-level orgs will not be used for filtering. For example, if the Order Type profile is maintained at the country level, then:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"5278\">If CSRs need to select ‘Group’ or ‘Brand’ from the organization dropdown to view orders across all child orgs of the Group or Brand, then the list of order types needs to be duplicated for the Group and the Brand. This can be done by duplicating the order types at the Group level and sharing the profile at the Brand level.</li>\r\n\t<li data-renderer-start-pos=\"5606\">If CSRs need to select ‘Group’ from the organization dropdown but do not need to select ‘Brand’, then the list of order types needs to be duplicated for the Group but not for the Brand. This can be done by duplicating the order types at the group level.</li>\r\n</ul>\r\n\r\n<p data-renderer-start-pos=\"5863\">Data must be managed this way for the following profile-based entities:</p>\r\n\r\n<table data-number-column=\"false\" style=\"width: 522px;\">\r\n\t<colgroup>\r\n\t\t<col>\r\n\t\t<col>\r\n\t</colgroup>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"1\" data-colwidth=\"272\" rowspan=\"1\">\r\n\t\t\t<p data-renderer-start-pos=\"5939\"><strong data-renderer-mark=\"true\">Data/Entity</strong></p>\r\n\t\t\t</th>\r\n\t\t\t<th colspan=\"1\" data-colwidth=\"489\" rowspan=\"1\" style=\"width: 361px;\">\r\n\t\t\t<p data-renderer-start-pos=\"5954\"><strong data-renderer-mark=\"true\">Filter/Action Button where it’s used</strong></p>\r\n\t\t\t</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"272\" rowspan=\"1\">\r\n\t\t\t<p data-renderer-start-pos=\"5996\">Order type</p>\r\n\t\t\t</td>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"489\" rowspan=\"1\" style=\"width: 358px;\">\r\n\t\t\t<ul data-indent-level=\"1\">\r\n\t\t\t\t<li>\r\n\t\t\t\t<p data-renderer-start-pos=\"6012\">Order type filter</p>\r\n\t\t\t\t</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"272\" rowspan=\"1\">\r\n\t\t\t<p data-renderer-start-pos=\"6037\">Users</p>\r\n\t\t\t</td>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"489\" rowspan=\"1\" style=\"width: 358px;\">\r\n\t\t\t<ul>\r\n\t\t\t\t<li data-renderer-start-pos=\"6048\">Entered By filter</li>\r\n\t\t\t\t<li data-renderer-start-pos=\"6069\">Created By filter</li>\r\n\t\t\t\t<li data-renderer-start-pos=\"6090\">Last Updated By filter</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"272\" rowspan=\"1\">\r\n\t\t\t<p data-renderer-start-pos=\"6120\">Hold type</p>\r\n\t\t\t</td>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"489\" rowspan=\"1\" style=\"width: 358px;\">\r\n\t\t\t<ul>\r\n\t\t\t\t<li data-renderer-start-pos=\"6135\">Hold type filter</li>\r\n\t\t\t\t<li data-renderer-start-pos=\"6155\">Hold action button</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"272\" rowspan=\"1\">\r\n\t\t\t<p data-renderer-start-pos=\"6181\">Hold resolve reason</p>\r\n\t\t\t</td>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"489\" rowspan=\"1\" style=\"width: 358px;\">\r\n\t\t\t<ul data-indent-level=\"1\">\r\n\t\t\t\t<li>\r\n\t\t\t\t<p data-renderer-start-pos=\"6206\">Unhold action button</p>\r\n\t\t\t\t</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"272\" rowspan=\"1\">\r\n\t\t\t<p data-renderer-start-pos=\"6234\">Cancel reason code</p>\r\n\t\t\t</td>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"489\" rowspan=\"1\" style=\"width: 358px;\">\r\n\t\t\t<ul>\r\n\t\t\t\t<li data-renderer-start-pos=\"6258\">Cancel reason code filter (order)</li>\r\n\t\t\t\t<li data-renderer-start-pos=\"6295\">Cancel order action button</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"272\" rowspan=\"1\">\r\n\t\t\t<p data-renderer-start-pos=\"6329\">Cancel line reason code</p>\r\n\t\t\t</td>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"489\" rowspan=\"1\" style=\"width: 358px;\">\r\n\t\t\t<ul>\r\n\t\t\t\t<li data-renderer-start-pos=\"6358\">Cancel order line action button</li>\r\n\t\t\t\t<li data-renderer-start-pos=\"6393\">Cancel reason code filter (line)</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"272\" rowspan=\"1\">\r\n\t\t\t<p data-renderer-start-pos=\"6433\">Line type</p>\r\n\t\t\t</td>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"489\" rowspan=\"1\" style=\"width: 358px;\">\r\n\t\t\t<ul data-indent-level=\"1\">\r\n\t\t\t\t<li>\r\n\t\t\t\t<p data-renderer-start-pos=\"6448\">Line type filter (line)</p>\r\n\t\t\t\t</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"272\" rowspan=\"1\">\r\n\t\t\t<p data-renderer-start-pos=\"6479\">Order status</p>\r\n\t\t\t</td>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"489\" rowspan=\"1\" style=\"width: 358px;\">\r\n\t\t\t<ul>\r\n\t\t\t\t<li data-renderer-start-pos=\"6497\">Order status</li>\r\n\t\t\t\t<li data-renderer-start-pos=\"6513\">Line status</li>\r\n\t\t\t\t<li data-renderer-start-pos=\"6528\">Return status</li>\r\n\t\t\t\t<li data-renderer-start-pos=\"6545\">Order line min status</li>\r\n\t\t\t\t<li data-renderer-start-pos=\"6570\">Order line max status</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"272\" rowspan=\"1\">\r\n\t\t\t<p data-renderer-start-pos=\"6599\">Selling channel</p>\r\n\t\t\t</td>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"489\" rowspan=\"1\" style=\"width: 358px;\">\r\n\t\t\t<ul data-indent-level=\"1\">\r\n\t\t\t\t<li>\r\n\t\t\t\t<p data-renderer-start-pos=\"6620\">Entry type filter</p>\r\n\t\t\t\t</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"272\" rowspan=\"1\">\r\n\t\t\t<p data-renderer-start-pos=\"6645\">Tags</p>\r\n\t\t\t</td>\r\n\t\t\t<td colspan=\"1\" data-colwidth=\"489\" rowspan=\"1\" style=\"width: 358px;\">\r\n\t\t\t<ul data-indent-level=\"1\">\r\n\t\t\t\t<li>\r\n\t\t\t\t<p data-renderer-start-pos=\"6655\">Tag filter</p>\r\n\t\t\t\t</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3 data-renderer-start-pos=\"6934\" id=\"How-Cross-Org-Visibility-Works\"><a name=\"how-cross-org-visibility-works\" id=\"how-cross-org-visibility-works\"></a>How Cross-Org Visibility Works</h3>\r\n\r\n<p data-renderer-start-pos=\"6966\">The Cross-Org Order Visibility feature enables CSRs to search for, view, and edit orders across organizations, specifically the intersection of:</p>\r\n\r\n<ol>\r\n\t<li data-renderer-start-pos=\"7114\">Organizations the user has access to, per the Org User list defined in the User &gt; Org User UI</li>\r\n\t<li data-renderer-start-pos=\"7211\">The organization currently selected in the top right corner of the UI and all its children, grandchildren, and so on.</li>\r\n</ol>\r\n\r\n<p data-renderer-start-pos=\"7326\">The application takes this list of organizations and sends it in the API request for each relevant action. For example, without this feature, if a user is logged into the Group org and is searching orders on the Order List, the application sends Group org in the search orders API, which would only retrieve orders with Group org stamped on them. With this feature enabled, the application sends a list of orgs such as (Group, Brand A, Brand A - UK, Brand B, Brand B - UK) in the API request, so that the user can view a result list across multiple organizations.</p>\r\n\r\n<p data-renderer-start-pos=\"7891\">For example, a user Linda has access to Org Users:</p>\r\n\r\n<ul data-indent-level=\"1\">\r\n\t<li data-renderer-start-pos=\"7945\">Group</li>\r\n\t<li data-renderer-start-pos=\"7954\">Brand A</li>\r\n\t<li data-renderer-start-pos=\"7965\">Brand A - UK</li>\r\n\t<li data-renderer-start-pos=\"7981\">Brand A - France</li>\r\n\t<li data-renderer-start-pos=\"8001\">Brand B</li>\r\n\t<li data-renderer-start-pos=\"8012\">Brand B - UK</li>\r\n\t<li data-renderer-start-pos=\"8028\">Brand B - France</li>\r\n</ul>\r\n\r\n<p>Then, if Linda selects the Group org in the top right dropdown in the Order List UI, she will see orders for the following organizations:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"8188\">Group</li>\r\n\t<li data-renderer-start-pos=\"8197\">Brand A</li>\r\n\t<li data-renderer-start-pos=\"8208\">Brand A - UK</li>\r\n\t<li data-renderer-start-pos=\"8224\">Brand A - France</li>\r\n\t<li data-renderer-start-pos=\"8244\">Brand B</li>\r\n\t<li data-renderer-start-pos=\"8255\">Brand B - UK</li>\r\n\t<li data-renderer-start-pos=\"8271\">Brand B - France</li>\r\n</ul>\r\n\r\n<p data-renderer-start-pos=\"8291\">If Linda selects the Brand B org in the top right dropdown in the Order List UI, she will see orders for the following organizations:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"8428\">Brand B</li>\r\n\t<li data-renderer-start-pos=\"8439\">Brand B - UK</li>\r\n\t<li data-renderer-start-pos=\"8455\">Brand B - France</li>\r\n</ul>\r\n\r\n<p data-renderer-start-pos=\"8475\">If a different user Dominic has access to Org Users:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"8531\">Group</li>\r\n\t<li data-renderer-start-pos=\"8540\">Brand A</li>\r\n\t<li data-renderer-start-pos=\"8551\">Brand A - France</li>\r\n\t<li data-renderer-start-pos=\"8571\">Brand B</li>\r\n\t<li data-renderer-start-pos=\"8582\">Brand B - France</li>\r\n</ul>\r\n\r\n<p data-renderer-start-pos=\"8602\">Then, if Dominic selects the Group org in the top right dropdown in the Order List UI, he will see orders for the following organizations:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"8743\">Group</li>\r\n\t<li data-renderer-start-pos=\"8752\">Brand A</li>\r\n\t<li data-renderer-start-pos=\"8763\">Brand A - France</li>\r\n\t<li data-renderer-start-pos=\"8783\">Brand B</li>\r\n\t<li data-renderer-start-pos=\"8794\">Brand B - France</li>\r\n</ul>\r\n\r\n<p data-renderer-start-pos=\"8814\">If Dominic selects the Brand B org in the top right dropdown in the Order List UI, he will see orders for the following organizations:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"8952\">Brand B</li>\r\n\t<li data-renderer-start-pos=\"8963\">Brand B - France</li>\r\n</ul>\r\n\r\n<h3><a name=\"grants-resources\" id=\"grants-resources\"></a>Grants & Resources</h3>\r\n\r\n<p data-renderer-start-pos=\"8984\">There is no specific grant to enable a user to view orders across organizations. For a user to view orders across organizations:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"8984\">The 'View Orders Across Organizations' configuration (see below) should be enabled</li>\r\n\t<li data-renderer-start-pos=\"8984\">The user should have access to the relevant organizations in the User &gt; Org User UI</li>\r\n</ul>\r\n\r\n<p data-renderer-start-pos=\"8984\">&nbsp;</p>\r\n\r\n<h3 data-renderer-start-pos=\"9139\" id=\"Configuration\"><a name=\"configuration\" id=\"configuration\"></a><a id=\"Cross-Org Visibility config\" name=\"Cross-Org Visibility config\"></a>Configuration</h3>\r\n\r\n<p data-renderer-start-pos=\"9154\">There are two configurations to enable cross-org visibility:</p>\r\n\r\n<ol>\r\n\t<li data-renderer-start-pos=\"9218\"><strong data-renderer-mark=\"true\">Call Center Configuration &gt; View Orders Across Organizations</strong>: If enabled, this allows users to view orders across the organizations in the customer service UIs, including Customer Transactions, Create/Edit Order, View Order Status, and so on.</li>\r\n\t<li data-renderer-start-pos=\"9458\"><strong data-renderer-mark=\"true\">List UI Configuration &gt; View Orders Across Organizations</strong>: If enabled, this allows users to view orders across the organizations in the Order List and Order Line List UIs.</li>\r\n</ol>\r\n\r\n<p data-renderer-start-pos=\"9632\">These two configurations work independently of each other.</p>\r\n\r\n<div class=\"info\" data-renderer-start-pos=\"9632\"><strong>Note</strong>: If cross-org visibility is enabled, these&nbsp;configurations must be enabled in all organizations in the hierarchy.</div>\r\n\r\n<h3 data-renderer-start-pos=\"9632\"><a name=\"feature-scope\" id=\"feature-scope\"></a>Feature Scope</h3>\r\n\r\n<p data-renderer-start-pos=\"9632\">The following features are not supported:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"9632\">Multi-select actions&nbsp;on the Order List and Order Line List UIs when cross-org visibility is enabled. Users must single select orders to perform actions including send order status, cancel, hold, un-hold, allocate, and release.</li>\r\n\t<li data-renderer-start-pos=\"9632\">Viewing store locations across organizations in the Store Locator in the contact center UI.</li>\r\n\t<li data-renderer-start-pos=\"9632\">Searching across organizations using the Order Search box in the customer service UI. The Order Search box currently only supports the selected org. For example, a user wants to search across parent and child orgs, they cannot use the order search box. The Customer Transactions UI can be used as a workaround.</li>\r\n</ul>\r\n\r\n<h3><a name=\"troubleshooting\" id=\"troubleshooting\"></a>Troubleshooting</h3>\r\n\r\n<h4><a name=\"i-don-t-see-the-order-types-or-other-filter-data-in-the-dropdown-that-i-have-configured-for-the-child-orgs\" id=\"i-don-t-see-the-order-types-or-other-filter-data-in-the-dropdown-that-i-have-configured-for-the-child-orgs\"></a>I don't see the Order Types (or other filter data) in the dropdown that I have configured for the child orgs</h4>\r\n\r\n<p>Profile-based data (order type, users, and so on - see full list above) is only displayed for the currently-selected org. So, if the top right org dropdown has the parent org selected, then only the data configured for the parent org is displayed. Follow the instructions above to manage your data in a way that will work with this feature.</p>\r\n\r\n<h4><a name=\"i-m-not-able-to-view-nbsp-the-interaction-wrap-up-panel-in-customer-engagement-with-the-grants-added-only-at-the-child-level\" id=\"i-m-not-able-to-view-nbsp-the-interaction-wrap-up-panel-in-customer-engagement-with-the-grants-added-only-at-the-child-level\"></a>I'm not able to view&nbsp;the interaction wrap up panel in customer engagement with the grants added only at the child level</h4>\r\n\r\n<p>The cross org functionality for interaction panel in customer engagement works only when the grants are added at both the parent and child level.&nbsp;</p>\r\n\r\n<h4><a name=\"case-configuration-is-throwing-permissions-error-after-switching-organization-to-child-org\" id=\"case-configuration-is-throwing-permissions-error-after-switching-organization-to-child-org\"></a>Case configuration is throwing permissions error after switching organization to child org</h4>\r\n\r\n<p>The cross org functionality&nbsp;works only when the grants are added at both the parent and child level.&nbsp;</p>\r\n\r\n<h3><a name=\"related-articles\" id=\"related-articles\"></a>Related Articles</h3>\r\n\r\n<div class=\"info\"><ul class=\"related-articles\"><li><a href=\"/itemsearch\" hqid=\"2781976\">Item Search</a></li><li><a href=\"/order-status-inquiry\" hqid=\"2781980\">Order Status Inquiry</a></li><li><a href=\"/transactional-emails\" hqid=\"2444800\">Transactional Emails</a></li><li><a href=\"/call-centerconfiguration\" hqid=\"1805028\">Call Center Configuration</a></li><li><a href=\"/customer-service-insights-dashboard\" hqid=\"3574352\">Customer Service Insights Dashboard</a></li><li><a href=\"/customer-service-ui-resources\" hqid=\"2604082\">UI Resources</a></li><li><a href=\"/kits-in-call-center\" hqid=\"3631688\">Kits in Call Center</a></li><li><a href=\"/returns-and-exchanges-in-contact-center\" hqid=\"2781984\">Returns and Exchanges</a></li><li><a href=\"/overview\" hqid=\"2778910\">Overview and Navigation</a></li><li><a href=\"/order-modifications\" hqid=\"2786252\">Order Modifications</a></li><li><a href=\"/transactional-texts\" hqid=\"2607998\">Transactional Texts</a></li><li><a href=\"/cs_troubleshooting\" hqid=\"2803411\">Troubleshooting </a></li></ul></div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 33474,
  "scraped_at": "2025-08-09T21:54:58.062303",
  "content_clean": "Home ››Manhattan Active® Omni››Order Management››Process & Configuration Guides››Customer Service ››Cross-Organization Visibility Cross-Organization Visibility OverviewCross-Org Order Visibility in the Customer Transactions UI in Contact CenterCross-Org Order Visibility in the Customer Transactions UI in Customer EngagementDisplay User-Friendly Org Name in the Org Selection Drop-downCross-Org Order Visibility in the Order List and Order Line ListCross-Org Actions in the Order List and Order Line ListCross-Org Filter CapabilitiesHow Cross-Org Visibility WorksGrants & ResourcesConfigurationFeature ScopeTroubleshootingI don't see the Order Types (or other filter data) in the dropdown that I have configured for the child orgsI'm not able to view the interaction wrap up panel in customer engagement with the grants added only at the child levelCase configuration is throwing permissions error after switching organization to child orgRelated Articles Overview In multi-brand and multi-country organization hierarchies, Customer Service Representatives (CSRs) often have access to multiple organizations at different levels in the hierarchy. For example, an org hierarchy has levels: A CSR may be responsible for orders across multiple brands and countries. The Cross-Org Order Visibility feature enables CSRs to search, view, and edit orders across organizations on the Order List, Order Line List, and Customer Transactions UIs. For example, a CSR responsible for orders in all European countries in Brand A and Brand B needs to search using Customer Email in the Order List, and that search should find orders in all relevant organizations, so the CSR does not need to ask the customer the country/brand in which the order was placed. Another use case is for customers who place orders across multiple organizations, including customers who shop at stores in different countries or customers who shop across different brands. When CSRs view the Customer Transaction list, they can see the complete list of orders for a customer, even if they are placed in different orgs. This feature is supported for 3-level organizational hierarchies (for example, Group > Brand > Country) as well as 4-level organizational hierarchies (for example, Group > Region > Brand > Country). Cross-Org Order Visibility in the Customer Transactions UI in Contact Center When cross-org visibility is enabled in the Call Center Configuration UI, users can view orders across multiple organizations. Users can proceed with actions such as view order status, return, and cancel. Once the user leaves the Customer Transactions UI, the context is set to a single organization, and the cross-org features are no longer available. For instance, if a user views orders for the UK, France, and Germany organizations on the Customer Transactions UI and then clicks 'View Order Status' for a UK order, the user's context is set to UK and all configurations and data are retrieved from the UK org's active profile. If the user leaves the Customer Transactions UI to search for an item and create an order while the Europe org is selected, configurations and data are loaded from the Europe org's active profile. This includes all contact center configurations, items displayed in the item search, locations displayed in the Store Locator popup, and so on. Note: Any time a user navigates to the Home page within the Contact Center application, they are automatically switched to the parent organization. The intention of switching back to the parent org is for CSRs who service multiple child organizations and would want to search/view across those organizations when they return to the home page. Ensure users have sufficient customer service permission in the parent organization. Note: when the user switches organizations, the selected organization details will not change in the session storage while changing the organization from home page and navigating to a different page that opens in any other window tab. The current behaviour from base is that the session storage will always load in the context of logged-in user's org and not the switched org. Cross-Org Order Visibility in the Customer Transactions UI in Customer Engagement When cross-org visibility is enabled in the Call Center Configuration UI, users can view orders across multiple organizations in the Customer Transactions UI in customer engagement. Users can proceed with actions such as view order status, return, and cancel. Once the user leaves the Customer Transactions UI, the context is set to a single organization, and the cross-org features are no longer available. For instance, if a user views orders for the UK, France, and Germany organizations on the Customer Transactions UI and then clicks 'View Order Status' for a UK order, the user's context is set to UK and all configurations and data are retrieved from the UK org's active profile. Note: • If you select the parent organization, you will be able to view all the transactions of the parent and child organization for the selected customer. • If you select the child organization, you will be able to view only the transactions of the selected organization and not the parent organization. Cross org visibility in the customer Engagement transaction list page is only supported for the actual transactions (orders) on the screen.  The customer metrics section on top of the transactions page does not support cross org visibility. Display User-Friendly Org Name in the Org Selection Drop-down Users can view a user-friendly version of the organization Id in the org selection drop-down within the contact center and customer engagement pages. This is enabled by the “Display Organization Name in the organization selection dropdown“ configuration in the call center configuration. Note: If this config attribute is enabled and the organization name is null for an organization, then instead of showing a blank row, the org selection drop-down will show the organization ID instead. If this configuration is enabled in the parent organization, then it will not automatically show the org name for the child organizations in the organization selection drop-down. Displaying organization name instead of the organization ID is only supported in the contact center and customer engagement pages. Cross-Org Order Visibility in the Order List and Order Line List When cross-org visibility is enabled in the Order List and Order Line List UIs, users will see a few changes: An ‘Organization' filter field is displayed in the search criteria. An ‘Organization' column field is displayed in the results list. Order and order line search results are returned for multiple organizations. The organization column in the results list shows the organization to which each order belongs. Users can sort using the organization column. The organization filter displays the list of organizations based on the intersection of: Organizations the user has access to, per the Org User list defined in the User > Org User UI The organization currently selected in the top right corner of the UI and all its children, grandchildren, and so on. The list of organizations in this filter refreshes each time the user selects a different organization in the top right dropdown. The organization filter dropdown displays \"organization id: organization name\" if organization name is not null. If organization name is null, the filter dropdown displays \"organization id.\" The values in this dropdown are sorted alphabetically. The organization filter can be used in saved filters. Saved filters are specific to a single organization. Only the filters saved for the currently-selected organization are displayed. If a saved filter is required in multiple organizations, then it must be duplicated in each organization. Note: Switching organizations clears filter selections and the results list. If switching organizations while using the same filter, consider creating a saved filter in each organization. Note: The Retain search criteria in the filter panel enables you to retain search criteria when switching organizations. However, this depends on the View Order Across Organizations check box on the List UI Configuration. The retain search filter will retain search criteria across organizations, only if View Order Across Organizations is selected for the current org as well as all the organizations that the user has access to. The retain search filter will behave unexpectedly if View Order Across Organizations is selected/unselected (mixed configurations) for the current org as well as all the organizations that the user has access to. Cross-Org Actions in the Order List and Order Line List When cross-org visibility is enabled, only single select actions are available. If a user selects multiple orders, then actions are disabled. A tooltip appears if a user hovers over the disabled buttons. Note: Currently, multi-select actions are not supported on the Order List and Order Line List UIs when cross-org visibility is enabled. Users must single-select orders to perform actions including send order status, cancel, hold, un-hold, allocate, and release. Cross-Org Filter Capabilities Filtering using configuration data such as users, order types, and reason codes cannot be easily retrieved for a list of organizations and thus has some limitations. These profile-based entities differ from transactional entities like orders and locations which have orgId stamped on the entity, which can be retrieved using a GET call across a list of orgs. To use these configuration-based filters, you must maintain data at the parent level/level of the current org selection. This can be done in a few ways: Maintain the data/profile at the parent level (for example, Europe org owns the order type profile, and France and Italy orgs share the order type profile data from the parent) Maintain two copies of data at the parent and child level (for example, if France has order types A and B and Italy has order types C and D, then a copy of these order types must be maintained for the Europe org - A, B, C, and D) For example, if a retailer has the following org structure: Group > Brand > Country. If the Order Type profile is maintained at the country level, then: If the org selected in the top right Organization dropdown is ‘Group’, then the list of order types cannot be retrieved from the country organizations. The list of order types needs to be duplicated for the Group org’s profile in order to view them when ‘Group’ is selected. If the org selected in the top right Organization dropdown is ‘Brand’, then the list of order types cannot be retrieved from the country organizations. The list of order types needs to be duplicated for the Brand org’s profile in order to view them when ‘Brand’ is selected. If data is already maintained at the highest level/current org selection, then no change in configuration is needed. For example, if the Order Type profile is maintained at the Group level and shared for all Brands and Countries, then: If the org selected is ‘Group’, the list of order types can be retrieved. If the org selected is a Brand, the list of order types can be retrieved, because data is pulled from the active profile for the Brand org, which is maintained at the Group level If the org selected is a Country, the list of order types can be retrieved, because data is pulled from the active profile for the Country org, which is maintained at the Group level If data is maintained at a lower level and needs to be duplicated for CSRs to view it at higher-level orgs, there may be scenarios where middle-level orgs will not be used for filtering. For example, if the Order Type profile is maintained at the country level, then: If CSRs need to select ‘Group’ or ‘Brand’ from the organization dropdown to view orders across all child orgs of the Group or Brand, then the list of order types needs to be duplicated for the Group and the Brand. This can be done by duplicating the order types at the Group level and sharing the profile at the Brand level. If CSRs need to select ‘Group’ from the organization dropdown but do not need to select ‘Brand’, then the list of order types needs to be duplicated for the Group but not for the Brand. This can be done by duplicating the order types at the group level. Data must be managed this way for the following profile-based entities: Data/Entity Filter/Action Button where it’s used Order type Order type filter Users Entered By filter Created By filter Last Updated By filter Hold type Hold type filter Hold action button Hold resolve reason Unhold action button Cancel reason code Cancel reason code filter (order) Cancel order action button Cancel line reason code Cancel order line action button Cancel reason code filter (line) Line type Line type filter (line) Order status Order status Line status Return status Order line min status Order line max status Selling channel Entry type filter Tags Tag filter How Cross-Org Visibility Works The Cross-Org Order Visibility feature enables CSRs to search for, view, and edit orders across organizations, specifically the intersection of: Organizations the user has access to, per the Org User list defined in the User > Org User UI The organization currently selected in the top right corner of the UI and all its children, grandchildren, and so on. The application takes this list of organizations and sends it in the API request for each relevant action. For example, without this feature, if a user is logged into the Group org and is searching orders on the Order List, the application sends Group org in the search orders API, which would only retrieve orders with Group org stamped on them. With this feature enabled, the application sends a list of orgs such as (Group, Brand A, Brand A - UK, Brand B, Brand B - UK) in the API request, so that the user can view a result list across multiple organizations. For example, a user Linda has access to Org Users: Group Brand A Brand A - UK Brand A - France Brand B Brand B - UK Brand B - France Then, if Linda selects the Group org in the top right dropdown in the Order List UI, she will see orders for the following organizations: Group Brand A Brand A - UK Brand A - France Brand B Brand B - UK Brand B - France If Linda selects the Brand B org in the top right dropdown in the Order List UI, she will see orders for the following organizations: Brand B Brand B - UK Brand B - France If a different user Dominic has access to Org Users: Group Brand A Brand A - France Brand B Brand B - France Then, if Dominic selects the Group org in the top right dropdown in the Order List UI, he will see orders for the following organizations: Group Brand A Brand A - France Brand B Brand B - France If Dominic selects the Brand B org in the top right dropdown in the Order List UI, he will see orders for the following organizations: Brand B Brand B - France Grants & Resources There is no specific grant to enable a user to view orders across organizations. For a user to view orders across organizations: The 'View Orders Across Organizations' configuration (see below) should be enabled The user should have access to the relevant organizations in the User > Org User UI Configuration There are two configurations to enable cross-org visibility: Call Center Configuration > View Orders Across Organizations: If enabled, this allows users to view orders across the organizations in the customer service UIs, including Customer Transactions, Create/Edit Order, View Order Status, and so on. List UI Configuration > View Orders Across Organizations: If enabled, this allows users to view orders across the organizations in the Order List and Order Line List UIs. These two configurations work independently of each other. Note: If cross-org visibility is enabled, these configurations must be enabled in all organizations in the hierarchy. Feature Scope The following features are not supported: Multi-select actions on the Order List and Order Line List UIs when cross-org visibility is enabled. Users must single select orders to perform actions including send order status, cancel, hold, un-hold, allocate, and release. Viewing store locations across organizations in the Store Locator in the contact center UI. Searching across organizations using the Order Search box in the customer service UI. The Order Search box currently only supports the selected org. For example, a user wants to search across parent and child orgs, they cannot use the order search box. The Customer Transactions UI can be used as a workaround. Troubleshooting I don't see the Order Types (or other filter data) in the dropdown that I have configured for the child orgs Profile-based data (order type, users, and so on - see full list above) is only displayed for the currently-selected org. So, if the top right org dropdown has the parent org selected, then only the data configured for the parent org is displayed. Follow the instructions above to manage your data in a way that will work with this feature. I'm not able to view the interaction wrap up panel in customer engagement with the grants added only at the child level The cross org functionality for interaction panel in customer engagement works only when the grants are added at both the parent and child level. Case configuration is throwing permissions error after switching organization to child org The cross org functionality works only when the grants are added at both the parent and child level. Related Articles Item SearchOrder Status InquiryTransactional EmailsCall Center ConfigurationCustomer Service Insights DashboardUI ResourcesKits in Call CenterReturns and ExchangesOverview and NavigationOrder ModificationsTransactional TextsTroubleshooting"
}