{
  "success": true,
  "permalink": "customerfacingdisplay-2",
  "title": "Customer Facing Display",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158737\" href=\"/point-of-sale\" class=\"breadcrumb-links\">Point of Sale</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3433322\" href=\"/pos-iris-guides\" class=\"breadcrumb-links\">POS Guides</a></li><li> <span>››</span>Customer Facing Display</li></ul>  \t\r\n\t\t<h1><a name=\"customer-facing-display\" id=\"customer-facing-display\"></a>Customer Facing Display</h1>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/customerfacingdisplay-2$customer-facing-display\">Customer Facing Display</a><ul><li><a href=\"/customerfacingdisplay-2$overview\">Overview</a><ul><li><a href=\"/customerfacingdisplay-2$hardware-combinations-and-considerations\">Hardware Combinations and Considerations</a></li><li><a href=\"/customerfacingdisplay-2$terminology\">Terminology</a></li><li><a href=\"/customerfacingdisplay-2$configurations\">Configurations</a></li><li><a href=\"/customerfacingdisplay-2$grants\">Grants</a></li><li><a href=\"/customerfacingdisplay-2$settings\">Settings</a><ul><li><a href=\"/customerfacingdisplay-2$locale\">Locale</a></li><li><a href=\"/customerfacingdisplay-2$offline\">Offline</a></li></ul></li></ul></li><li><a href=\"/customerfacingdisplay-2$supported-functionality\">Supported Functionality</a><ul><li><a href=\"/customerfacingdisplay-2$customer-search\">Customer Search</a></li><li><a href=\"/customerfacingdisplay-2$add-new-customer\">Add New Customer</a></li><li><a href=\"/customerfacingdisplay-2$order-line-display\">Order Line Display</a><ul><li><a href=\"/customerfacingdisplay-2$sku-prompting-nbsp-and-cart-item-input-forms\">SKU-Prompting&nbsp;and Cart Item Input Forms</a></li><li><a href=\"/customerfacingdisplay-2$order-summary\">Order Summary</a></li><li><a href=\"/customerfacingdisplay-2$receipt-selection\">Receipt Selection</a></li></ul></li><li><a href=\"/customerfacingdisplay-2$adding-editing-shipping-addresses\">Adding/Editing Shipping Addresses</a></li><li><a href=\"/customerfacingdisplay-2$idle-screen\">Idle screen</a></li></ul></li></ul></li></ul></div>\r\n\r\n<h2><a name=\"overview\" id=\"overview\"></a>Overview</h2>\r\n\r\n<p>The Customer Facing Display (CFD) feature in the Manhattan Active® Omni POS system allows store associates and customers to efficiently interact with each other during a transaction.&nbsp; On a device such as an iPad, a user can log in and select Customer Facing Display which will run a customer-safe version of our app.&nbsp; In this mode, the device functions as a 'slave' to a fixed register running the full POS application.</p>\r\n\r\n<p>This functionality allows customers to use the 'slave' CFD device search for and attach themselves to an order, view the line items within the cart, as well as select their receipts delivery method seamlessly, enhancing the checkout experience for both associates and shoppers.</p>\r\n\r\n<p>Additionally, the customer-facing display allows a customer to enter a shipping address for an Omni order themselves, without 'dictating' the data to a store associate, and can be used for additional customer inputs a configured by the retailer.&nbsp;</p>\r\n\r\n<p>The Customer Facing Display, further known as CFD, enables customers to view all the items within their order, regardless of delivery method. Additionally, the customer will be able to:</p>\r\n\r\n<ul>\r\n\t<li>View items grouped by delivery method, including the address(s) applied</li>\r\n\t<li>View line item modifications made, such as price overrides, promotions and discounts</li>\r\n\t<li>View return line items</li>\r\n\t<li>View subtotal and any associated transaction fees and discounts.</li>\r\n\t<li>Enter an email address for an emailed receipt; select receipt type</li>\r\n\t<li>Enter a new shipping address or edit an existing one</li>\r\n\t<li>Interact with various item prompts based on configurations</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3><a name=\"hardware-combinations-and-considerations\" id=\"hardware-combinations-and-considerations\"></a>Hardware Combinations and Considerations</h3>\r\n\r\n<p>In theory, the 'master' Register can be any of our recommended <a href=\"https://omni.helpdocsonline.com/stores-hw-policy$Supported-Device-List\">supported devices</a>.&nbsp; However it must be configured as a Fixed register - ability to pair to a CFD is not allowed for a Mobile register.&nbsp;</p>\r\n\r\n<p>The 'slave' CFD device similarly would be a supported device but must run as a tablet (\"landscape\" mode), not handheld; so iPhone&nbsp;or Android TC52 devices cannot be used as CFD for example.&nbsp; In addition, the minimum width of a CFD device must be 768 px.&nbsp; The CFD and the Register must be visible to each other on the <a href=\"https://omni.helpdocsonline.com/customerfacingdisplay-2$settings\">same LAN</a>.&nbsp;</p>\r\n\r\n<p>We have tested the functionality against the following combinations.</p>\r\n\r\n<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" width=\"355\">\r\n\t<thead>\r\n\t\t<tr height=\"21\">\r\n\t\t\t<th height=\"21\" scope=\"col\" width=\"180\">Register</th>\r\n\t\t\t<th scope=\"col\" width=\"175\">CFD</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr height=\"21\">\r\n\t\t\t<td height=\"21\">Windows&nbsp;</td>\r\n\t\t\t<td>iPad</td>\r\n\t\t</tr>\r\n\t\t<tr height=\"21\">\r\n\t\t\t<td height=\"21\">iPad</td>\r\n\t\t\t<td>iPad Mini</td>\r\n\t\t</tr>\r\n\t\t<tr height=\"21\">\r\n\t\t\t<td height=\"21\">iPad</td>\r\n\t\t\t<td>Android ET51</td>\r\n\t\t</tr>\r\n\t\t<tr height=\"21\">\r\n\t\t\t<td height=\"21\">&nbsp;</td>\r\n\t\t\t<td>&nbsp;</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3><a name=\"terminology\" id=\"terminology\"></a>Terminology</h3>\r\n\r\n<ul>\r\n\t<li>Register: POS App for retail users</li>\r\n\t<li>CFD:&nbsp;Customer-facing display for retail customers</li>\r\n\t<li>Associate:&nbsp;Retail employee</li>\r\n\t<li>Customer: Retail shopper</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3><a name=\"configurations\" id=\"configurations\"></a>Configurations</h3>\r\n\r\n<p>The below configurations are specific to the Customer Facing Display.</p>\r\n\r\n<p>Application Configuration &gt; Manage POS Configuration &gt; POS Configurations &gt; POS Store Configurations &gt; Customer Display</p>\r\n\r\n<ul>\r\n\t<li>Customer Search: Determines the search criteria for the customer display. This can be set to either Email or Phone, not both.</li>\r\n\t<li>Background Image: This sets the image displayed on the CFD behind the search screen and welcome screen</li>\r\n\t<li>Company Logo: This is the same logo that appears on the register Cart screen, and it will be used for the customer search as well as the Idle screen on the CFD</li>\r\n</ul>\r\n\r\n<h3><a name=\"grants\" id=\"grants\"></a>Grants</h3>\r\n\r\n<ul>\r\n\t<li>In order to limit customer ability to interact with the POS app inappropriately, user should log on to the CFD device with credentials associated to a limited role.&nbsp; For example, retailer could define role \"CFDUser\".\r\n\t<ul>\r\n\t\t<li>At the current time, both the master fixed register and the CFD device require separate login.&nbsp;&nbsp;</li>\r\n\t\t<li>There are obviously functions in the Store app which are not appropriate for customers to access. To ensure that only appropriate limited functions are shown on the CFD, the register user should use different credentials - associated to a role with limited grants - to log on to the CFD device, not his/her normal credentials.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>These are the only grants that should be assigned to (for example) CFDUser.&nbsp; These will allow all required CFD functions but limit exposure to other options in the application such as CART, EJ, BACKOFFICE, etc that are not appropriate for the customer.</li>\r\n</ul>\r\n\r\n<p style=\"margin-left: 40px;\">ui::pos::cart::cfdPeerConnection::discover</p>\r\n\r\n<p style=\"margin-left: 40px;\">ui::devicemgmt::cfd::connectToRegister</p>\r\n\r\n<p style=\"margin-left: 40px;\">ui::devicemgmt::cfd::connectToDisplay</p>\r\n\r\n<p style=\"margin-left: 40px;\">ui::posservice::menu::customerfacingdisplay</p>\r\n\r\n<p style=\"margin-left: 40px;\">api::storefacade::transaction::read</p>\r\n\r\n<p style=\"margin-left: 40px;\">&nbsp;</p>\r\n\r\n<h3><a name=\"settings\" id=\"settings\"></a>Settings</h3>\r\n\r\n<p>The register must establish a connection&nbsp;to its desired CFD device and vice versa. So if the register is number 101, the user must select register 101 on the CFD device once they launch the CFD application with the limited credentials.</p>\r\n\r\n<div class=\"tip\">Note: This functionality was designed for&nbsp;network based IP connectivity between register and CFD.&nbsp; Both devices must be connected to the same router, on the same LAN and should be reachable by each other even in the absence of external Internet access.</div>\r\n\r\n<ul style=\"list-style-type:circle\">\r\n\t<li>Configure registers for CFD for auto pairing (for device management)\r\n\t<ul>\r\n\t\t<li>In order to establish a&nbsp;CFD connection: From the Register side - go to settings and make sure assigned register number&nbsp;then select 'Pair' and on the CFD device- find the corresponding register number then select 'Pair' -- Can go in either order, connection still establishes</li>\r\n\t\t<li>Upon successful connection, 'Pair' button on Register side will turn green and say 'Paired' while on the CFD device there will be an indicator that goes green as well.</li>\r\n\t\t<li>Pair on CFD\r\n\t\t<ul>\r\n\t\t\t<li>Need&nbsp;ui::devicemgmt::cfd::connectToRegister grant in order to view available registers</li>\r\n\t\t</ul>\r\n\t\t</li>\r\n\t\t<li>Pair on register side\r\n\t\t<ul>\r\n\t\t\t<li>Need&nbsp;ui::devicemgmt::cfd::connectToDisplay grant for 'Pair' button</li>\r\n\t\t\t<li>Pair only shown on fixed register&nbsp;type</li>\r\n\t\t</ul>\r\n\t\t</li>\r\n\t\t<li>Both devices need to be on the same network\r\n\t\t<ul style=\"list-style-type:circle\">\r\n\t\t\t<li>If both stay on same network and internet fails, devices will remain paired\r\n\t\t\t<ul style=\"list-style-type:square\">\r\n\t\t\t\t<li>Offline support not enabled. Devices will stay paired but CFD will not show display.</li>\r\n\t\t\t</ul>\r\n\t\t\t</li>\r\n\t\t</ul>\r\n\t\t</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<ul style=\"list-style-type:circle\">\r\n\t<li>Auto-reconnect\r\n\t<ul style=\"list-style-type:circle\">\r\n\t\t<li>If the device connection is lost/severed:\r\n\t\t<ul>\r\n\t\t\t<li>Register – will listen for connection</li>\r\n\t\t\t<li>CFD – Will show connection lost popup, then pair to the last selected register.\r\n\t\t\t<ul style=\"list-style-type:square\">\r\n\t\t\t\t<li>If a connection is not established, the user can press the cancel button and select another register.</li>\r\n\t\t\t\t<li>User can&nbsp;press&nbsp;the indicator 5 times within 10 seconds to open a menu with options to pair (register list), cancel (close the popup), or log out (exit CFD).</li>\r\n\t\t\t</ul>\r\n\t\t\t</li>\r\n\t\t</ul>\r\n\t\t</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<h4><a name=\"locale\" id=\"locale\"></a>Locale</h4>\r\n\r\n<p>Screen Labels:</p>\r\n\r\n<ul>\r\n\t<li>Determined by the&nbsp;locale of the user logged into each specific device&nbsp;(Register or CFD).</li>\r\n\t<li>Each device displays labels in the language set by its active user.</li>\r\n</ul>\r\n\r\n<p>Item Data&nbsp;(e.g., descriptions, colors, sizes):</p>\r\n\r\n<ul>\r\n\t<li>Determined&nbsp;only by the locale of the Register user.</li>\r\n\t<li>This applies to both the Register and CFD screens.</li>\r\n\t<li>The&nbsp;Register user’s locale always governs the item data, even when viewed on the CFD screen.</li>\r\n\t<li>This is only relevant when item data has been translated.</li>\r\n</ul>\r\n\r\n<div class=\"tip\">When the default Locale of both the Register and CFD user is the same,&nbsp; (e.g., both set to English or both to French), both Register and CFD will show labels and item data consistently in that common locale.</div>\r\n\r\n<div class=\"warning\">Discrepancies: Can occur when the Register and CFD users are associated to&nbsp;different default locales.</div>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"offline\" id=\"offline\"></a>Offline</h4>\r\n\r\n<p>Connectivity between Register and CFD device requires communication to the Manhattan cloud components.&nbsp; Therefore, if a register is running in OFFLINE mode one cannot initiate a connection to a CFD.</p>\r\n\r\n<p>However, if the connection is initiated while the register is ONLINE and the user later switches to OFFLINE mode, the Register/CFD connection will be retained.&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h2><a name=\"supported-functionality\" id=\"supported-functionality\"></a>Supported Functionality</h2>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3><a name=\"customer-search\" id=\"customer-search\"></a>Customer Search</h3>\r\n\r\n<p>Based on configured search criteria, the CFD will prompt a customer to search for themselves.</p>\r\n\r\n<ul>\r\n\t<li>Configuration can be set to either email address or phone number only.</li>\r\n\t<li>If the customer is found, they will be automatically attached to the order.\r\n\t<ul>\r\n\t\t<li>CFD will display the customer name as will the register for the associate to view.\r\n\t\t<ul>\r\n\t\t\t<li>If the customer is attached by the associate, the CFD will update to reflect this information.</li>\r\n\t\t</ul>\r\n\t\t</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>If the customer is not found, the CFD will inform the customer, and they will have the option to re-search, or they can enter themselves as a new customer.</li>\r\n</ul>\r\n\r\n<div class=\"tip\">If the associate has not begun scanning items into the cart, the search will appear as a full screen on the CFD. Once items have been scanned, the CFD will display a split-screen view of the search and the items being scanned into the cart.</div>\r\n\r\n<h3><a name=\"add-new-customer\" id=\"add-new-customer\"></a>Add New Customer</h3>\r\n\r\n<p>If a customer record cannot be found, or the customer is not an existing registered customer, they can choose to sign up on the CFD.</p>\r\n\r\n<ul>\r\n\t<li>This form will capture basic required information such as first and last name, email address and phone number.</li>\r\n\t<li>Once added, the customer will be automatically added to the order in the Cart.</li>\r\n\t<li>Associates can scan items while the customer adds themselves. The CFD will show a split-screen view, so the customer can still see items being added to their order.</li>\r\n</ul>\r\n\r\n<div class=\"warning\">If the customer has begun entering in their information and the associate begins scanning items, the form will reset itself.</div>\r\n\r\n<div class=\"tip\">If the associate proceeds to check out prior to the form being completed by the customer, they can navigate back to the Cart and the form will be pre-populated with the entered information.</div>\r\n\r\n<h3><a name=\"order-line-display\" id=\"order-line-display\"></a>Order Line Display</h3>\r\n\r\n<p>The CFD becomes a line item display as soon as a customer is added to the cart, or begins scanning items. If items are scanned by the associate, the display screen will split. The left-hand panel will show the customer search and add screen if none are attached to the order, or will show the welcome screen if a customer is attached. The right-hand panel will show all items entered into the cart including linked items, as well as the transaction summary and estimated balance due by the customer.</p>\r\n\r\n<ul>\r\n\t<li>Items shown will display the following information:\r\n\t<ul>\r\n\t\t<li>Item image</li>\r\n\t\t<li>Item sku</li>\r\n\t\t<li>Item name</li>\r\n\t\t<li>Color and size if applicable</li>\r\n\t\t<li>Price</li>\r\n\t\t<li>Any discounts or promotions applied</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Items will be grouped by fulfillment group just as the cart items are\r\n\t<ul>\r\n\t\t<li>Shipments will display shipping address and method</li>\r\n\t\t<li>Pick-up items will show pick-up location</li>\r\n\t\t<li>Returns will show under matched order.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Additionally, modifications affecting the price of an item will display as pills on the item line providing additional information to the customer.</li>\r\n\t<li>Transaction summary will be an expandable section under the item list.\r\n\t<ul>\r\n\t\t<li>Customers can tap on this section to expand and see the details of the transaction.</li>\r\n\t\t<li>Including, but not limited to:\r\n\t\t<ul>\r\n\t\t\t<li>Subtotal, discounts, taxes and fees</li>\r\n\t\t</ul>\r\n\t\t</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>The estimated total is shown as taxes may not be calculated until the associate presses checkout on the register.</li>\r\n\t<li>Transactions NOT supported:\r\n\t<ul>\r\n\t\t<li>Gift card balance inquiry</li>\r\n\t\t<li>BOPIS/ROPIS - previous items being picked up</li>\r\n\t\t<li>Exchange tender</li>\r\n\t\t<li>Post void</li>\r\n\t\t<li>Receipt reprint</li>\r\n\t\t<li>Deep link orders</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"sku-prompting-nbsp-and-cart-item-input-forms\" id=\"sku-prompting-nbsp-and-cart-item-input-forms\"></a>SKU-Prompting&nbsp;and Cart Item Input Forms</h4>\r\n\r\n<p>The Customer-Facing Display (CFD) will also be used to present cart input forms designed to collect relevant customer and item information. These prompts will appear on the CFD, synchronized with the modal dialogs displayed on the POS register to ensure a consistent&nbsp;user experience. When prompted, customers can enter specific details directly into the display. The information collected may include customer data such as date of birth (for age-restricted items), application of loyalty certificates, required attestations, or item and bag configuration details necessary to complete the transaction.</p>\r\n\r\n<p>Cart Forms&nbsp;can be configured to be displayed on a customer-facing display. This can be defined in <a href=\"https://omni.helpdocsonline.com/pos-cartform$cart-form-configurations\">cart input form group configuration</a>. If you want to display the form&nbsp;on CFD and on pos register, then configure Interface mode as \"Register and Peripheral\". If you don't want it to be displayed on CFD, then leave it blank or select \"Register\".</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"order-summary\" id=\"order-summary\"></a>Order Summary</h4>\r\n\r\n<p>When the associate has completed ringing up the customer's order, and they press checkout on the register, the CFD will move to a full-screen display of the items in the cart. All modifications that were previously made will still be visible, as will the transaction summary and totals. The totals will be updated to reflect any changes in taxes or last-minute promotions that may have been applied.</p>\r\n\r\n<h4><a name=\"receipt-selection\" id=\"receipt-selection\"></a>Receipt Selection</h4>\r\n\r\n<p>Once the order is complete and the balance due is 0, both the register and CFD will move to the receipt selection screen.</p>\r\n\r\n<ul>\r\n\t<li>The display will show the various receipt options.\r\n\t<ul>\r\n\t\t<li>Print</li>\r\n\t\t<li>Email</li>\r\n\t\t<li>Print and Email</li>\r\n\t\t<li>No receipt</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Email\r\n\t<ul>\r\n\t\t<li>Will show the pre-populated customer email if a customer was attached to the order</li>\r\n\t\t<li>Customers can add/edit email if one does not exist or if they would like to change the email receipt address</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Print will automatically print to the associated register's printer.</li>\r\n\t<li>Once a selection is made, the CFD will go back to idle or search based on the existing register configurations.</li>\r\n</ul>\r\n\r\n<div class=\"tip\">Currently, gift receipt selection is only available on the register by the associate.</div>\r\n\r\n<h3><a name=\"adding-editing-shipping-addresses\" id=\"adding-editing-shipping-addresses\"></a>Adding/Editing Shipping Addresses</h3>\r\n\r\n<p>The Customer Facing Display will also prompt the customer to enter their own shipping address for any items being shipped, or they can edit an existing address. The address prompt will occur within the shipping flow once the associate selects to Add New Address or Edit Address on the register. This can occur from the item details page within the catalog, modifying an item within the cart to a send-sale, or when modifying an individual line to a ship to address.</p>\r\n\r\n<ul>\r\n\t<li>Adding a new address will prompt the customer on the CFD with a full shipping address capture form.\r\n\t<ul>\r\n\t\t<li>If a customer is already added to the order, their initial information will already be populated on the form: first name, last name, email and phone number.</li>\r\n\t\t<li>If a customer is not added to the order, then the form will be completely empty.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>All required fields must be entered in by the customer before the address form can be submitted and saved to the order.</li>\r\n\t<li>If the customer is editing an existing address, the form will be pre-populated\r\n\t<ul>\r\n\t\t<li>The customer can edit the shipping address information and press save when completed.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>To prevent the associate from moving further into the flow before the form is completed, an overlay will appear on the register to prevent additional items from being entered, or to prevent the associate from entering incorrect shipping information.\r\n\t<ul>\r\n\t\t<li>The overlay will have an Assist Customer button on it. If the associate presses this button, the form on the CFD will be dismissed and the associate can choose to add the information on the form themselves.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Once the customer submits the form on the CFD, the overlay will auto-dismiss on the register. The associate will be prompted with the Address Verification pop-up if configured, and then&nbsp; the flow will continue to the shipment delivery method selection.</li>\r\n</ul>\r\n\r\n<div class=\"warning\">Add/Edit address will only be available with the new register shipping forms. This will automatically be available to new customers, but all others must enable the behavior change first.</div>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3><a name=\"idle-screen\" id=\"idle-screen\"></a>Idle screen</h3>\r\n\r\n<p>If the register user exits the cart, CFD reverts to an idle state. This ensures that the customer doesn't see activity not related to their cart, or, try to interact with CFD during non-cart register actions. Idle state is blank background. Idle screen would also appear in the event of any navigation away from POS cart session, such as logout, app crash, timeout and screen lock.</p>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 22373,
  "scraped_at": "2025-08-09T22:35:33.545525"
}