{
  "id": "2242666",
  "permalink": "cycle-counting-process",
  "title": "Cycle Count Process",
  "type": "topic",
  "level": 6,
  "path": "Manhattan Active® Omni/Store/Process & Configuration Guides/Store Inventory & Fulfillment/Store Inventory Management/Cycle Count/Process",
  "raw_item": {
    "id": "2242666",
    "text": "Process",
    "title": "Process",
    "permalink": "cycle-counting-process",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "213836",
    "parent": "f;213836",
    "created_date": "1560349409",
    "modified_date": "1751021794",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "1"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158410\" href=\"/store\" class=\"breadcrumb-links\">Store Inventory & Fulfillment</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2166732\" href=\"/store-inventory\" class=\"breadcrumb-links\">Store Inventory Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2251419\" href=\"/cycle-count\" class=\"breadcrumb-links\">Cycle Count</a></li><li> <span>››</span>Cycle Count Process</li></ul>  \t\r\n\t\t<h2>Cycle Counting Process</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/cycle-counting-process$menu-badge-count\">Menu badge count</a></li><li><a href=\"/cycle-counting-process$create-count-request\">Create Count Request</a></li><li><a href=\"/cycle-counting-process$count\">Count</a><ul><li><a href=\"/cycle-counting-process$select-request\">Select Request</a><ul><li><a href=\"/cycle-counting-process$initiate-count-updates-first-item-on-request-is-scanned\">Initiate Count Updates (first item on request is scanned)</a></li></ul></li><li><a href=\"/cycle-counting-process$counting\">Counting</a><ul><li><a href=\"/cycle-counting-process$default-navigation-to-items-to-count-screen\">Default navigation to items to count screen</a></li><li><a href=\"/cycle-counting-process$items-to-count\">Items to count</a></li><li><a href=\"/cycle-counting-process$grouping\">Grouping</a></li><li><a href=\"/cycle-counting-process$counted-items\">Counted Items</a></li><li><a href=\"/cycle-counting-process$multiple-versus-single-counters\">Multiple versus Single Counters</a></li><li><a href=\"/cycle-counting-process$pause-resume\">Pause & Resume</a></li></ul></li><li><a href=\"/cycle-counting-process$item-level-review\">Item Level Review</a></li><li><a href=\"/cycle-counting-process$submit-counts\">Submit Counts</a></li><li><a href=\"/cycle-counting-process$finish-counts\">Finish Counts</a></li><li><a href=\"/cycle-counting-process$count-updates\">Count Updates</a></li></ul></li><li><a href=\"/cycle-counting-process$review\">Review</a><ul><li><a href=\"/cycle-counting-process$review-overview\">Review overview</a></li><li><a href=\"/cycle-counting-process$review-updates\">Review Updates</a></li></ul></li><li><a href=\"/cycle-counting-process$inventory-updates\">Inventory Updates</a><ul><li><a href=\"/cycle-counting-process$outbound-messages\">Outbound Messages</a></li></ul></li><li><a href=\"/cycle-counting-process$connectivity-nbsp\">Connectivity&nbsp;</a><ul><li><a href=\"/cycle-counting-process$state-transition-nbsp\">\r\nState Transition&nbsp;</a></li><li><a href=\"/cycle-counting-process$count-request-line\">Count Request Line</a></li><li><a href=\"/cycle-counting-process$count-request\">Count Request</a></li></ul></li><li><a href=\"/cycle-counting-process$services\">Services</a></li></ul></div>\r\n\r\n<p>Maintaining inventory accuracy is one of the biggest challenges retailers face regularly.&nbsp;Administrative&nbsp;errors, shrinkage and stock movements can cause discrepancies between the expected inventory level tracked by the&nbsp;inventory management system and the actual store inventory. The ability for store personnel to count merchandise on a regular basis is key to resolving these discrepancies and correcting the inventory levels.</p>\r\n\r\n<p>Cycle counting allows retailers to stay on the top of stock level by periodically counting a small portion of inventory at a time.&nbsp;</p>\r\n\r\n<p>The corporate office can send cycle count requests to store for&nbsp;selected&nbsp;items. A store user with appropriate permission can review and approve the cycle count request. Review can be turned on&nbsp;based on configuration.</p>\r\n\r\n<p>This document describes how to perform a cycle count that is initiated by the corporate office for stores which are not RFID-enabled. For information on how stores can create their own store-initiated cycle counts on the fly, refer to the <a hqid=\"3339562\" href=\"/createcyclecount\">Store-Initiated Cycle Count</a> guide.&nbsp;For information on how RFID-enabled stores perform counts, refer to the <a hqid=\"3095077\" href=\"/store-count\">Store Count</a> guide.</p>\r\n\r\n<div class=\"tip\"><strong>Note: </strong>To know more on the&nbsp; cycle count activity during offline mode, please refer to the&nbsp;<a hqid=\"3324298\" href=\"/store-inventory-and-fulfillment-offline-support\">Store Offline Support</a>&nbsp;page.</div>\r\n\r\n<h4><a name=\"menu-badge-count\" id=\"menu-badge-count\"></a><a id=\"menu-count\" name=\"menu-count\"></a>Menu badge count</h4>\r\n\r\n<p>A badge count on the&nbsp;Cycle Count menu shows the number of open and pending&nbsp;count requests that exist for the store, giving the store manager quick visibility to open work.&nbsp;The Get SIM Menu count service is used to get the list of&nbsp;open and pending count requests. Approved and Declined cycle counts are not included in the badge count. The cycle&nbsp;count which is marked for the recount is listed with the Recount Required label.&nbsp;</p>\r\n\r\n<h4><a name=\"create-count-request\" id=\"create-count-request\"></a><a id=\"CycleCountRequest\" name=\"CycleCountRequest\"></a>Create Count Request</h4>\r\n\r\n<p>A cycle count request is sent to the store by corporate. These count requests are interfaced from an external system, and a separate request is created per store before arriving at Store. Some key considerations for count request include:</p>\r\n\r\n<ul>\r\n\t<li>A modified version of the count request can be sent to a store, but only if the count has not yet been initiated by a user. Once initiated, the count is downloaded onto at least one&nbsp;mobile device, and any updates to the request&nbsp;are not synced to the device.</li>\r\n\t<li>Expected quantity should be updated directly in the Inventory Management system. A snapshot of&nbsp;on-hand inventory is captured from the Inventory Management system when the counting process begins.</li>\r\n\t<li>A particular item should be included only once&nbsp;in a count request.</li>\r\n</ul>\r\n\r\n<h4><a name=\"count\" id=\"count\"></a><a id=\"Counting\" name=\"Counting\"></a>Count</h4>\r\n\r\n<h5><a name=\"select-request\" id=\"select-request\"></a>Select Request</h5>\r\n\r\n<p>The user can choose from a list of cycle count requests for the store that are eligible for counting. The count list displays open or pending counts by default. User&nbsp;can apply a filter to view approved and declined counts, if needed. The list includes the information listed below, and sorts by ascending due date:</p>\r\n\r\n<ul>\r\n\t<li>Count identifier</li>\r\n\t<li>Description</li>\r\n\t<li>Start date</li>\r\n\t<li>Due date</li>\r\n\t<li>Current status</li>\r\n\t<li>Number of counted items and total number of items on the request</li>\r\n\t<li>Number of items ready for review (if user has review permission)</li>\r\n</ul>\r\n\r\n<p>A count request in any status other than \"Counted\", \"Approved\" or \"Declined\" is eligible&nbsp;for counting.</p>\r\n\r\n<p>After selecting a cycle count request to work on, counting is initiated once a valid item is scanned/entered. Items on the count request are downloaded to the device once the count request is selected for counting. Validations are performed to ensure that the scanned item exists on the request.</p>\r\n\r\n<h6><a name=\"initiate-count-updates-first-item-on-request-is-scanned\" id=\"initiate-count-updates-first-item-on-request-is-scanned\"></a>Initiate Count Updates (first item on request is scanned)</h6>\r\n\r\n<ol>\r\n\t<li>As and when, an item is scanned, an entry is made into the Count Additional Details. Cycle count tasks are always self-assigned by the user (i.e., assignment by a manager is not supported.</li>\r\n\t<li>Counted quantity of the item is incremented.</li>\r\n\t<li><a id=\"cc_variance_exp_qty\" name=\"cc_variance_exp_qty\"></a>The expected quantity is determined for all items on the request by taking a snapshot of perpetual inventory for the configured default store disposition from Inventory Management. If the perpetual inventory record is not available for an item, then the expected quantity&nbsp;is considered as zero.&nbsp;The expected quantity&nbsp;is updated based on the following:\r\n\t<ol>\r\n\t\t<li>If the \"Exclude picked and packed quantities while determining cycle count variance\" flag is set to false or null, the expected quantity is set directly to the perpetual quantity. See the <a href=\"https://omni.helpdocsonline.com/cycle-count-configuration$exclude-picked-and-packed-quantities-while-determining-cycle-count-variance\">configuration</a>&nbsp;section for more details.</li>\r\n\t\t<li>If the configuration is set to true, the expected inventory is set to the perpetual inventory (see above) minus picked/packed inventory in the store. This applies to inventory that has been picked or packed for customer orders, store-initiated transfers and pullbacks. Any inventory that is canceled after picking or packing is not excluded. The picked / packed inventory picture in the store is fetched when the first unit of a Cycle Count request is scanned, and it is not refreshed thereafter.&nbsp;</li>\r\n\t</ol>\r\n\t</li>\r\n</ol>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Once a count has been initiated, no inventory transactions should occur for the&nbsp;items included in the request until the count is approved.</div>\r\n\r\n<h5><a name=\"counting\" id=\"counting\"></a>Counting</h5>\r\n\r\n<h6><a name=\"default-navigation-to-items-to-count-screen\" id=\"default-navigation-to-items-to-count-screen\"></a><a id=\"Default navigation to remaining counts screen\" name=\"Default navigation to remaining counts screen\"></a>Default navigation to items to count screen</h6>\r\n\r\n<p>Based on the landing screen configuration, the \"Items to count\" screen can be loaded by default. The items&nbsp;to count screen shows the list of items which are pending for cycle count.&nbsp;If the configuration is turned off, the counted items screen is shown.</p>\r\n\r\n<p>Refer to the&nbsp;<a hqid=\"2239228\" href=\"/cycle-count-configuration$Default navigation to remaining counts screen\">configuration guide</a>&nbsp;for additional information.</p>\r\n\r\n<h6><a name=\"items-to-count\" id=\"items-to-count\"></a><a id=\"Remaining Counts\" name=\"Remaining Counts\"></a>Items to count</h6>\r\n\r\n<p>Items to count screen shows the list of items which are&nbsp;in the open status.&nbsp;Users can either scan an item or enter a barcode to count, including the item ID, UPC or vendor barcode. When the item is entered or scanned, it appears at the top, highlighted, and the scanned unit appears in front of the item, if the item quantity popup is disabled. Refer&nbsp;to the <a hqid=\"2239228\" href=\"/cycle-count-configuration$Default navigation to remaining counts screen\">configuration guide</a>&nbsp;for additional information about suppress quantity popup.&nbsp;Item's additional information can be displayed on the UI, it&nbsp;includes item image, department, style, color, and size. Refer to the&nbsp;<a hqid=\"ID2239228\" href=\"https://omni.helpdocsonline.com/cycle-counting-process$itemdetails\">Configuration guide</a>&nbsp;for additional information. Users can also view the items additional details by clicking on the view action, which&nbsp;displays the item's short description, SKU code, department, color, style, and UPC code. It also comprises a Back button which redirects the user back to the Items to Count List screen. Users can navigate to the counted units screen to see the list of counted items.</p>\r\n\r\n<p>If the item's quantity popup is not disabled by configuration, the user scans&nbsp;the item or enters the barcode manually, the item quantity popup is displayed. Users can use the device's camera or manually enter the barcode to increase the counted quantity.&nbsp;Users can also directly edit the quantity using the minus (-) and plus (+) signs. If the item is marked for \"Scan Only\", the plus (+) sign will be disabled on the quantity popup. Quantity&nbsp;popup displays the counted quantity along with the item's short description and UPC code.</p>\r\n\r\n<p>Users can also mark an item as out of stock -&nbsp;This updates line quantity to zero. It does not reference the \"Submit zero quantity for uncounted items\" parameter below.</p>\r\n\r\n<p>User can select the Finish Count action&nbsp;- This requires additional permission in addition to the count permission. The Finish Count action performs the following:</p>\r\n\r\n<ul>\r\n\t<li>Confirms that any still uncounted items should&nbsp;not be counted. See Finish Counts section for explanation on update behavior for these uncounted lines.</li>\r\n\t<li>Performs the Submit Count API to update any \"In progress\" counts that are assigned to other users.</li>\r\n\t<li>Calls the Finish Count API.</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: In addition to being automatically&nbsp;displayed at the time of Submit Counts, users can also access the items to the count list during counting.&nbsp;</div>\r\n\r\n<h6><a name=\"grouping\" id=\"grouping\"></a>Grouping</h6>\r\n\r\n<p>Rather than viewing a flat list, items on the Items to Count UI can be grouped based on either store department or pick path optimization to make the counting process more efficient. Configuration defines whether the Items to Count UI shows items based on:</p>\r\n\r\n<ul>\r\n\t<li>No grouping - An ungrouped list of items is shown based on the sequence that they were sent in the count request.&nbsp;This is the default behavior.</li>\r\n\t<li>Store department grouping - Items are grouped based on the store department they belong to. Within a group, they are sequenced by ascending item ID.</li>\r\n\t<li>Pick Path optimization grouping - For retailers who have configured Pick Path Optimization, the same configuration can be leveraged to show a best travel path during counting. As with picking, the item's primary location is used when determining the best count sequence. When enabled, the primary and secondary pick location is shown on the Item Details UI. Items with no store layout are grouped under the \"Others\" heading. Refer to the <a hqid=\"1808791\" href=\"/fulfillment-picking-process$PPO\">Picking guide</a> for additional information on PPO.</li>\r\n</ul>\r\n\r\n<p>If grouping is enabled and the 'Suppress item quantity popup when scanning an item for counting in Items to Count screen' is enabled, the last scanned item is moved to the top of its group. If the ''Suppress item quantity popup when scanning an item for counting in Items to Count screen' is enabled, the item is immediately removed once the quantity is entered. When the last item in the group is removed from the UI, the corresponding group heading is also removed.&nbsp;</p>\r\n\r\n<p>This&nbsp;functionality is applicable for both corporate and store-initiated cycle counts.&nbsp;The Counted Items and Review UI do not show groupings.&nbsp;Refer to the <a href=\"https://omni.helpdocsonline.com/cycle-count-configuration$grouping-configuration-for-cycle-counts\">Configuration </a>guide for more information.</p>\r\n\r\n<h6><a name=\"counted-items\" id=\"counted-items\"></a>Counted Items</h6>\r\n\r\n<p>The counted item screen shows a list of counted items along with counted units. The last counted item appears at the top, and it is highlighted. To continue counting, users&nbsp;can either scan an item or enter a barcode to count, including the item ID, UPC or vendor barcode. Once the item has been entered/scanned, units can be counted by performing additional scans. If the item is not marked as a scan-only item, units can also be recorded by incrementing the count or by directly entering the quantity.&nbsp;If the item is scan-only item, these operations are not allowed. However, regardless of the scan-only value, the count can be decremented in case a counting error is made. The scan-only flag can be specified at several levels and if found to be true at&nbsp;any level, it applies. The system first checks if true on the count line, if not then checks the count request, and if not finally&nbsp;item master. If all are false, the item is treated as not scan-only. When the user scans the other item for counting, the current scanned item has been moved to the counted items screen. If in case users finds an additional units of counted items which are moved to the counted items screen and user again scans the item for counting, then item is loaded on the tems to count screen and counted units are updated.</p>\r\n\r\n<p><a id=\"in-progress-item-details\" name=\"in-progress-item-details\"></a>Based on permissions, the user can&nbsp;view the details of \"In progress\"&nbsp;item counts including&nbsp;the SKU, department, style, color, size and item image. The number of lines in progress for that&nbsp;user is reflected as counting progresses.</p>\r\n\r\n<p>As users count, those scans are intermittently synced to the server when they have connectivity. When connectivity is lost, the counts are batched up and synced once connectivity is restored.</p>\r\n\r\n<p>At the time of the Submit Count action, if any items exist on the request for which counting has not yet started (lines still in 'Open' status),<span style=\"color:#9b59b6;\"> </span>they are displayed on the items to count list. Refer to&nbsp;<a hqid=\"2242666\" href=\"/cycle-counting-process$Remaining Counts\">Items to count&nbsp;List</a>&nbsp;for additional information.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: An item cannot be marked as out of stock once it has been counted.</div>\r\n\r\n<h6><a name=\"multiple-versus-single-counters\" id=\"multiple-versus-single-counters\"></a><a id=\"multiplecounters\" name=\"multiplecounters\"></a>Multiple versus Single Counters</h6>\r\n\r\n<p>Configuration controls whether multiple counters can perform counts on a cycle count request, or only one user.&nbsp;The “Allow multiple users to count” flag controls this behavior. Refer to the <a hqid=\"2239228\" href=\"/cycle-count-configuration\">Configuration guide</a> for additional information.</p>\r\n\r\n<p>If this configuration is enabled,</p>\r\n\r\n<ul>\r\n\t<li>Multiple&nbsp;associates can perform counting in parallel</li>\r\n\t<li>Associates coordinate outside of the application on how&nbsp;to split the count amongst themselves. For example, a&nbsp;count could&nbsp;be split up based on&nbsp;item categories (i.e., men's items, women's items, children's items) or by geographical area (i.e., front room, back room, etc.)</li>\r\n\t<li>Multiple associates can contribute to the counts for the same item, but once an associate submits the count for a particular item that associate cannot count additional units for that item. For this reason, it is recommended that associates do not submit their counts until they are done with their portion of the count in case they come across additional units for an item in an unexpected area.</li>\r\n\t<li>An associate&nbsp;with Finish permission finishes the count request once they determine that all associates are done counting. Coordination among associates occurs outside of the application.</li>\r\n\t<li>All items on the count become available for review once the finish count action is performed. Thus, item level review is not supported in this mode.</li>\r\n</ul>\r\n\r\n<p>If this parameter is disabled,</p>\r\n\r\n<ul>\r\n\t<li>Only one counter can work on a request at a time. Once an associate begins the counting process, any other associates who attempt to access the count receive an error message.</li>\r\n\t<li>Similar to the multi counter scenario, an item cannot be recounted after it has been submitted.</li>\r\n\t<li>Item-level review is supported in this mode and can be enabled.</li>\r\n</ul>\r\n\r\n<h6><a name=\"pause-resume\" id=\"pause-resume\"></a>Pause & Resume</h6>\r\n\r\n<p>If an associate experiences an interruption while counting that results in navigating outside of the request<span style=\"color:#e74c3c;\"> </span>(either on the same device or a different device), the user can reselect the count request and counted items. The user can view in progress counts once resumed counting. In case of a single counter scenario, the in-progress tasks assigned to the user must be completed by the same user and they cannot be reassigned to another user.</p>\r\n\r\n<h5><a name=\"item-level-review\" id=\"item-level-review\"></a><a id=\"Item Level Review\" name=\"Item Level Review\"></a>Item Level Review</h5>\r\n\r\n<p>Based on the configuration, users can review the count of a single item after submitting the count. In the items to&nbsp;count screen, users can either scan an item or enter the barcode to count, including the item ID, UPC or vendor barcode&nbsp;or user can swipe the item and tap on quantity to enter the count. Item scanning is not supported on the quantity popup screen. After counting of an item is completed, user can submit&nbsp;the count.</p>\r\n\r\n<p>User can mark an item&nbsp;out of stock. If&nbsp;item level review is required, then as soon as user initiates \"Out of Stock\" action for an item, zero quantity is immediately submitted.</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong>&nbsp;Item level review is not supported when multiple associates can perform a cycle count.</div>\r\n\r\n<div class=\"tip\"><span style=\"color:#9b59b6;\"><strong>Note</strong>: Item level review is not supported when quantity popup is suppressed in the items to count screen.</span></div>\r\n\r\n<p>If review is enabled&nbsp;and item's counted quantity is within the configured threshold, the counts are automatically approved and the user is navigated to the items to count screen to complete counting of other pending items. If count of an item&nbsp;exceeds the configured threshold, UI navigates to the review counts screen where user can either&nbsp;approve the count or trigger a recount. If there are pending items for&nbsp;counting, the user is navigated back to the items to count screen to complete counting of the pending items.&nbsp;</p>\r\n\r\n<p>When the last item of the cycle count is approved,&nbsp;the interstitial screen is shown where user can decide to go to the home screen or cycle count list screen.</p>\r\n\r\n<p>Refer to the&nbsp;<a hqid=\"2239228\" href=\"/cycle-count-configuration$Item Level Review\">configuration guide</a>&nbsp;for additional information</p>\r\n\r\n<h5><a name=\"submit-counts\" id=\"submit-counts\"></a><a id=\"Submit Count\" name=\"Submit Count\"></a>Submit Counts</h5>\r\n\r\n<p>Once the user finishes with their counting, they take the Submit Count action which submits the counts worked on by that user. If there are&nbsp;items whose&nbsp;counting has not yet started, a&nbsp;list of items to count&nbsp;is displayed (see <a hqid=\"2242666\" href=\"/cycle-counting-process$Remaining Counts\">I</a>tems to Count section.)&nbsp;However, if the entire count request has been completed, the user can tap on Finish which signifies that they are done counting the request. Tapping on Finish performs the Finish Counts updates (see <a href=\"/cycle-counting-process$Finish Counts\">Finish Counts</a> section.)</p>\r\n\r\n<p>A user may batch up all their counting and submit once&nbsp;or&nbsp;multiple times as they make progress.&nbsp;While both are supported, there are two important considerations to keep in mind.</p>\r\n\r\n<ul>\r\n\t<li>Once an associate submits counts for one or more items, that associate cannot count additional units for those items.</li>\r\n\t<li>If the \"Bypass items to count counts UI upon submit for single user\" flag is enabled in single counter&nbsp;mode, the submit action automatically marks all uncounted items as out of stock (or declined based on the<span style=\"color:#e74c3c;\">&nbsp;</span>\"Submit zero quantity for uncounted items\"&nbsp;parameter).&nbsp;In this mode, the user should be certain that all counting is complete before submitting the count.&nbsp;Refer to the <a hqid=\"2239228\" href=\"/cycle-count-configuration\">Configuration guide</a> for additional information.</li>\r\n</ul>\r\n\r\n<p>If no units exists for an item, the user can submit the count for the item&nbsp;without counting any units. In this case, the status of all the count request lines are updated to \"Declined\". Declined items are not reported to Inventory Management System.</p>\r\n\r\n<h5><a name=\"finish-counts\" id=\"finish-counts\"></a><a id=\"Finish Counts\" name=\"Finish Counts\"></a>Finish Counts</h5>\r\n\r\n<p>Finish Count is the final user action required for the count and signifies&nbsp;that all counting for the request is done. This is true for both single and multiple counter modes.</p>\r\n\r\n<p>In case of multiple counters, if a user attempts to finish the count while one or more counts are still in progress (not submitted) by other users, they receive an error message.</p>\r\n\r\n<p>The&nbsp;\"Submit zero quantity for uncounted items\" parameter determines how to handle uncounted items during the Finish Counts process. If set to true, the quantity of these lines is updated to zero. If set to false, the quantity is not updated, and line status is updated&nbsp;to \"Declined\".&nbsp;Declined items are not&nbsp;reported to the Inventory Management system. Refer to the <a hqid=\"2239228\" href=\"/cycle-count-configuration\">Configuration guide</a> for additional information.</p>\r\n\r\n<p>A user may finish counts without counting any item from the count request. In this case, user intends to decline the count request. In such a case, status of all the count request lines and status of the cycle count request will be&nbsp;updated to \"Declined\". Declined items are not reported to Inventory Management System.</p>\r\n\r\n<p>The Summary screen is shown to the user when they finish the counting of the cycle count. The summary screen shows information about the total items of the cycle count, items counted by users and the total uncounted items or total items that will be&nbsp;submitted with zero counted quantity. The user can go back to the items to count screen from the summary if they would like to count the uncounted items.</p>\r\n\r\n<p>A&nbsp;final count request summary is displayed to the user with some count statistics.</p>\r\n\r\n<p>Single Counter - Count overview for all flows except Bypass Items to count flow:</p>\r\n\r\n<p><img height=\"1114\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/3196/Screenshot%202022-09-12%20at%202_33_46%20PM.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1LzMxOTYvU2NyZWVuc2hvdCUyMDIwMjItMDktMTIlMjBhdCUyMDJfMzNfNDYlMjBQTS5wbmciLCJDb25kaXRpb24iOnsiRGF0ZUxlc3NUaGFuIjp7IkFXUzpFcG9jaFRpbWUiOjE3NTQ3NTIxOTN9fX1dfQ__&Signature=WFgfdF8ZFaOKcZqE3pT~G~Rapwnw4AfthPgxTzBkKv2ruyGOq2yJrM-sG77md4vvt4lnc7XQ4XLzb1nhcolqfGZ1zWgZpkZgI2X-XIswF1afa6l4lQRJPMcXdTjin~1611MqrGommjwHdL6qXkwSla1Dkiu4MNnYdQNMUQZiHF~-IBm7cKbsIDKWtY9KqNZMBJnNxA2w18o~rqEsemODdCVLnknjYYC7NTtWlM28L4iKHm4Jh0PymgNbz8-LI3T7TNC3Jx2Gbnh3NAnHSQ8UtaTFXmsfU~X2A4ycZKEiIIFOZADgUBPaR6MhdG7dr2Aamfo9jCcxZbBPMiBnxU19wQ__&Key-Pair-Id=K2TK3EG287XSFC\" width=\"1024\"></p>\r\n\r\n<p>Multiple Counters - Count overview for all flows except Bypass Item to count flow:</p>\r\n\r\n<p><img height=\"1394\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/3785/Screenshot%202022-09-12%20at%202_36_59%20PM.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1LzM3ODUvU2NyZWVuc2hvdCUyMDIwMjItMDktMTIlMjBhdCUyMDJfMzZfNTklMjBQTS5wbmciLCJDb25kaXRpb24iOnsiRGF0ZUxlc3NUaGFuIjp7IkFXUzpFcG9jaFRpbWUiOjE3NTQ3NTIxOTN9fX1dfQ__&Signature=AjiO-bFnFvmMpcf3TWuSORbfY8AUCa7-Jp7le~Dr~QqV2rINBozyfI1Eq6515m4J6aGlqqrDT-WExYbfi4r3T5A67erZWMtpgBuJt6auBOlv6~CgdafSu5b1zr2V2ac5gP2Guc1g4q6kq-tZ6XLBk93PLm32dbanhCdsyCqmeZ2vvxH7Ud4POGtenCK0Dh9gsfKR0FnAfDSykjrhRRSKSB~-AQ4qNTSWjtEl9tCcnQJdkUDQm42C8qTwQh14qGYeEUpiG7WZPC3sxbMafqLMVKf0PonK5Wd4ZZTmuQqIqMErKCyKxStK-yOr86e9iZNDp5hJpFUv4TdhV9KgMx4uLg__&Key-Pair-Id=K2TK3EG287XSFC\" width=\"1024\"></p>\r\n\r\n<p>Count overview for Bypass items to count flow:</p>\r\n\r\n<p><img height=\"1511\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/1343/Screenshot%202022-09-12%20at%202_38_10%20PM.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1LzEzNDMvU2NyZWVuc2hvdCUyMDIwMjItMDktMTIlMjBhdCUyMDJfMzhfMTAlMjBQTS5wbmciLCJDb25kaXRpb24iOnsiRGF0ZUxlc3NUaGFuIjp7IkFXUzpFcG9jaFRpbWUiOjE3NTQ3NTIxOTN9fX1dfQ__&Signature=qlQ3o~Byqp5X2iwsXCHWi88oLMU9WTB~DKehU5NHbh4wQP6hsJ4YUlmLy6zJpCcRWyTkxpKG3nhArt7SKw7RJYUzB6H7M0csTSyuRSKePOMUge2vre-dCOR919vQ53v8uRSDo2t02qnWwAbkSpsdEsEsZQKxitk96s6dujIV8DrYh2NnNuMKd6ZCJbkLGz7p~QoaS7Lq642aR5fT1X7PjqKA3BA54Gui1Ce7yCQeBxYkpki~DDdpu3F6XkT6Qh99x0YAxYEf7GMduJzSkE-L6aE7nPODK2jNslfp7MUVacwZLvNe4uOqJUyshqy~14Z8ZqLQ7DQ~OoPvsTPz8ExXdw__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 636px; height: 938px;\" width=\"1024\"></p>\r\n\r\n<p><em>Note: Rectangles with double side lines indicate&nbsp;updates that are done by the system.&nbsp;</em></p>\r\n\r\n<h5><a name=\"count-updates\" id=\"count-updates\"></a>Count Updates</h5>\r\n\r\n<p><strong>Table 1</strong></p>\r\n\r\n<div>&nbsp;</div>\r\n\r\n<div>\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px;\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Scenario Description</td>\r\n\t\t\t<td>Review Required?</td>\r\n\t\t\t<td>Submit Behavior</td>\r\n\t\t\t<td>Finish Behavior</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Single Counter</td>\r\n\t\t\t<td>No</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Count Line - Approved</p>\r\n\r\n\t\t\t<p>Count Request - Approved when all lines are approved, else Partially Approved</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Unsubmitted items are declined or submitted as 0 quantity based on the “Submit zero quantity for uncounted items” parameter config.</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Single Counter</td>\r\n\t\t\t<td>Yes</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Count Line - Counted</p>\r\n\r\n\t\t\t<p>Count Request - Counted when all lines are counted, else Partially Counted</p>\r\n\r\n\t\t\t<p>Submit will also trigger review and approve process.</p>\r\n\r\n\t\t\t<p>After Review & Approve process:</p>\r\n\r\n\t\t\t<p>Count Line - Approved</p>\r\n\r\n\t\t\t<p>Count Request - Approved when all lines are approved, else Partially Approved</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Unsubmitted items are declined or submitted as 0 quantity based on the “Submit zero quantity for uncounted items” parameter's config.</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Multiple Counters</td>\r\n\t\t\t<td>No</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Count Line - In Progress</p>\r\n\r\n\t\t\t<p>Count Request - In Progress</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Finish will approve lines and header.</p>\r\n\r\n\t\t\t<p>Count Line - Approved</p>\r\n\r\n\t\t\t<p>Count Request - Approved when all lines are approved, else Partially Approved</p>\r\n\r\n\t\t\t<p>Unsubmitted items are declined or submitted as 0 quantity based on the “Submit zero quantity for uncounted items” parameter's configuration.</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Multiple Counters</td>\r\n\t\t\t<td>Yes</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Count Line - In Progress</p>\r\n\r\n\t\t\t<p>Count Request - In Progress</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Finish will go through Review and Approval process.</p>\r\n\r\n\t\t\t<p>Count Line - Counted</p>\r\n\r\n\t\t\t<p>Count Request - Partially Counted if all lines are not yet done, else Counted</p>\r\n\r\n\t\t\t<p>Once approved by the user:</p>\r\n\r\n\t\t\t<p>Count Line - Approved</p>\r\n\r\n\t\t\t<p>Count Request - Approved when all lines are approved, else Partially Approved</p>\r\n\r\n\t\t\t<p>Unsubmitted items are declined or submitted as 0 quantity based on the “Submit zero quantity for uncounted items” parameter's configuration.</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n</div>\r\n\r\n<h4><a name=\"review\" id=\"review\"></a><a id=\"Review Count\" name=\"Review Count\"></a>Review</h4>\r\n\r\n<p>The review process is an optional step that allows store personnel to review any items with variances that exceed a configured threshold and either approve the count, or trigger a recount (see behavior for each below.)&nbsp;The review process can occur after counting is submitted (single counter) or finished (multiple counters). The review screen displays the counted items. Based on configuration, additional item details that include item image, department, style, color, and size can be displayed. Refer to the <a hqid=\"ID2239228\" href=\"/cycle-counting-process$itemdetails\">Configuration guide</a> for additional information. If an associate who is counting also has review permission, they can directly perform the review from the Counting UI or it can be performed later. If review is disabled, the counts are auto-approved without a separate review&nbsp;process. The ability to review is controlled by permissions.</p>\r\n\r\n<p>The \"Review counts that exceed variance threshold\" flag determines whether the review process is required.&nbsp;Refer to the <a hqid=\"2239228\" href=\"/cycle-count-configuration\">Configuration guide</a> for additional information.</p>\r\n\r\n<p>Based on a <a href=\"https://omni.helpdocsonline.com/cycle-count-configuration$exclude-picked-and-packed-quantities-while-determining-cycle-count-variance\">configuration</a>, the expected quantity used when determining variance is either obtained directly from the&nbsp;perpetual inventory&nbsp;(of the configured store disposition), or by subtracting picked and packed inventory from the perpetual. The latter can help decrease the labor needed to complete a cycle count and also increase accuracy by focusing the count on sellable inventory so that time isn't spent counting inventory that has already been picked or packed.&nbsp;</p>\r\n\r\n<p>The List Counted Items for Review API is used to get the list of eligible items for review.</p>\r\n\r\n<p><strong>Recount</strong> - If the reviewer chooses to recount, the count line is reset&nbsp;to 'Open' status&nbsp;so that any user can start counting it.&nbsp;The previous counted quantity and counted by information on the lines are&nbsp;reset.&nbsp;Recount counter field is incremented by 1 to indicate a new recount occurrence. From a process standpoint, it is recommended that a different user perform the recount to avoid repeating any discrepancies.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: The inventory snapshot is not taken again for the items sent for a recount. After recounting,&nbsp;the variances are computed based on the initial snapshot taken for the cycle count line.</div>\r\n\r\n<p>The Recount API sends&nbsp;the items to&nbsp;recount.</p>\r\n\r\n<p><span style=\"color:#9b59b6;\">The cycle count is listed on the cycle count listing screen with the label Recount Required when the item is marked for the recount.</span></p>\r\n\r\n<p><strong>Approve</strong> - If the reviewer chooses to approve, the count line is updated to Approved status.</p>\r\n\r\n<p>The Approve Lines API approves&nbsp;the count lines.</p>\r\n\r\n<h5><a name=\"review-overview\" id=\"review-overview\"></a>Review overview</h5>\r\n\r\n<p><img height=\"1371\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/3292/Screenshot%202022-09-12%20at%204_05_31%20PM.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1LzMyOTIvU2NyZWVuc2hvdCUyMDIwMjItMDktMTIlMjBhdCUyMDRfMDVfMzElMjBQTS5wbmciLCJDb25kaXRpb24iOnsiRGF0ZUxlc3NUaGFuIjp7IkFXUzpFcG9jaFRpbWUiOjE3NTQ3NTIxOTN9fX1dfQ__&Signature=IOHejiwkrSh3YiLCjjk9tyF86UepczkgSiSacbSG7zNC-Zcr2l-XeKdl9K5t666KQAUC2HfIVW3rRNlfEHFZ0KJQpCYhP37pq-NJYf4UrfEcJP15stWQ7Bjs3FflzZSFvT9G6TfdtAgIOFiA-cy2RVHTTJz2cEl6HZhEE3X9Fc~y1wBwSyqdXFMCGxxJvrWmHdpiBkeXjJPSajoZpEMLP70xRhYjE77d5~RNyNOP0mv1IYZM8mthgReop9yI5dm0Y~MYtQQA1eN7TwB~rvTHbY8lP6JA2vlG~pnbjHRA5xSWAX5ioKco0U-BHwY0KtdgAoskm8VNeNVQo4eRpM29zQ__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 640px; height: 857px;\" width=\"1024\"></p>\r\n\r\n<p><em>Note: Rectangles with double side lines indicate updates that are done by the system. All other shapes indicate user action.</em></p>\r\n\r\n<h5><a name=\"review-updates\" id=\"review-updates\"></a>Review Updates</h5>\r\n\r\n<p><strong>Table 2</strong></p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:613px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"row\">User Action</th>\r\n\t\t\t<th scope=\"col\">Line Status Updates</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 35px;\">Inventory Updates</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 172px;\">Counted Quantity Updates</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"row\">Recount</th>\r\n\t\t\t<td>Open</td>\r\n\t\t\t<td style=\"width: 33px;\">Not Updated</td>\r\n\t\t\t<td style=\"width: 169px;\">Reset to 0</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"row\">Approve</th>\r\n\t\t\t<td>Approved (for selected line)</td>\r\n\t\t\t<td style=\"width: 33px;\">Updated</td>\r\n\t\t\t<td style=\"width: 169px;\">\r\n\t\t\t<p>No updates (Already updated when counted)</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"row\">Approve All</th>\r\n\t\t\t<td>Approved (for all lines)</td>\r\n\t\t\t<td style=\"width: 33px;\">Updated</td>\r\n\t\t\t<td style=\"width: 169px;\">\r\n\t\t\t<p>No updates (Already updated when counted)</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h4><a name=\"inventory-updates\" id=\"inventory-updates\"></a><a id=\"Inventory Updates\" name=\"Inventory Updates\"></a>Inventory Updates</h4>\r\n\r\n<p>When a&nbsp;count line is approved using&nbsp;<a href=\"/cycle-counting-process$Submit Count\">Submit Counts</a>, <a href=\"/cycle-counting-process$Finish Counts\">Finish Counts</a> or <a href=\"/cycle-counting-process$Review Count\">Review Counts</a>, the following updates are performed:</p>\r\n\r\n<ol>\r\n\t<li>Supply events are published to update the on-hand inventory. The 'Adjustment' transaction type is used for updating the inventory with the Add or Subtract action. If&nbsp;the counted quantity and the expected quantity match, an inventory update is not sent. When the inventory is updated, following information is sent on the Inventory Supply Event to the Inventory Management for audit purposes:\r\n\t<ul>\r\n\t\t<li>Inventory Transaction Type - If the override store transaction type is configured for the store transaction type \"Cycle Count\", the inventory transaction type is populated with the override value. If no override is configured, the base&nbsp;value&nbsp;is sent.</li>\r\n\t\t<li>\r\n\t\t<p>Inventory Transaction ID&nbsp;-&nbsp;The countRequestId is sent to identify the cycle count transaction.</p>\r\n\t\t</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>If Inventory Audit is enabled for cycle count, an inventory audit record is also created for the approved items (refer to&nbsp;<a hqid=\"1969555\" href=\"/inventory-audit-process\">Inventory Audit Process</a>&nbsp;guide).&nbsp;</li>\r\n</ol>\r\n\r\n<div class=\"warning\"><strong>Important</strong>: Cycle counting always updates the on-hand available inventory for the given store. If Store Inventory and Fulfillment maintains multiple Store Dispositions, cycle counting can be done only for the disposition which has&nbsp;\"Store Disposition used for Cycle Counting\" = true. If no store disposition has \"Store Disposition used for Cycle Counting\" = true, then the disposition of \"Sellable Stock\" (which maps to the 'On-Hand Available' supply type)&nbsp;is used as default. Refer to the <a hqid=\"2239228\" href=\"/cycle-count-configuration\">Configuration guide</a> for additional information.</div>\r\n\r\n<p>Financial count reconciliation is performed in a separate system at the corporate level. Submitting the count completion simply updates inventory in the Inventory Management system.</p>\r\n\r\n<h5><a name=\"outbound-messages\" id=\"outbound-messages\"></a>Outbound Messages</h5>\r\n\r\n<p>Once&nbsp;the entire count request is approved, an outbound message can be sent to the host to notify that the store has completed the request.&nbsp;The outbound message is sent if the configuration \"Publish outbound on approval&nbsp;\" is enabled. The entire cycle count request is available as part of the outbound. See <a hqid=\"2239228\" href=\"/cycle-count-configuration\">Configuration guide</a> for additional details.</p>\r\n\r\n<p>Additionally, the Trigger Outbound API can be invoked to publish outbound messages using the count request information.</p>\r\n\r\n<h4><a name=\"connectivity-nbsp\" id=\"connectivity-nbsp\"></a>Connectivity&nbsp;</h4>\r\n\r\n<p>Cycle Count is designed to work on mobile devices which may lose connectivity during daily store operations. However, the following activities require connectivity:</p>\r\n\r\n<ul>\r\n\t<li>Initiate count</li>\r\n\t<li>Submit counts</li>\r\n\t<li>Finish counts</li>\r\n\t<li>Items to count&nbsp;- Edit quantity or mark out of stock</li>\r\n\t<li>Resume on another device</li>\r\n\t<li>Review counts</li>\r\n</ul>\r\n\r\n<h6><a name=\"state-transition-nbsp\" id=\"state-transition-nbsp\"></a><br>\r\n<span style=\"font-size: 1.5em; font-weight: 500;\">State Transition&nbsp;</span></h6>\r\n\r\n<h5><a name=\"count-request-line\" id=\"count-request-line\"></a>Count Request Line</h5>\r\n\r\n<address><img height=\"313\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/image(71).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1L2ltYWdlKDcxKS5wbmciLCJDb25kaXRpb24iOnsiRGF0ZUxlc3NUaGFuIjp7IkFXUzpFcG9jaFRpbWUiOjE3NTQ3NTIxOTN9fX1dfQ__&Signature=pHwigckcqiRGdimy-8hQlNkRRm35K0zREZdKbmvyFrrsMlYqZfWel2-0AEonC54-Fb7c-CD5bHkncZDow63uywLyazsmjAYW5NOHmLWrnS4stMvHx~HdwjclEemN93SvP0vDGDBSyG2nq3tLOVxXkMOlUbO8QtLVBAPOVQ214i5LCaaovhMrEXCC94-j71p2Yp3CSN-YpqOBHP~eSImeCrocYSeD7cg72NyhmY8-sK-p9j2vhqwo0jprGWx-ZimHeCmfs9tESMa2uGGucpoPrAKzRDLUrcHKwtREn-CIJSHn~3rrcYXNXBDgbUQKUmQX3PXR~OMNaJNm4aGUBE~MDA__&Key-Pair-Id=K2TK3EG287XSFC\" width=\"993\"></address>\r\n\r\n<address>&nbsp;</address>\r\n\r\n<h5><a name=\"count-request\" id=\"count-request\"></a><a id=\"State Transition - Count Request\" name=\"State Transition - Count Request\"></a>Count Request</h5>\r\n\r\n<div><img height=\"648\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/image(72).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1L2ltYWdlKDcyKS5wbmciLCJDb25kaXRpb24iOnsiRGF0ZUxlc3NUaGFuIjp7IkFXUzpFcG9jaFRpbWUiOjE3NTQ3NTIxOTN9fX1dfQ__&Signature=kVJqQ8EbibAs4uGCuPg1-T~zzzO45DKsQEbICs-i-mcp8Dql-kwm6zzWsFCEeTIz8OWI~OeC8qU-GgkGdirv-cwpzLPfZ82sP4AZ12vSL7-dE~9x-n3tMViP1WrW9aUiKSuWW5XMXqxGq5vilniN9gn2cIFWz4B7KzWdL8pI4iwpLsTN7eblZpX9hNUWvaydVbSkJtMGg7stgNo6RXFMwuqnLNvAyiOfC5KGRomhluAMWKgiXxi0PZ96O0-HGXcjfFOhkSXTu9jD1N1v3UgMJ2uvrkRS5xBOTbsPfE0Ojg6rqy2itcDpo67916InEvF8T8s8InrKMfYIRIT7uOPjaA__&Key-Pair-Id=K2TK3EG287XSFC\" width=\"1311\"></div>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"services\" id=\"services\"></a>Services</h4>\r\n\r\n<p>The&nbsp;APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><strong><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service</font></strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Component</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Group</strong></th>\r\n\t\t\t<th scope=\"col\"><strong><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service Endpoint</font></strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>List Cycle Count Requests</td>\r\n\t\t\t<td>Sim</td>\r\n\t\t\t<td>count-list-controller</td>\r\n\t\t\t<td>/sim/api/sim/count/listCycleCounts</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>List Count Request Lines and Tasks</td>\r\n\t\t\t<td>Sim</td>\r\n\t\t\t<td>count-list-controller</td>\r\n\t\t\t<td>/sim/api//sim/count/details/{countId}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Submit in progress Counts</td>\r\n\t\t\t<td>Sim</td>\r\n\t\t\t<td>count-submit-controller</td>\r\n\t\t\t<td>/sim/api/sim/count/submitCount</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Finish Count Request</td>\r\n\t\t\t<td>Sim</td>\r\n\t\t\t<td>count-submit-controller</td>\r\n\t\t\t<td>/sim/api/sim/count/finishCount</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Cancel Count Task</td>\r\n\t\t\t<td>Sim</td>\r\n\t\t\t<td>count-submit-controller</td>\r\n\t\t\t<td>/sim/api/sim/count/cancelTask</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Create Count Task for User</td>\r\n\t\t\t<td>Sim</td>\r\n\t\t\t<td>count-process-controller</td>\r\n\t\t\t<td>/sim/api/sim/count/createTask</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>List Counted Items for Review</td>\r\n\t\t\t<td>Sim</td>\r\n\t\t\t<td>count-list-controller</td>\r\n\t\t\t<td>/sim/api/sim/count/listCountedItemsForReview/{countId}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Recount</td>\r\n\t\t\t<td>Sim</td>\r\n\t\t\t<td>\r\n\t\t\t<p>count-process-controller</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>/sim<a href=\"https://side-store-1c.manh-dev.com/sim/swagger-ui.html?expandedMenuIds=storeInventoryConfig,storeInventoryDevTools,developerTools#!/count45process45controller/approveCountRequestLinesUsingPOST\">/</a>api/sim/count/recount</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p>Approve Lines</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Sim</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>count-process-controller</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>/sim/api/sim/count/approveLines</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Trigger Outbound</td>\r\n\t\t\t<td>Sim</td>\r\n\t\t\t<td>count-process-controller</td>\r\n\t\t\t<td>/sim/api/sim/count/triggerOutbound</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Create Cycle Count Request</td>\r\n\t\t\t<td>Sim</td>\r\n\t\t\t<td>Count Request Services</td>\r\n\t\t\t<td>/sim/api/sim/countRequest/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Menu Badge Count</td>\r\n\t\t\t<td>Sim</td>\r\n\t\t\t<td>Count Request Services</td>\r\n\t\t\t<td>/sim/api/sim/menuCounts</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<div id=\"\" style=\"left: 14.9884px; top: 2557.47px;\">&nbsp;</div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 45554,
  "scraped_at": "2025-08-09T22:04:53.963636",
  "content_clean": "Home ››Manhattan Active® Omni››Store››Process & Configuration Guides››Store Inventory & Fulfillment››Store Inventory Management››Cycle Count ››Cycle Count Process Cycle Counting Process Menu badge countCreate Count RequestCountSelect RequestInitiate Count Updates (first item on request is scanned)CountingDefault navigation to items to count screenItems to countGroupingCounted ItemsMultiple versus Single CountersPause & ResumeItem Level ReviewSubmit CountsFinish CountsCount UpdatesReviewReview overviewReview UpdatesInventory UpdatesOutbound MessagesConnectivity State Transition Count Request LineCount RequestServices Maintaining inventory accuracy is one of the biggest challenges retailers face regularly. Administrative errors, shrinkage and stock movements can cause discrepancies between the expected inventory level tracked by the inventory management system and the actual store inventory. The ability for store personnel to count merchandise on a regular basis is key to resolving these discrepancies and correcting the inventory levels. Cycle counting allows retailers to stay on the top of stock level by periodically counting a small portion of inventory at a time. The corporate office can send cycle count requests to store for selected items. A store user with appropriate permission can review and approve the cycle count request. Review can be turned on based on configuration. This document describes how to perform a cycle count that is initiated by the corporate office for stores which are not RFID-enabled. For information on how stores can create their own store-initiated cycle counts on the fly, refer to the Store-Initiated Cycle Count guide. For information on how RFID-enabled stores perform counts, refer to the Store Count guide. Note: To know more on the  cycle count activity during offline mode, please refer to the Store Offline Support page. Menu badge count A badge count on the Cycle Count menu shows the number of open and pending count requests that exist for the store, giving the store manager quick visibility to open work. The Get SIM Menu count service is used to get the list of open and pending count requests. Approved and Declined cycle counts are not included in the badge count. The cycle count which is marked for the recount is listed with the Recount Required label. Create Count Request A cycle count request is sent to the store by corporate. These count requests are interfaced from an external system, and a separate request is created per store before arriving at Store. Some key considerations for count request include: A modified version of the count request can be sent to a store, but only if the count has not yet been initiated by a user. Once initiated, the count is downloaded onto at least one mobile device, and any updates to the request are not synced to the device. Expected quantity should be updated directly in the Inventory Management system. A snapshot of on-hand inventory is captured from the Inventory Management system when the counting process begins. A particular item should be included only once in a count request. Count Select Request The user can choose from a list of cycle count requests for the store that are eligible for counting. The count list displays open or pending counts by default. User can apply a filter to view approved and declined counts, if needed. The list includes the information listed below, and sorts by ascending due date: Count identifier Description Start date Due date Current status Number of counted items and total number of items on the request Number of items ready for review (if user has review permission) A count request in any status other than \"Counted\", \"Approved\" or \"Declined\" is eligible for counting. After selecting a cycle count request to work on, counting is initiated once a valid item is scanned/entered. Items on the count request are downloaded to the device once the count request is selected for counting. Validations are performed to ensure that the scanned item exists on the request. Initiate Count Updates (first item on request is scanned) As and when, an item is scanned, an entry is made into the Count Additional Details. Cycle count tasks are always self-assigned by the user (i.e., assignment by a manager is not supported. Counted quantity of the item is incremented. The expected quantity is determined for all items on the request by taking a snapshot of perpetual inventory for the configured default store disposition from Inventory Management. If the perpetual inventory record is not available for an item, then the expected quantity is considered as zero. The expected quantity is updated based on the following: If the \"Exclude picked and packed quantities while determining cycle count variance\" flag is set to false or null, the expected quantity is set directly to the perpetual quantity. See the configuration section for more details. If the configuration is set to true, the expected inventory is set to the perpetual inventory (see above) minus picked/packed inventory in the store. This applies to inventory that has been picked or packed for customer orders, store-initiated transfers and pullbacks. Any inventory that is canceled after picking or packing is not excluded. The picked / packed inventory picture in the store is fetched when the first unit of a Cycle Count request is scanned, and it is not refreshed thereafter. Note: Once a count has been initiated, no inventory transactions should occur for the items included in the request until the count is approved. Counting Default navigation to items to count screen Based on the landing screen configuration, the \"Items to count\" screen can be loaded by default. The items to count screen shows the list of items which are pending for cycle count. If the configuration is turned off, the counted items screen is shown. Refer to the configuration guide for additional information. Items to count Items to count screen shows the list of items which are in the open status. Users can either scan an item or enter a barcode to count, including the item ID, UPC or vendor barcode. When the item is entered or scanned, it appears at the top, highlighted, and the scanned unit appears in front of the item, if the item quantity popup is disabled. Refer to the configuration guide for additional information about suppress quantity popup. Item's additional information can be displayed on the UI, it includes item image, department, style, color, and size. Refer to the Configuration guide for additional information. Users can also view the items additional details by clicking on the view action, which displays the item's short description, SKU code, department, color, style, and UPC code. It also comprises a Back button which redirects the user back to the Items to Count List screen. Users can navigate to the counted units screen to see the list of counted items. If the item's quantity popup is not disabled by configuration, the user scans the item or enters the barcode manually, the item quantity popup is displayed. Users can use the device's camera or manually enter the barcode to increase the counted quantity. Users can also directly edit the quantity using the minus (-) and plus (+) signs. If the item is marked for \"Scan Only\", the plus (+) sign will be disabled on the quantity popup. Quantity popup displays the counted quantity along with the item's short description and UPC code. Users can also mark an item as out of stock - This updates line quantity to zero. It does not reference the \"Submit zero quantity for uncounted items\" parameter below. User can select the Finish Count action - This requires additional permission in addition to the count permission. The Finish Count action performs the following: Confirms that any still uncounted items should not be counted. See Finish Counts section for explanation on update behavior for these uncounted lines. Performs the Submit Count API to update any \"In progress\" counts that are assigned to other users. Calls the Finish Count API. Note: In addition to being automatically displayed at the time of Submit Counts, users can also access the items to the count list during counting. Grouping Rather than viewing a flat list, items on the Items to Count UI can be grouped based on either store department or pick path optimization to make the counting process more efficient. Configuration defines whether the Items to Count UI shows items based on: No grouping - An ungrouped list of items is shown based on the sequence that they were sent in the count request. This is the default behavior. Store department grouping - Items are grouped based on the store department they belong to. Within a group, they are sequenced by ascending item ID. Pick Path optimization grouping - For retailers who have configured Pick Path Optimization, the same configuration can be leveraged to show a best travel path during counting. As with picking, the item's primary location is used when determining the best count sequence. When enabled, the primary and secondary pick location is shown on the Item Details UI. Items with no store layout are grouped under the \"Others\" heading. Refer to the Picking guide for additional information on PPO. If grouping is enabled and the 'Suppress item quantity popup when scanning an item for counting in Items to Count screen' is enabled, the last scanned item is moved to the top of its group. If the ''Suppress item quantity popup when scanning an item for counting in Items to Count screen' is enabled, the item is immediately removed once the quantity is entered. When the last item in the group is removed from the UI, the corresponding group heading is also removed. This functionality is applicable for both corporate and store-initiated cycle counts. The Counted Items and Review UI do not show groupings. Refer to the Configuration guide for more information. Counted Items The counted item screen shows a list of counted items along with counted units. The last counted item appears at the top, and it is highlighted. To continue counting, users can either scan an item or enter a barcode to count, including the item ID, UPC or vendor barcode. Once the item has been entered/scanned, units can be counted by performing additional scans. If the item is not marked as a scan-only item, units can also be recorded by incrementing the count or by directly entering the quantity. If the item is scan-only item, these operations are not allowed. However, regardless of the scan-only value, the count can be decremented in case a counting error is made. The scan-only flag can be specified at several levels and if found to be true at any level, it applies. The system first checks if true on the count line, if not then checks the count request, and if not finally item master. If all are false, the item is treated as not scan-only. When the user scans the other item for counting, the current scanned item has been moved to the counted items screen. If in case users finds an additional units of counted items which are moved to the counted items screen and user again scans the item for counting, then item is loaded on the tems to count screen and counted units are updated. Based on permissions, the user can view the details of \"In progress\" item counts including the SKU, department, style, color, size and item image. The number of lines in progress for that user is reflected as counting progresses. As users count, those scans are intermittently synced to the server when they have connectivity. When connectivity is lost, the counts are batched up and synced once connectivity is restored. At the time of the Submit Count action, if any items exist on the request for which counting has not yet started (lines still in 'Open' status), they are displayed on the items to count list. Refer to Items to count List for additional information. Note: An item cannot be marked as out of stock once it has been counted. Multiple versus Single Counters Configuration controls whether multiple counters can perform counts on a cycle count request, or only one user. The “Allow multiple users to count” flag controls this behavior. Refer to the Configuration guide for additional information. If this configuration is enabled, Multiple associates can perform counting in parallel Associates coordinate outside of the application on how to split the count amongst themselves. For example, a count could be split up based on item categories (i.e., men's items, women's items, children's items) or by geographical area (i.e., front room, back room, etc.) Multiple associates can contribute to the counts for the same item, but once an associate submits the count for a particular item that associate cannot count additional units for that item. For this reason, it is recommended that associates do not submit their counts until they are done with their portion of the count in case they come across additional units for an item in an unexpected area. An associate with Finish permission finishes the count request once they determine that all associates are done counting. Coordination among associates occurs outside of the application. All items on the count become available for review once the finish count action is performed. Thus, item level review is not supported in this mode. If this parameter is disabled, Only one counter can work on a request at a time. Once an associate begins the counting process, any other associates who attempt to access the count receive an error message. Similar to the multi counter scenario, an item cannot be recounted after it has been submitted. Item-level review is supported in this mode and can be enabled. Pause & Resume If an associate experiences an interruption while counting that results in navigating outside of the request (either on the same device or a different device), the user can reselect the count request and counted items. The user can view in progress counts once resumed counting. In case of a single counter scenario, the in-progress tasks assigned to the user must be completed by the same user and they cannot be reassigned to another user. Item Level Review Based on the configuration, users can review the count of a single item after submitting the count. In the items to count screen, users can either scan an item or enter the barcode to count, including the item ID, UPC or vendor barcode or user can swipe the item and tap on quantity to enter the count. Item scanning is not supported on the quantity popup screen. After counting of an item is completed, user can submit the count. User can mark an item out of stock. If item level review is required, then as soon as user initiates \"Out of Stock\" action for an item, zero quantity is immediately submitted. Note: Item level review is not supported when multiple associates can perform a cycle count. Note: Item level review is not supported when quantity popup is suppressed in the items to count screen. If review is enabled and item's counted quantity is within the configured threshold, the counts are automatically approved and the user is navigated to the items to count screen to complete counting of other pending items. If count of an item exceeds the configured threshold, UI navigates to the review counts screen where user can either approve the count or trigger a recount. If there are pending items for counting, the user is navigated back to the items to count screen to complete counting of the pending items. When the last item of the cycle count is approved, the interstitial screen is shown where user can decide to go to the home screen or cycle count list screen. Refer to the configuration guide for additional information Submit Counts Once the user finishes with their counting, they take the Submit Count action which submits the counts worked on by that user. If there are items whose counting has not yet started, a list of items to count is displayed (see Items to Count section.) However, if the entire count request has been completed, the user can tap on Finish which signifies that they are done counting the request. Tapping on Finish performs the Finish Counts updates (see Finish Counts section.) A user may batch up all their counting and submit once or multiple times as they make progress. While both are supported, there are two important considerations to keep in mind. Once an associate submits counts for one or more items, that associate cannot count additional units for those items. If the \"Bypass items to count counts UI upon submit for single user\" flag is enabled in single counter mode, the submit action automatically marks all uncounted items as out of stock (or declined based on the \"Submit zero quantity for uncounted items\" parameter). In this mode, the user should be certain that all counting is complete before submitting the count. Refer to the Configuration guide for additional information. If no units exists for an item, the user can submit the count for the item without counting any units. In this case, the status of all the count request lines are updated to \"Declined\". Declined items are not reported to Inventory Management System. Finish Counts Finish Count is the final user action required for the count and signifies that all counting for the request is done. This is true for both single and multiple counter modes. In case of multiple counters, if a user attempts to finish the count while one or more counts are still in progress (not submitted) by other users, they receive an error message. The \"Submit zero quantity for uncounted items\" parameter determines how to handle uncounted items during the Finish Counts process. If set to true, the quantity of these lines is updated to zero. If set to false, the quantity is not updated, and line status is updated to \"Declined\". Declined items are not reported to the Inventory Management system. Refer to the Configuration guide for additional information. A user may finish counts without counting any item from the count request. In this case, user intends to decline the count request. In such a case, status of all the count request lines and status of the cycle count request will be updated to \"Declined\". Declined items are not reported to Inventory Management System. The Summary screen is shown to the user when they finish the counting of the cycle count. The summary screen shows information about the total items of the cycle count, items counted by users and the total uncounted items or total items that will be submitted with zero counted quantity. The user can go back to the items to count screen from the summary if they would like to count the uncounted items. A final count request summary is displayed to the user with some count statistics. Single Counter - Count overview for all flows except Bypass Items to count flow: Multiple Counters - Count overview for all flows except Bypass Item to count flow: Count overview for Bypass items to count flow: Note: Rectangles with double side lines indicate updates that are done by the system. Count Updates Table 1 Scenario Description Review Required? Submit Behavior Finish Behavior Single Counter No Count Line - Approved Count Request - Approved when all lines are approved, else Partially Approved Unsubmitted items are declined or submitted as 0 quantity based on the “Submit zero quantity for uncounted items” parameter config. Single Counter Yes Count Line - Counted Count Request - Counted when all lines are counted, else Partially Counted Submit will also trigger review and approve process. After Review & Approve process: Count Line - Approved Count Request - Approved when all lines are approved, else Partially Approved Unsubmitted items are declined or submitted as 0 quantity based on the “Submit zero quantity for uncounted items” parameter's config. Multiple Counters No Count Line - In Progress Count Request - In Progress Finish will approve lines and header. Count Line - Approved Count Request - Approved when all lines are approved, else Partially Approved Unsubmitted items are declined or submitted as 0 quantity based on the “Submit zero quantity for uncounted items” parameter's configuration. Multiple Counters Yes Count Line - In Progress Count Request - In Progress Finish will go through Review and Approval process. Count Line - Counted Count Request - Partially Counted if all lines are not yet done, else Counted Once approved by the user: Count Line - Approved Count Request - Approved when all lines are approved, else Partially Approved Unsubmitted items are declined or submitted as 0 quantity based on the “Submit zero quantity for uncounted items” parameter's configuration. Review The review process is an optional step that allows store personnel to review any items with variances that exceed a configured threshold and either approve the count, or trigger a recount (see behavior for each below.) The review process can occur after counting is submitted (single counter) or finished (multiple counters). The review screen displays the counted items. Based on configuration, additional item details that include item image, department, style, color, and size can be displayed. Refer to the Configuration guide for additional information. If an associate who is counting also has review permission, they can directly perform the review from the Counting UI or it can be performed later. If review is disabled, the counts are auto-approved without a separate review process. The ability to review is controlled by permissions. The \"Review counts that exceed variance threshold\" flag determines whether the review process is required. Refer to the Configuration guide for additional information. Based on a configuration, the expected quantity used when determining variance is either obtained directly from the perpetual inventory (of the configured store disposition), or by subtracting picked and packed inventory from the perpetual. The latter can help decrease the labor needed to complete a cycle count and also increase accuracy by focusing the count on sellable inventory so that time isn't spent counting inventory that has already been picked or packed. The List Counted Items for Review API is used to get the list of eligible items for review. Recount - If the reviewer chooses to recount, the count line is reset to 'Open' status so that any user can start counting it. The previous counted quantity and counted by information on the lines are reset. Recount counter field is incremented by 1 to indicate a new recount occurrence. From a process standpoint, it is recommended that a different user perform the recount to avoid repeating any discrepancies. Note: The inventory snapshot is not taken again for the items sent for a recount. After recounting, the variances are computed based on the initial snapshot taken for the cycle count line. The Recount API sends the items to recount. The cycle count is listed on the cycle count listing screen with the label Recount Required when the item is marked for the recount. Approve - If the reviewer chooses to approve, the count line is updated to Approved status. The Approve Lines API approves the count lines. Review overview Note: Rectangles with double side lines indicate updates that are done by the system. All other shapes indicate user action. Review Updates Table 2 User Action Line Status Updates Inventory Updates Counted Quantity Updates Recount Open Not Updated Reset to 0 Approve Approved (for selected line) Updated No updates (Already updated when counted) Approve All Approved (for all lines) Updated No updates (Already updated when counted) Inventory Updates When a count line is approved using Submit Counts, Finish Counts or Review Counts, the following updates are performed: Supply events are published to update the on-hand inventory. The 'Adjustment' transaction type is used for updating the inventory with the Add or Subtract action. If the counted quantity and the expected quantity match, an inventory update is not sent. When the inventory is updated, following information is sent on the Inventory Supply Event to the Inventory Management for audit purposes: Inventory Transaction Type - If the override store transaction type is configured for the store transaction type \"Cycle Count\", the inventory transaction type is populated with the override value. If no override is configured, the base value is sent. Inventory Transaction ID - The countRequestId is sent to identify the cycle count transaction. If Inventory Audit is enabled for cycle count, an inventory audit record is also created for the approved items (refer to Inventory Audit Process guide). Important: Cycle counting always updates the on-hand available inventory for the given store. If Store Inventory and Fulfillment maintains multiple Store Dispositions, cycle counting can be done only for the disposition which has \"Store Disposition used for Cycle Counting\" = true. If no store disposition has \"Store Disposition used for Cycle Counting\" = true, then the disposition of \"Sellable Stock\" (which maps to the 'On-Hand Available' supply type) is used as default. Refer to the Configuration guide for additional information. Financial count reconciliation is performed in a separate system at the corporate level. Submitting the count completion simply updates inventory in the Inventory Management system. Outbound Messages Once the entire count request is approved, an outbound message can be sent to the host to notify that the store has completed the request. The outbound message is sent if the configuration \"Publish outbound on approval \" is enabled. The entire cycle count request is available as part of the outbound. See Configuration guide for additional details. Additionally, the Trigger Outbound API can be invoked to publish outbound messages using the count request information. Connectivity Cycle Count is designed to work on mobile devices which may lose connectivity during daily store operations. However, the following activities require connectivity: Initiate count Submit counts Finish counts Items to count - Edit quantity or mark out of stock Resume on another device Review counts State Transition Count Request Line Count Request Services The APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on each service. Service Component Group Service Endpoint List Cycle Count Requests Sim count-list-controller /sim/api/sim/count/listCycleCounts List Count Request Lines and Tasks Sim count-list-controller /sim/api//sim/count/details/{countId} Submit in progress Counts Sim count-submit-controller /sim/api/sim/count/submitCount Finish Count Request Sim count-submit-controller /sim/api/sim/count/finishCount Cancel Count Task Sim count-submit-controller /sim/api/sim/count/cancelTask Create Count Task for User Sim count-process-controller /sim/api/sim/count/createTask List Counted Items for Review Sim count-list-controller /sim/api/sim/count/listCountedItemsForReview/{countId} Recount Sim count-process-controller /sim/api/sim/count/recount Approve Lines Sim count-process-controller /sim/api/sim/count/approveLines Trigger Outbound Sim count-process-controller /sim/api/sim/count/triggerOutbound Create Cycle Count Request Sim Count Request Services /sim/api/sim/countRequest/save Menu Badge Count Sim Count Request Services /sim/api/sim/menuCounts"
}