{
  "success": true,
  "permalink": "electronicjournalprocess",
  "title": "Electronic Journal Process",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158737\" href=\"/point-of-sale\" class=\"breadcrumb-links\">Point of Sale</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3433322\" href=\"/pos-iris-guides\" class=\"breadcrumb-links\">POS Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3535917\" href=\"/backoffice-2\" class=\"breadcrumb-links\">BackOffice Transactions</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2172251\" href=\"/electronic-journal\" class=\"breadcrumb-links\">Electronic Journal</a></li><li> <span>››</span>Electronic Journal Process</li></ul>  \t\r\n\t\t<h2>Electronic Journal Process</h2>\r\n\r\n<p></p>\r\n\r\n<h4><a name=\"overview\" id=\"overview\"></a>Overview</h4>\r\n\r\n<p>Electronic journal is an essential feature that&nbsp;track&nbsp;transactions for control and loss prevention purposes.&nbsp;The data captured in electronic journal are the exact actions&nbsp;performed by a store associate on a transaction. This creates electronic duplicate of the paper journal tape, which allows store managers and sales audit personnel to view, query and analyze the data on-screen. EJ enables to quickly identify suspicious patterns, improprieties and human errors in register data, before these events impact the profitability. This improves loss prevention, and makes audits and searches more consistent with UI friendly search capability against the selected journal/Store&gt;Register. Tasks are completed without sorting through numerous rolls of journal paper, which saves valuable time and helps improve productivity.</p>\r\n\r\n<div class=\"tip\"><ul><li><a href=\"/electronicjournalprocess$overview\">Overview</a></li><li><a href=\"/electronicjournalprocess$filter-and-search-nbsp-the-transaction\">Filter and search&nbsp;the transaction</a><ul><li><a href=\"/electronicjournalprocess$seaching-offline-transactions\">Seaching Offline Transactions</a></li><li><a href=\"/electronicjournalprocess$search-results\">Search results</a></li></ul></li><li><a href=\"/electronicjournalprocess$transaction-detail\">Transaction detail</a></li><li><a href=\"/electronicjournalprocess$re-print\">Re-print</a></li><li><a href=\"/electronicjournalprocess$services\">Services</a></li></ul></div>\r\n\r\n<h4><a name=\"filter-and-search-nbsp-the-transaction\" id=\"filter-and-search-nbsp-the-transaction\"></a>Filter and search&nbsp;the transaction</h4>\r\n\r\n<p>Electronic journal can be accessed from the POS UI main menu, only users with specific permission &quot;ui::posservice::menu::electronicjournal&quot;&nbsp;will be having access to this menu option. The landing page for electronic journal is the search page where user can input the search criteria to filter the data that user is&nbsp;looking. The time zone used in the search queries and on search screen is the store time zone. If store time zone is not found in the location entity then device local time zone will be used to display on date pickers of search screen.</p>\r\n\r\n<p>The search fields are configurable,&nbsp;retailers can edit/delete/hide the existing search fields from config&nbsp;ui or postman. Users can use configuration&nbsp;to add more search fields as well. Each search fields are sequenced and categorized&nbsp;under&nbsp;logical groups.&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>All the transactions with order type = mPOS&nbsp;order will be eligible for Electronic journal based on the order configurations and publish EJ flag set up.</li>\r\n\t<li>All the search fields are configurable and sequenced within a group. Some of the search fields like register, store can take multiple values with comma separation.</li>\r\n\t<li>Search fields are further categorized and grouped logically, and the groups are configurable and sequenced as well.</li>\r\n\t<li>User can use search fields across different groups and within as well.</li>\r\n\t<li>Queries are built based on search fields populated/selected. Search condition&nbsp;across group is always AND condition but within a group is again configurable. All queries are made to elastic component to get the result.</li>\r\n\t<li>The POSService has a response template, so that data needs to be sent to UI and has to be messaged on server side based on configuration.</li>\r\n\t<li>Search can be performed across all type of transaction such as order, order with payment&nbsp;details and backoffice.</li>\r\n</ol>\r\n\r\n<div class=\"info\">Search on Electronic Journal is a Full value search, i.e. matchTypeId = Original. Users need to enter the entire value as in database or search index to get the search result. Partial search&nbsp;is not supported. The searchV2 config seed data for EJTransaction &gt; searchAttributeConfig.matchType is not used or is irrelevant for EJ.</div>\r\n\r\n<h5><a name=\"seaching-offline-transactions\" id=\"seaching-offline-transactions\"></a>Seaching Offline Transactions</h5>\r\n\r\n<p>Offline transactions&nbsp;can also be searched. These transactions are eligible to be searched only when the transactions are outbound to the central server. These transactions will have only the limited entries and final output of the transaction. Here are some key differences&nbsp;of the offline order in EJ details.</p>\r\n\r\n<ol>\r\n\t<li>All offline order operations will be listed for the same time,&nbsp;i.e, it will not have the trail of when the event happened but when the order was synced to central.\r\n\t<ol>\r\n\t\t<li>The timestamp of all the entries for a given transaction in EJ will be the created time when the order was created offline and not when it was synced to central.&nbsp;</li>\r\n\t</ol>\r\n\t</li>\r\n\t<li>Offline order date time using EJ filter criteria: To keep the offline order searchable for the same time when the order was created in offline, we made some changes to update the createdTimestamp and EventTimestamp to be the same as the capturedDate. For example: If an offline order was created at &quot;2024-07-16T13:11:33.694&quot; and synced at&nbsp;2024-07-16T20:11:33.727. When posting this offline order details to elastic, the created and event timestamp is updated to be&nbsp;&quot;2024-07-16T13:11:33.694&quot;, With this update the offline order is searchable for the same time it was created when&nbsp;offline.</li>\r\n\t<li>The offline orders will not capture mod types that are initiated from posservice and backoffice components. For example, ejModTypes starting with Pos::* and Backoffice::*\r\n\t<ol>\r\n\t\t<li>Except payment details. Payment details i.e. EJ mod types i.e. pos::Addtender, pos::Refundtender and pos::VoidTender will be systematically posted to elastic for offline orders and will be displayed in EJ details.</li>\r\n\t</ol>\r\n\t</li>\r\n</ol>\r\n\r\n<h5><a name=\"search-results\" id=\"search-results\"></a>Search results</h5>\r\n\r\n<p>The Search results from the elastic can be grouped by order or by actions performed by the user. User can choose the grouping on the search screen before searching for transaction data. Based on the &quot;group by order&quot; selection the search results will be displayed. Both the results have unique experience in displaying the data for retailers. User can click the back button to return to the search result screen.</p>\r\n\r\n<p>Pre-requisites:&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>&quot;Enable EJ&quot; should be &quot;true&quot; on POS general configurations under common config settings.</li>\r\n\t<li>&quot;Publish EJ&quot; under Publish EJ options should be &quot;true&quot; in order configuration for mpos&nbsp;config. This will publish all order mod type to EJ queue.</li>\r\n</ol>\r\n\r\n<p><strong>Group by order:</strong>&nbsp;This search result is displayed when the &quot;group by order&quot; is selected. And this is default search result screen&nbsp;if the user does not make any change explicitly. This search result screen displays order header information.</p>\r\n\r\n<ol>\r\n\t<li>Group by order is the default search result screen.</li>\r\n\t<li>The application is configured to return a maximum of 250 records for any search criteria.</li>\r\n\t<li>Each transaction will be displayed with a header section consisting of (Date & time, Store, Register, Order, Customer Last Name, Total). This header detail is not configurable.</li>\r\n\t<li>The header section time zone data for &quot;date and time&quot;&nbsp;will be displayed in the store time zone or device time zone, whichever is applicable. And the date and time format is picked from the POS General configuration.</li>\r\n\t<li>Store is the &quot;Display Id&quot; of the store.</li>\r\n\t<li>Search result contains order or backoffice&nbsp;transactions all sorted by created timestamp with the latest in the search results at the top.</li>\r\n</ol>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Search result by action</strong>: This search result is displayed when the &quot;group by order&quot; is not selected. The search result will be based on the mod type or actions that were recorded in the elastic. This result page will provide the list of all actions performed by users across all registers, stores and so on until&nbsp;specific&nbsp;search filter is used.</p>\r\n\r\n<ol>\r\n\t<li>Default pagination is 20 transactions. User&nbsp;can load next 20 by scroll down for more and so forth.</li>\r\n\t<li>The search result contains actions/mod type along with some order header information like (OrderId, Store, Register).</li>\r\n\t<li>Each mod type/Action will display configured field level information. These fields at mod types are all configurable.</li>\r\n\t<li>All the order actions are represented by small round green circle. If two subsequent actions happen on the same order then it will be grouped under the same header.&nbsp;</li>\r\n\t<li>The user can click on details at order action level which traverses to transaction details to see all the actions in that order.</li>\r\n\t<li>Search result contains order or back office&nbsp;transactions all sorted by event timestamp with latest in the search results.</li>\r\n</ol>\r\n\r\n<h4><a name=\"transaction-detail\" id=\"transaction-detail\"></a>Transaction detail</h4>\r\n\r\n<p>User can navigate to transaction details screen from the search results to view all the actions performed on any individual order. The transaction details give an overview of all the mod type/actions sorted by event timestamp sorted chronologically within the selected transaction.&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>Transaction details has pagination to get first 20 mod type and get subsequent when user scrolls down.</li>\r\n\t<li>All mod types/actions are displayed with small&nbsp;green round circle and&nbsp;event timestamp. If any action has a child action then it is separated by dotted lines without green circle.</li>\r\n\t<li>Each mod type/action displays&nbsp;fields and field values. These fields are configurable for each mod types. If any field does not have value, then it will be hidden on the UI. No fields will be displayed with blank values.</li>\r\n\t<li>Transaction overview is displayed on the screen with details of order id, date & time, store, register information.</li>\r\n\t<li>This screen has navigation such as back, reprint receipt, previous and next</li>\r\n</ol>\r\n\r\n<ul style=\"margin-left: 80px;\">\r\n\t<li>Back - Navigates to search results</li>\r\n\t<li>Reprint receipt - Navigates to reprint screen</li>\r\n\t<li>Previous - Will display the transaction details of the previous record in the search result. If this is the first record in the search result then this button will be disabled.</li>\r\n\t<li>Next -&nbsp;Will display the transaction details of the next&nbsp;record in the search result. If this is the last record in the search result then this button will be disabled.</li>\r\n</ul>\r\n\r\n<div class=\"info\">Note: Some details may appear more than once on the EJ as they may be captured multiple times within the order. Ex: Item A&#39;s selling price iis $20. User overrides price to $15 as it is marked incorreclty. Manager overrides the price further for customer service related issue to $10. Both overrides will appear on the EJ results.</div>\r\n\r\n<h4><a name=\"re-print\" id=\"re-print\"></a>Re-print</h4>\r\n\r\n<p>Electronic journal provides an ability to re-print or re-email&nbsp;original&nbsp;receipt from the&nbsp;transaction details screen. The reprinted receipt will have a duplicate label. If the original&nbsp;receipt contains any gift receipt, the same will be printed using this feature. This is applicable only for order transaction. The backoffice transactions are not eligible for reprint. This option is only possible when the electronic journal is used from device.</p>\r\n\r\n<h4><a name=\"services\" id=\"services\"></a>Services</h4>\r\n\r\n<p>The following APIs are the key APIs related to Electronic Journal.&nbsp;Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 1213px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 259px;\"><span style=\"font-style: inherit;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service</font></span></th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 118px;\"><span style=\"font-style: inherit;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Component</font></span></th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 300px;\"><span style=\"font-style: inherit;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Group</font></span></th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 520px;\"><span style=\"font-style: inherit;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service Endpoint</font></span></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 256px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">EJ Search&nbsp;</font></td>\r\n\t\t\t<td style=\"margin: 0px; width: 116px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">posService</font></td>\r\n\t\t\t<td style=\"margin: 0px; width: 297px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">POS Service Controller</font></td>\r\n\t\t\t<td style=\"margin: 0px; width: 517px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">POST /storefacade/api/storefacade/posservice/fetchSearchResults</font></td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 256px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">EJ Reprint</font></td>\r\n\t\t\t<td style=\"margin: 0px; width: 116px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">posService</font></td>\r\n\t\t\t<td style=\"margin: 0px; width: 297px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Receipt Service Controller</font></td>\r\n\t\t\t<td style=\"margin: 0px; width: 517px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">POST </font>storefacade/api/storefacade/receipt/generateReceiptForPrintAndEmail</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 256px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Elastic Search</font></td>\r\n\t\t\t<td style=\"margin: 0px; width: 116px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">posService</font></td>\r\n\t\t\t<td style=\"margin: 0px; width: 297px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">elastic-search Service Controller</font></td>\r\n\t\t\t<td style=\"margin: 0px; width: 517px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">POST /api/awpf/elastic/search</font></td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 16029,
  "scraped_at": "2025-08-09T22:35:37.446151"
}