{
  "id": "2596256",
  "permalink": "exchanges",
  "title": "Exchanges",
  "type": "topic",
  "level": 4,
  "path": "Manhattan Active® Omni/Order Management/Process & Configuration Guides/Returns & Exchanges/Exchanges",
  "raw_item": {
    "id": "2596256",
    "text": "Exchanges",
    "title": "Exchanges",
    "permalink": "exchanges",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "129591",
    "parent": "f;129591",
    "created_date": "1594017951",
    "modified_date": "1751611353",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "6"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2161123\" href=\"/returns-exchanges-2\" class=\"breadcrumb-links\">Returns & Exchanges</a></li><li> <span>››</span>Exchanges</li></ul>  \t\r\n\t\t<h2><span style=\"font-size:24px;\">Exchanges</span></h2>\r\n\r\n<p></p>\r\n\r\n<a href=\"/returnlabeltracking\" hqid=\"3153241\">Previous</a> | <a href=\"/returns-shipped-to-distribution-center\" hqid=\"3385085\">Next</a>\r\n<p>&nbsp;</p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/exchanges$overview\">Overview</a></li><li><a href=\"/exchanges$process-flow-nbsp\">Process flow&nbsp;</a></li><li><a href=\"/exchanges$exchange-order-creation\">Exchange Order Creation</a></li><li><a href=\"/exchanges$exchange-order-line-pricing\">Exchange Order Line Pricing</a></li><li><a href=\"/exchanges$exchange-updates\">Exchange Updates</a><ul><li><a href=\"/exchanges$exchange-line-cancellations\">Exchange Line Cancellations</a></li><li><a href=\"/exchanges$exchange-line-holds\">Exchange Line Holds</a><ul><li><a href=\"/exchanges$exchange-line-holds-on-variance\">Exchange Line Holds on Variance</a></li></ul></li><li><a href=\"/exchanges$even-exchange-updates\">Even Exchange Updates</a></li></ul></li><li><a href=\"/exchanges$configuration\">Configuration</a><ul><li><a href=\"/exchanges$how-to-configure-pricing-of-nbsp-even-exchanges\">How to Configure Pricing of&nbsp;Even Exchanges</a></li><li><a href=\"/exchanges$how-to-configure-exchange-holds\">How to Configure Exchange Holds</a></li></ul></li><li><a href=\"/exchanges$order-to-exchange-mappings\">Order to Exchange Mappings</a></li><li><a href=\"/exchanges$troubleshooting\">Troubleshooting</a><ul><li><a href=\"/exchanges$exchange-line-hold-not-resolved-after-line-verification\">Exchange line hold not resolved after line verification</a></li><li><a href=\"/exchanges$even-exchange-getting-converted-to-uneven-exchange\">Even exchange getting converted to uneven exchange</a></li></ul></li><li><a href=\"/exchanges$related-articles-nbsp\">Related Articles&nbsp;</a></li></ul></div>\r\n\r\n<h3><a name=\"overview\" id=\"overview\"></a>Overview</h3>\r\n\r\n<p>There are two types of exchanges:</p>\r\n\r\n<ul>\r\n\t<li><strong>Even Exchange&nbsp;</strong>(Also referred to as same style exchange): When the customer would like to exchange&nbsp;the&nbsp;product&nbsp;for the exact same item, (same style,&nbsp;size or color) it is called an even exchange. Even exchanges can also be used for zero-dollar replacements, wherein the customer received a damaged item, and they need to receive a replacement. Note that,&nbsp;irrespective of the original delivery method for the customer order, exchange order&nbsp;uses&nbsp;Ship To Address as the delivery method.</li>\r\n\t<li><strong>Uneven Exchange&nbsp;</strong>(Also referred to as new style exchange):&nbsp;When the customer&nbsp;would like to exchange&nbsp;the&nbsp;product for a completely new item (different style), it is called an uneven exchange. The new product can be more or less expensive than the original item. In such cases, the balance will either be refunded to the customer, or the customer will need to provide payment for the balance.</li>\r\n</ul>\r\n\r\n<p>Exchange orders can be created with receipt expected or receipt not expected depending on whether the item that is being exchanged for is expected to be received back by the warehouse or not.&nbsp;</p>\r\n\r\n<div class=\"info\">Note: The quantity for the same style exchange order line will automatically match the quantity of the corresponding return line and cannot be changed.</div>\r\n\r\n<h3><a name=\"process-flow-nbsp\" id=\"process-flow-nbsp\"></a>Process flow&nbsp;</h3>\r\n\r\n<p><img height=\"349\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/image(439).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL2ltYWdlKDQzOSkucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUxODUzfX19XX0_&Signature=UM3shw9bAKqmd7rbPRf4CK8Kyyowmq22LXJbrFnAxRI02rZgiXuhmvhuMIQtbDmmVHcu80K5l3UeiGQMBQylpIrMdNzJGyGNq5OJ2ti36YJmfbq7y3vJLGGauDd7SrSvGzPdc3LOKPy5uz2nMFrZpevXeMDEHKss5~v2gI3ALdmVLpdhD7~JogEv9bpJKs2fSskfXYx5N5pZMgn2-3MyXuUHEkS66qan9l3LL8Z8QxZW3iNhbO~bbf7NuXZw8N4HOPzmsGuB1RlQYXGVhcON~CDp~13HcjDsEGeOtk5Pt7sNax0exzYXEoIcK4nZ~4na0XT1QHU~Mfs9UShixxkYUQ__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 1285px; height: 273px;\" width=\"1643\"></p>\r\n\r\n<h3><a name=\"exchange-order-creation\" id=\"exchange-order-creation\"></a><a id=\"exchange-order-creation\" name=\"exchange-order-creation\"></a>Exchange Order Creation</h3>\r\n\r\n<p>An exchange order comprises of return lines and sale lines. If a return line and an even exchange line (identified by isEvenExchange = true) with the same parent order line exist on an order, then this constitutes a same style or even exchange. If a return line and sale lines (identified by isEvenExchange = false) exist on an order, then this constitutes a new style or uneven exchange. Multiple new style items can be added to an order. For example, if a customer returned a sweater from original order line 1 for the same sweater in a different color, then a return line and an even exchange line exist on the order, both with reference to order line 1. If a customer returns a sweater from original order line 1&nbsp;for a jacket and a bracelet, then a return line and two sale lines&nbsp;exist on the order; the return line references order line 1, but the sale lines do not.</p>\r\n\r\n<p>If the attribute \"IsExchangable\" is set to 'False' by default, users are restricted from creating Exchange Returns. However, this can be overridden by giving appropriate permissions to the Users on the DS UI. External systems should look at this field and take appropriate decisions on the behavior. Uneven exchange lines are processed identically as&nbsp;regular sale items; uneven exchange items are sent through pricing, promotions, S&H, and tax. This section describes how even exchange items are processed.</p>\r\n\r\n<div class=\"tip\">For a even exchange the system assumes that the item is returnable (IsReturnable = true)&nbsp;&nbsp;by default. If the item is not configured as returnable (IsReturnable = false) a even exchange cannot be created for that item.&nbsp;</div>\r\n\r\n<h3><a name=\"exchange-order-line-pricing\" id=\"exchange-order-line-pricing\"></a><a id=\"Exchangepricing\" name=\"Exchangepricing\"></a>Exchange Order Line Pricing</h3>\r\n\r\n<p>Even exchange order lines&nbsp;can be priced in two ways&nbsp;based on configuration. The first option is to copy&nbsp;the price, charges, discounts, and taxes from the original order line, such that the customer is charged zero dollars for an even exchange order. For example, if a customer purchased&nbsp;1 unit&nbsp;of an item with a $220 unit price, $10 S&H, and $10 tax for a total of $240, then if the configuration for re-pricing&nbsp;even exchanges is disabled, the even exchange line is updated with a $220 unit price, $10 S&H, and $10 tax for a total of $240. If an exchange is created against a multi-unit order line, then charges, taxes, and discounts are prorated for the exchange line quantity. For example, if an original order line for 2 units has&nbsp;a $110 unit price, $10 S&H, and $10 tax for a total of $240, then when a 1-unit even exchange line is created against this order line, the exchange&nbsp;line unit price is set to $110, S&H is $5, and tax is $5.</p>\r\n\r\n<p>The second option is to re-price the even exchange line by sending&nbsp;it through pricing, promotions, S&H, and tax like an uneven exchange line. This second option is used when the customer should be charged the current sale price, whether it has increased or decreased since the original order was placed.&nbsp;If the configuration for re-pricing even exchanges is enabled, then the even exchange item is priced based on the current pricing, S&H, and tax rules, which could result in a total greater than or lesser than the original line total.</p>\r\n\r\n<p>If an exchange line is priced by an external system, then the&nbsp;isAlreadyPriced, isAlreadyTaxed, and isAlreadyCharged attributes in the order interface can be used. If isAlreadyPriced is true for an exchange line&nbsp;and re-price even exchanges are&nbsp;disabled, then the unit price on the order import is saved, and the unit price is not copied from the parent order line. If isAlreadyTaxed or isAlreadyCharged is true for an exchange line and re-price even exchanges are disabled, then taxes or charges are not copied from the parent order line, but rather the imported taxes or charges are saved.&nbsp;If isAlreadyPriced, isAlreadyTaxed, or isAlreadyCharged is true for an exchange line and re-price even exchanges are&nbsp;enabled, then the order line is saved with the imported data, and no call is made to pricing, promo, S&H, or tax.&nbsp; The RePriceEvenExchange attribute controls this behavior.&nbsp; Refer to the How to section to understand&nbsp;<a href=\"/exchanges$re-price1\">How to Configure the&nbsp;Re-Price Even Exchange Parameter</a></p>\r\n\r\n<h3><a name=\"exchange-updates\" id=\"exchange-updates\"></a>Exchange Updates</h3>\r\n\r\n<h4><a name=\"exchange-line-cancellations\" id=\"exchange-line-cancellations\"></a><a id=\"exchange-line-cancellations\" name=\"exchange-line-cancellations\"></a>Exchange Line Cancellations</h4>\r\n\r\n<p>Exchange line cancellations are permitted until any quantity on the line is in \"Released\"&nbsp;status, which is&nbsp;based on the order modification configuration.&nbsp;When an exchange line is canceled, the following updates occur:</p>\r\n\r\n<ul>\r\n\t<li>The exchange&nbsp;line quantity moves to \"Canceled\" status</li>\r\n\t<li>Any header charges, taxes, and discounts associated with the line are canceled or prorated against&nbsp;remaining exchange lines.</li>\r\n\t<li>No update to return credit occurs; when the return item(s) are received, any remaining return credit is issued as a refund.</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: In even exchange orders, canceling a return order line will cancel the exchange order line. However, for uneven exchange orders, cancelling a return order line will not cancel the exchange order line.</div>\r\n\r\n<h4><a name=\"exchange-line-holds\" id=\"exchange-line-holds\"></a><a id=\"exchange-line-holds\" name=\"exchange-line-holds\"></a>Exchange Line Holds</h4>\r\n\r\n<p>When an order is created with the ship to return center and exchange lines, even or uneven, the exchange lines are put on hold until the return items are received. This ensures that all return items have been received or canceled before any exchange items are fulfilled. This applies only to ship to return center order lines where receipt of the items is expected; returns and exchanges made in store are not subject to such holds.</p>\r\n\r\n<p>Exchange line holds are resolved when all applicable return lines are received; partial returns do not systematically resolve the corresponding exchange line hold.</p>\r\n\r\n<p>For example, if an order has a ship to return center order line for 2 units and an even exchange line, then upon creation, the even exchange line is put on hold with reason Return Items Pending. If one return unit is received, then the return line has one unit in \"Returned\" status and one in \"Pending Return\". When the second unit is received, then all return units are in \"Returned\" status, and the exchange line hold is resolved. The exchange line is now free to be released for fulfillment.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: The estimated ship/delivery dates of exchange lines are calculated by promising at the time of allocation. If exchange lines are held until return items are received, then these estimated dates may be inaccurate. Currently, there is no ability to recalculate the estimated ship/delivery dates at the time return items are received.</div>\r\n\r\n<h5><a name=\"exchange-line-holds-on-variance\" id=\"exchange-line-holds-on-variance\"></a>Exchange Line Holds on Variance</h5>\r\n\r\n<p>When a return line item is verified, its associated even exchange line&nbsp;(IsEvenExchange=true) will be placed on hold if there is a quantity or condition variance on the return line. In addition, if any return line without an even exchange line is verified with a variance (quantity or condition), all the uneven exchange lines (IsEvenExchange=false) on the return order will be placed on hold. Exchange line holds should be resolved manually. However, if there is a quantity variance on the return line and auto-resolve quantity variance is enabled, the holds will be removed automatically.&nbsp;Set the hold type for exchange on variance&nbsp;by configuring&nbsp;this parameter in&nbsp;the&nbsp;Returns & Exchanges&nbsp;section of the <a href=\"https://omni.helpdocsonline.com/return_exchange_configurations$exchange-holds\">Order Configuration UI</a>.</p>\r\n\r\n<div class=\"tip\"><strong>Note: </strong>The new hold (Return Item Discrepancy) will be put on hold on the exchange line only after the existing hold (Return Items Pending) is removed.</div>\r\n\r\n<p>For example,&nbsp;</p>\r\n\r\n<p>'Status to Unhold Exchange Lines' is set to Returned status and the return verification policy is set to 'Return order',</p>\r\n\r\n<p>Use Case 1:&nbsp;</p>\r\n\r\n<p>If a return order contains a return line with 2 units and an associated even exchange line, then upon creation, the exchange line is placed on hold with the reason \"Return Items Pending\". If return line is verified with a quantity variance (1 quantity is verified), the return line status is updated to \"Returned,\" the existing \"Return Items Pending\" hold on the exchange line is removed, and a new hold with the reason \"Return Item Discrepancy\"&nbsp;is applied to the exchange line. If auto resolve quantity variance is enabled, one quantity which is not verified will be canceled and hold on an even exchange line will be removed.&nbsp;</p>\r\n\r\n<p>Use Case 2:</p>\r\n\r\n<p>If a return order contains two return lines, both having associated even exchange lines, then upon&nbsp;order creation, both exchange lines are placed on hold with the reason \"Return Items Pending\". If one of the return lines is verified with a condition variance, the return line status is updated to \"Returned,\" and the existing \"Return Items Pending\" hold on both exchange lines remains unchanged. If the other return line is then verified without any variance, the \"Return Items Pending\" hold is removed from both exchange lines. A new hold with the reason \"Return Item Discrepancy\" is applied to the exchange line associated with the return line that had the variance, while the exchange line associated with the return line verified without variance is fully released for further processing.</p>\r\n\r\n<p>Use Case 3:</p>\r\n\r\n<p>If a return&nbsp;order contains two return lines, one return line being a pure return and the other having an associated even exchange line, the associated exchange line is initially placed on hold with the reason \"Return Items Pending\" upon order creation. If the pure return line is verified with a condition variance, the existing hold on the even exchange line remains unchanged. If the even exchange return line is verified with a quantity variance, the existing \"Return Items Pending\" hold on its associated exchange line is removed and replaced with a new hold, \"Return Item Discrepancy\". If the even exchange return line is verified without any variance, the \"Return Items Pending\" hold on the associated exchange line is removed, and the line is fully released for further processing.</p>\r\n\r\n<p>Use Case 4:</p>\r\n\r\n<p>If a return order contains a return line with an associated even exchange line and an uneven exchange line (sale), both exchange lines are initially placed on hold with the reason \"Return Items Pending\" upon order creation. If the return line is verified with a condition variance, the \"Return Items Pending\" hold is removed from both the even and uneven exchange lines. A new hold with the reason \"Return Item Discrepancy\" is applied only to the even exchange line and the uneven exchange line is fully released for further processing.</p>\r\n\r\n<p>Use Case 5:</p>\r\n\r\n<p>If an order contains a pure return line and two uneven exchange lines (sale), both uneven exchange lines are placed on hold with the reason \"Return Items Pending\" upon order creation. If the return line is verified with a condition variance, the \"Return Items Pending\" hold is removed from both uneven exchange lines. A new hold with the reason \"Return Item Discrepancy\" is applied to both uneven exchange lines.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"even-exchange-updates\" id=\"even-exchange-updates\"></a><a id=\"even-exchange-updates\" name=\"even-exchange-updates\"></a>Even Exchange Updates</h4>\r\n\r\n<p>Only certain updates to even exchange order lines are supported if the re-pricing of even exchanges is disabled. If the re-pricing of even exchange lines is enabled, then more line updates (such as shipping method upgrade, address change, etc.) can be supported in the order component, because the charges, taxes, and discounts will be recalculated. However, if re-pricing is disabled, limited updates are supported: cancellations, notes, appeasements, and adding payment (if required).&nbsp;</p>\r\n\r\n<h3><a name=\"configuration\" id=\"configuration\"></a>Configuration</h3>\r\n\r\n<h4><a name=\"how-to-configure-pricing-of-nbsp-even-exchanges\" id=\"how-to-configure-pricing-of-nbsp-even-exchanges\"></a><a id=\"re-price1\" name=\"re-price1\"></a>How to Configure Pricing of&nbsp;Even Exchanges</h4>\r\n\r\n<p>Even exchange order lines&nbsp;can be priced in two ways. The first method is to copy&nbsp;the price, charges, discounts, and taxes from the original order line, such that the customer is charged zero dollars for an even exchange order. The second method is to&nbsp;re-price the even exchange line by sending&nbsp;it through pricing, promotions, S&H, and tax, like an uneven exchange line. This second option is used when the customer should be charged the current sale price, whether it has increased or decreased since the original order was placed</p>\r\n\r\n<p>The setting&nbsp;Re-Price Even Exchange Lines&nbsp;controls which mode is used. If re-price is enabled, then an&nbsp;even exchange item is priced based on the current pricing, S&H, and tax rules, which could result in a total greater than or less than the original line total. If re-price is disabled, then the price, taxes, charges, and discounts are retrieved from the parent order.&nbsp;Configure this parameter in&nbsp;the&nbsp;Returns & Exchanges&nbsp;section of the <a href=\"https://omni.helpdocsonline.com/return_configurations$re-price-even-exchange\">Order Configuration UI</a>.</p>\r\n\r\n<h4><a name=\"how-to-configure-exchange-holds\" id=\"how-to-configure-exchange-holds\"></a><a id=\"exchange-holds\" name=\"exchange-holds\"></a>How to Configure Exchange Holds</h4>\r\n\r\n<p>When an order is created with ship to return center and exchange lines, even or uneven, the exchange lines are put on hold until the return items are received. You can configure these&nbsp;parameters&nbsp;in&nbsp;the<em>&nbsp;</em>Returns & Exchanges section of the <a href=\"https://omni.helpdocsonline.com/return_exchange_configurations$exchange-holds\">Order Configuration UI</a>.</p>\r\n\r\n<p>The Exchange Hold Type&nbsp;setting indicates the type of hold which is applied on even and uneven exchange lines when return items have not yet been received. For example, if the exchange hold type is&nbsp;ReturnItemsPending, then when an order is created with a ship to return center line and an even exchange line, a hold is applied to the even exchange line with hold type&nbsp;ReturnItemsPending.&nbsp;</p>\r\n\r\n<p>The&nbsp;Status to Unhold Exchange Lines&nbsp;setting indicates the status in which return units must be for any exchange lines to be unheld.&nbsp;The status to unhold exchanges should be set to Returned, because advance exchanges are not supported. This means that all quantity for ship to return center order lines must be in Returned status for the holds on the&nbsp;even and uneven exchange lines to be resolved.&nbsp;In case of line verification, all the exchange lines should be verified, then the hold will be removed. If any status other than Returned is used, then custom logic needs to be added to ensure that the customer is charged for the advance exchange, if the return items are not shipped.</p>\r\n\r\n<h3><a name=\"order-to-exchange-mappings\" id=\"order-to-exchange-mappings\"></a>Order to Exchange Mappings</h3>\r\n\r\n<p>When an exchange line is created and the data is null on the exchange during creation, the below data is fetched from the parent order line and saved on the exchange. If the data is not null, then the imported data is saved.</p>\r\n\r\n<table border=\"1\" style=\"width:1000px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\" style=\"width: 290px; text-align: center;\"><strong>Attributes to copy to exchange order, if null</strong></th>\r\n\t\t\t<th scope=\"col\" style=\"text-align: center; width: 682px;\"><strong>Notes</strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"2\"><strong>Order Attributes</strong></td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">\r\n\t\t\t<ul>\r\n\t\t\t\t<li>CustomerId</li>\r\n\t\t\t\t<li>CustomerFirstName</li>\r\n\t\t\t\t<li>CustomerLastName</li>\r\n\t\t\t\t<li>CustomerPhone</li>\r\n\t\t\t\t<li>CustomerEmail</li>\r\n\t\t\t\t<li>CustomerTypeId</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 680px;\">These attributes are copied only if CustomerId and CustomerFirstName are null on the exchange order. If CustomerId<em>&nbsp;</em>and CustomerFirstName are null, then all of these attributes are replaced with the value from the original order. Otherwise, none of these values are copied.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">\r\n\t\t\t<ul>\r\n\t\t\t\t<li>ParentOrderId</li>\r\n\t\t\t\t<li>ParentOrderLineId</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 680px;\">&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">\r\n\t\t\t<p>CurrencyCode</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 680px;\">&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">\r\n\t\t\t<ul>\r\n\t\t\t\t<li>IsTaxExempt</li>\r\n\t\t\t\t<li>TaxExemptId</li>\r\n\t\t\t\t<li>TaxExemptReason</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 680px;\">These attributes are copied only if all three are null on the exchange order.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">\r\n\t\t\t<p>ChargeDetails</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 680px;\">Prorated for the exchange quantity. Copied from original order if isAlreadyCharged = false.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">\r\n\t\t\t<p>TaxDetails</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 680px;\">Prorated for the exchange quantity.Copied from original order if isAlreadyTaxed = false.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"2\" rowspan=\"1\"><strong>Order Line Attributes</strong></td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">UnitPrice</td>\r\n\t\t\t<td style=\"width: 680px;\">Copied from original order if isAlreadyPriced = false.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">OriginalUnitPrice</td>\r\n\t\t\t<td style=\"width: 680px;\">&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">IsPriceOverridden</td>\r\n\t\t\t<td style=\"width: 680px;\">&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">IsReturnable</td>\r\n\t\t\t<td style=\"width: 680px;\">If this attribute is set to 'False' by default, users are restricted from creating returns. However, this can be overridden by giving appropriate permissions to the Users on the DS UI. External systems should look at this field and take appropriate decision on the behavior.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">IsGift</td>\r\n\t\t\t<td style=\"width: 680px;\">&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">PaymentGroupId</td>\r\n\t\t\t<td style=\"width: 680px;\">&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">\r\n\t\t\t<ul>\r\n\t\t\t\t<li>ItemDescription</li>\r\n\t\t\t\t<li>ItemStyle</li>\r\n\t\t\t\t<li>ItemBrand</li>\r\n\t\t\t\t<li>ItemSize</li>\r\n\t\t\t\t<li>ItemColorDescription</li>\r\n\t\t\t\t<li>ItemSeason</li>\r\n\t\t\t\t<li>ProductClass</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 680px;\">If any attribute in this list is null on the exchange order, then all attributes are copied from the original order.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">IsTaxIncluded</td>\r\n\t\t\t<td style=\"width: 680px;\">&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">ShipToAddress</td>\r\n\t\t\t<td style=\"width: 680px;\">If the original order ship to address is null, then pull the preferred address for the customer.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">ChargeDetails</td>\r\n\t\t\t<td style=\"width: 680px;\">Prorated for the exchange quantity. Copied from original order if isAlreadyCharged = false.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">TaxDetails</td>\r\n\t\t\t<td style=\"width: 680px;\">Prorated for the exchange quantity. Copied from original order if isAlreadyTaxed = false.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">Carrier</td>\r\n\t\t\t<td style=\"width: 680px;\">&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">ServiceLevel</td>\r\n\t\t\t<td style=\"width: 680px;\">&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 288px;\">ShippingMethod</td>\r\n\t\t\t<td style=\"width: 680px;\">&nbsp;</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<div id=\"\" style=\"left: 15px; top: 460.917px;\">&nbsp;</div>\r\n\r\n<h3 style=\"left: 15px; top: 460.917px;\"><a name=\"troubleshooting\" id=\"troubleshooting\"></a>Troubleshooting</h3>\r\n\r\n<h4><a name=\"exchange-line-hold-not-resolved-after-line-verification\" id=\"exchange-line-hold-not-resolved-after-line-verification\"></a>Exchange line hold not resolved after line verification</h4>\r\n\r\n<p>When an order is created with 2 items and an even/uneven exchange is created for all the items in the order, the ReturnItemsPending hold will be resolved&nbsp;only if the return for both the exchange order lines is received and processed through line verification. Refer <a href=\"https://omni.helpdocsonline.com/exchanges$exchange-line-holds\">here </a>for more information.</p>\r\n\r\n<h4><a name=\"even-exchange-getting-converted-to-uneven-exchange\" id=\"even-exchange-getting-converted-to-uneven-exchange\"></a>Even exchange getting converted to uneven exchange</h4>\r\n\r\n<p>Issue:&nbsp;I am creating a return (same style exchange) order for a single line Order having 2 Qty. Now, if I click on \"select change\" item and change the color or size of that same item, and select. In that case, even the Exchange is being converted to an Uneven Exchange.</p>\r\n\r\n<p data-test-id=\"issue.views.issue-base.foundation.summary.heading\" data-testid=\"issue.views.issue-base.foundation.summary.heading\">For even exchange orders, cancelling the return order&nbsp;line also cancels the exchange order&nbsp;line. However, for uneven exchange orders, cancelling the return order&nbsp;line does NOT cancel the exchange order line?</p>\r\n\r\n<p data-test-id=\"issue.views.issue-base.foundation.summary.heading\" data-testid=\"issue.views.issue-base.foundation.summary.heading\">Troubleshooting steps: Even Exchange got converted to Uneven Exchange because the CSR changed the Color of the Item and because of this, the Return Type was converted to Uneven Exchange, which is the expected behavior as per current design. Whenever CSR changes Color/Size&nbsp; - or any other attribute selected in Call Center Config - Item Options - of the Item, the Item ID will be different.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3 id=\"\" style=\"left: 15px; top: 460.917px;\"><a name=\"related-articles-nbsp\" id=\"related-articles-nbsp\"></a>Related Articles&nbsp;</h3>\r\n\r\n<div class=\"info\"><ul class=\"related-articles\"><li><a href=\"/return-variance\" hqid=\"2604080\">Return Variance</a></li><li><a href=\"/returns-overview\" hqid=\"2596240\">Returns Overview</a></li><li><a href=\"/troubleshooting-returns-exchanges\" hqid=\"2696815\">Troubleshooting Returns & Exchanges</a></li><li><a href=\"/returns-shipped-to-distribution-center\" hqid=\"3385085\">Returns Shipped to Distribution Center</a></li><li><a href=\"/return-labels\" hqid=\"2596255\">Return Labels </a></li><li><a href=\"/returns-restapis\" hqid=\"2597376\">REST APIs and User Exits</a></li><li><a href=\"/returnlabeltracking\" hqid=\"3153241\">Return Label Tracking </a></li><li><a href=\"/how-does-return-work\" hqid=\"2619553\">How Returns Work</a></li></ul></div>\r\n\r\n<div id=\"\" style=\"left: 15px; top: 389.889px;\">&nbsp;</div>\r\n\r\n<div id=\"\" style=\"left: 15px; top: 444.347px;\">&nbsp;</div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 28943,
  "scraped_at": "2025-08-09T21:59:13.919580",
  "content_clean": "Home ››Manhattan Active® Omni››Order Management››Process & Configuration Guides››Returns & Exchanges ››Exchanges Exchanges Previous | Next OverviewProcess flow Exchange Order CreationExchange Order Line PricingExchange UpdatesExchange Line CancellationsExchange Line HoldsExchange Line Holds on VarianceEven Exchange UpdatesConfigurationHow to Configure Pricing of Even ExchangesHow to Configure Exchange HoldsOrder to Exchange MappingsTroubleshootingExchange line hold not resolved after line verificationEven exchange getting converted to uneven exchangeRelated Articles Overview There are two types of exchanges: Even Exchange (Also referred to as same style exchange): When the customer would like to exchange the product for the exact same item, (same style, size or color) it is called an even exchange. Even exchanges can also be used for zero-dollar replacements, wherein the customer received a damaged item, and they need to receive a replacement. Note that, irrespective of the original delivery method for the customer order, exchange order uses Ship To Address as the delivery method. Uneven Exchange (Also referred to as new style exchange): When the customer would like to exchange the product for a completely new item (different style), it is called an uneven exchange. The new product can be more or less expensive than the original item. In such cases, the balance will either be refunded to the customer, or the customer will need to provide payment for the balance. Exchange orders can be created with receipt expected or receipt not expected depending on whether the item that is being exchanged for is expected to be received back by the warehouse or not. Note: The quantity for the same style exchange order line will automatically match the quantity of the corresponding return line and cannot be changed. Process flow Exchange Order Creation An exchange order comprises of return lines and sale lines. If a return line and an even exchange line (identified by isEvenExchange = true) with the same parent order line exist on an order, then this constitutes a same style or even exchange. If a return line and sale lines (identified by isEvenExchange = false) exist on an order, then this constitutes a new style or uneven exchange. Multiple new style items can be added to an order. For example, if a customer returned a sweater from original order line 1 for the same sweater in a different color, then a return line and an even exchange line exist on the order, both with reference to order line 1. If a customer returns a sweater from original order line 1 for a jacket and a bracelet, then a return line and two sale lines exist on the order; the return line references order line 1, but the sale lines do not. If the attribute \"IsExchangable\" is set to 'False' by default, users are restricted from creating Exchange Returns. However, this can be overridden by giving appropriate permissions to the Users on the DS UI. External systems should look at this field and take appropriate decisions on the behavior. Uneven exchange lines are processed identically as regular sale items; uneven exchange items are sent through pricing, promotions, S&H, and tax. This section describes how even exchange items are processed. For a even exchange the system assumes that the item is returnable (IsReturnable = true)  by default. If the item is not configured as returnable (IsReturnable = false) a even exchange cannot be created for that item. Exchange Order Line Pricing Even exchange order lines can be priced in two ways based on configuration. The first option is to copy the price, charges, discounts, and taxes from the original order line, such that the customer is charged zero dollars for an even exchange order. For example, if a customer purchased 1 unit of an item with a $220 unit price, $10 S&H, and $10 tax for a total of $240, then if the configuration for re-pricing even exchanges is disabled, the even exchange line is updated with a $220 unit price, $10 S&H, and $10 tax for a total of $240. If an exchange is created against a multi-unit order line, then charges, taxes, and discounts are prorated for the exchange line quantity. For example, if an original order line for 2 units has a $110 unit price, $10 S&H, and $10 tax for a total of $240, then when a 1-unit even exchange line is created against this order line, the exchange line unit price is set to $110, S&H is $5, and tax is $5. The second option is to re-price the even exchange line by sending it through pricing, promotions, S&H, and tax like an uneven exchange line. This second option is used when the customer should be charged the current sale price, whether it has increased or decreased since the original order was placed. If the configuration for re-pricing even exchanges is enabled, then the even exchange item is priced based on the current pricing, S&H, and tax rules, which could result in a total greater than or lesser than the original line total. If an exchange line is priced by an external system, then the isAlreadyPriced, isAlreadyTaxed, and isAlreadyCharged attributes in the order interface can be used. If isAlreadyPriced is true for an exchange line and re-price even exchanges are disabled, then the unit price on the order import is saved, and the unit price is not copied from the parent order line. If isAlreadyTaxed or isAlreadyCharged is true for an exchange line and re-price even exchanges are disabled, then taxes or charges are not copied from the parent order line, but rather the imported taxes or charges are saved. If isAlreadyPriced, isAlreadyTaxed, or isAlreadyCharged is true for an exchange line and re-price even exchanges are enabled, then the order line is saved with the imported data, and no call is made to pricing, promo, S&H, or tax.  The RePriceEvenExchange attribute controls this behavior.  Refer to the How to section to understand How to Configure the Re-Price Even Exchange Parameter Exchange Updates Exchange Line Cancellations Exchange line cancellations are permitted until any quantity on the line is in \"Released\" status, which is based on the order modification configuration. When an exchange line is canceled, the following updates occur: The exchange line quantity moves to \"Canceled\" status Any header charges, taxes, and discounts associated with the line are canceled or prorated against remaining exchange lines. No update to return credit occurs; when the return item(s) are received, any remaining return credit is issued as a refund. Note: In even exchange orders, canceling a return order line will cancel the exchange order line. However, for uneven exchange orders, cancelling a return order line will not cancel the exchange order line. Exchange Line Holds When an order is created with the ship to return center and exchange lines, even or uneven, the exchange lines are put on hold until the return items are received. This ensures that all return items have been received or canceled before any exchange items are fulfilled. This applies only to ship to return center order lines where receipt of the items is expected; returns and exchanges made in store are not subject to such holds. Exchange line holds are resolved when all applicable return lines are received; partial returns do not systematically resolve the corresponding exchange line hold. For example, if an order has a ship to return center order line for 2 units and an even exchange line, then upon creation, the even exchange line is put on hold with reason Return Items Pending. If one return unit is received, then the return line has one unit in \"Returned\" status and one in \"Pending Return\". When the second unit is received, then all return units are in \"Returned\" status, and the exchange line hold is resolved. The exchange line is now free to be released for fulfillment. Note: The estimated ship/delivery dates of exchange lines are calculated by promising at the time of allocation. If exchange lines are held until return items are received, then these estimated dates may be inaccurate. Currently, there is no ability to recalculate the estimated ship/delivery dates at the time return items are received. Exchange Line Holds on Variance When a return line item is verified, its associated even exchange line (IsEvenExchange=true) will be placed on hold if there is a quantity or condition variance on the return line. In addition, if any return line without an even exchange line is verified with a variance (quantity or condition), all the uneven exchange lines (IsEvenExchange=false) on the return order will be placed on hold. Exchange line holds should be resolved manually. However, if there is a quantity variance on the return line and auto-resolve quantity variance is enabled, the holds will be removed automatically. Set the hold type for exchange on variance by configuring this parameter in the Returns & Exchanges section of the Order Configuration UI. Note: The new hold (Return Item Discrepancy) will be put on hold on the exchange line only after the existing hold (Return Items Pending) is removed. For example, 'Status to Unhold Exchange Lines' is set to Returned status and the return verification policy is set to 'Return order', Use Case 1: If a return order contains a return line with 2 units and an associated even exchange line, then upon creation, the exchange line is placed on hold with the reason \"Return Items Pending\". If return line is verified with a quantity variance (1 quantity is verified), the return line status is updated to \"Returned,\" the existing \"Return Items Pending\" hold on the exchange line is removed, and a new hold with the reason \"Return Item Discrepancy\" is applied to the exchange line. If auto resolve quantity variance is enabled, one quantity which is not verified will be canceled and hold on an even exchange line will be removed. Use Case 2: If a return order contains two return lines, both having associated even exchange lines, then upon order creation, both exchange lines are placed on hold with the reason \"Return Items Pending\". If one of the return lines is verified with a condition variance, the return line status is updated to \"Returned,\" and the existing \"Return Items Pending\" hold on both exchange lines remains unchanged. If the other return line is then verified without any variance, the \"Return Items Pending\" hold is removed from both exchange lines. A new hold with the reason \"Return Item Discrepancy\" is applied to the exchange line associated with the return line that had the variance, while the exchange line associated with the return line verified without variance is fully released for further processing. Use Case 3: If a return order contains two return lines, one return line being a pure return and the other having an associated even exchange line, the associated exchange line is initially placed on hold with the reason \"Return Items Pending\" upon order creation. If the pure return line is verified with a condition variance, the existing hold on the even exchange line remains unchanged. If the even exchange return line is verified with a quantity variance, the existing \"Return Items Pending\" hold on its associated exchange line is removed and replaced with a new hold, \"Return Item Discrepancy\". If the even exchange return line is verified without any variance, the \"Return Items Pending\" hold on the associated exchange line is removed, and the line is fully released for further processing. Use Case 4: If a return order contains a return line with an associated even exchange line and an uneven exchange line (sale), both exchange lines are initially placed on hold with the reason \"Return Items Pending\" upon order creation. If the return line is verified with a condition variance, the \"Return Items Pending\" hold is removed from both the even and uneven exchange lines. A new hold with the reason \"Return Item Discrepancy\" is applied only to the even exchange line and the uneven exchange line is fully released for further processing. Use Case 5: If an order contains a pure return line and two uneven exchange lines (sale), both uneven exchange lines are placed on hold with the reason \"Return Items Pending\" upon order creation. If the return line is verified with a condition variance, the \"Return Items Pending\" hold is removed from both uneven exchange lines. A new hold with the reason \"Return Item Discrepancy\" is applied to both uneven exchange lines. Even Exchange Updates Only certain updates to even exchange order lines are supported if the re-pricing of even exchanges is disabled. If the re-pricing of even exchange lines is enabled, then more line updates (such as shipping method upgrade, address change, etc.) can be supported in the order component, because the charges, taxes, and discounts will be recalculated. However, if re-pricing is disabled, limited updates are supported: cancellations, notes, appeasements, and adding payment (if required). Configuration How to Configure Pricing of Even Exchanges Even exchange order lines can be priced in two ways. The first method is to copy the price, charges, discounts, and taxes from the original order line, such that the customer is charged zero dollars for an even exchange order. The second method is to re-price the even exchange line by sending it through pricing, promotions, S&H, and tax, like an uneven exchange line. This second option is used when the customer should be charged the current sale price, whether it has increased or decreased since the original order was placed The setting Re-Price Even Exchange Lines controls which mode is used. If re-price is enabled, then an even exchange item is priced based on the current pricing, S&H, and tax rules, which could result in a total greater than or less than the original line total. If re-price is disabled, then the price, taxes, charges, and discounts are retrieved from the parent order. Configure this parameter in the Returns & Exchanges section of the Order Configuration UI. How to Configure Exchange Holds When an order is created with ship to return center and exchange lines, even or uneven, the exchange lines are put on hold until the return items are received. You can configure these parameters in the Returns & Exchanges section of the Order Configuration UI. The Exchange Hold Type setting indicates the type of hold which is applied on even and uneven exchange lines when return items have not yet been received. For example, if the exchange hold type is ReturnItemsPending, then when an order is created with a ship to return center line and an even exchange line, a hold is applied to the even exchange line with hold type ReturnItemsPending. The Status to Unhold Exchange Lines setting indicates the status in which return units must be for any exchange lines to be unheld. The status to unhold exchanges should be set to Returned, because advance exchanges are not supported. This means that all quantity for ship to return center order lines must be in Returned status for the holds on the even and uneven exchange lines to be resolved. In case of line verification, all the exchange lines should be verified, then the hold will be removed. If any status other than Returned is used, then custom logic needs to be added to ensure that the customer is charged for the advance exchange, if the return items are not shipped. Order to Exchange Mappings When an exchange line is created and the data is null on the exchange during creation, the below data is fetched from the parent order line and saved on the exchange. If the data is not null, then the imported data is saved. Attributes to copy to exchange order, if null Notes Order Attributes CustomerId CustomerFirstName CustomerLastName CustomerPhone CustomerEmail CustomerTypeId These attributes are copied only if CustomerId and CustomerFirstName are null on the exchange order. If CustomerId and CustomerFirstName are null, then all of these attributes are replaced with the value from the original order. Otherwise, none of these values are copied. ParentOrderId ParentOrderLineId CurrencyCode IsTaxExempt TaxExemptId TaxExemptReason These attributes are copied only if all three are null on the exchange order. ChargeDetails Prorated for the exchange quantity. Copied from original order if isAlreadyCharged = false. TaxDetails Prorated for the exchange quantity.Copied from original order if isAlreadyTaxed = false. Order Line Attributes UnitPrice Copied from original order if isAlreadyPriced = false. OriginalUnitPrice IsPriceOverridden IsReturnable If this attribute is set to 'False' by default, users are restricted from creating returns. However, this can be overridden by giving appropriate permissions to the Users on the DS UI. External systems should look at this field and take appropriate decision on the behavior. IsGift PaymentGroupId ItemDescription ItemStyle ItemBrand ItemSize ItemColorDescription ItemSeason ProductClass If any attribute in this list is null on the exchange order, then all attributes are copied from the original order. IsTaxIncluded ShipToAddress If the original order ship to address is null, then pull the preferred address for the customer. ChargeDetails Prorated for the exchange quantity. Copied from original order if isAlreadyCharged = false. TaxDetails Prorated for the exchange quantity. Copied from original order if isAlreadyTaxed = false. Carrier ServiceLevel ShippingMethod Troubleshooting Exchange line hold not resolved after line verification When an order is created with 2 items and an even/uneven exchange is created for all the items in the order, the ReturnItemsPending hold will be resolved only if the return for both the exchange order lines is received and processed through line verification. Refer here for more information. Even exchange getting converted to uneven exchange Issue: I am creating a return (same style exchange) order for a single line Order having 2 Qty. Now, if I click on \"select change\" item and change the color or size of that same item, and select. In that case, even the Exchange is being converted to an Uneven Exchange. For even exchange orders, cancelling the return order line also cancels the exchange order line. However, for uneven exchange orders, cancelling the return order line does NOT cancel the exchange order line? Troubleshooting steps: Even Exchange got converted to Uneven Exchange because the CSR changed the Color of the Item and because of this, the Return Type was converted to Uneven Exchange, which is the expected behavior as per current design. Whenever CSR changes Color/Size  - or any other attribute selected in Call Center Config - Item Options - of the Item, the Item ID will be different. Related Articles Return VarianceReturns OverviewTroubleshooting Returns & ExchangesReturns Shipped to Distribution CenterReturn Labels REST APIs and User ExitsReturn Label Tracking How Returns Work"
}