{
  "success": true,
  "permalink": "fulfillment-printing-process",
  "title": "Printing Process",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158410\" href=\"/store\" class=\"breadcrumb-links\">Store Inventory & Fulfillment</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158852\" href=\"/store-fulfillment\" class=\"breadcrumb-links\">Store Order Fulfillment</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2173007\" href=\"/printing\" class=\"breadcrumb-links\">Printing</a></li><li> <span>››</span>Printing Process</li></ul>  \t\r\n\t\t<h2>Printing Process</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/fulfillment-printing-process$documents\">Documents</a></li><li><a href=\"/fulfillment-printing-process$application-platform\">Application platform</a></li><li><a href=\"/fulfillment-printing-process$report-customization\">Report Customization</a></li><li><a href=\"/fulfillment-printing-process$troubleshoot-thermal-printing-errors\">Troubleshoot Thermal Printing Errors</a></li><li><a href=\"/fulfillment-printing-process$services\">Services</a></li></ul></div>\r\n\r\n<p>This guide discusses how to print documents in a store environment.&nbsp;All of these can be printed to a document printer, and shipping and return labels can be printed if desired.</p>\r\n\r\n<ul>\r\n\t<li>Picklist - This document is used&nbsp;to pick items.</li>\r\n\t<li>Collate - This document is used when shipping packages. It contains a shipping label, return label (optional, depending on the ship) and packing slip when thermal printing continues to be disabled. On the other hand, when it is enabled, a \"Collate\" document comprises only the packing slip.</li>\r\n\t<li>Pickup slip - This document is used to identify pickup orders waiting to be picked up by the customers.</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"657\">Packing Slip - This document is sent to the customer as part of the package.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"753\">Shipping Label (and Return labels) - The labels are generated by&nbsp;the carrier to ship the packages to the customer. Supports thermal printing.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"753\">Non-parcel Shipping Label - This label is used for non-parcel shipments.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"991\">Pullback Transfer Pack Slip - This document is the packing slip for pullback and transfer orders.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"991\">Same-day delivery pickup slip (i.e., Delivery Slip) and&nbsp;label -&nbsp;This document is used to identify&nbsp;same-day delivery orders waiting to be picked up by the same-day delivery carriers.&nbsp;</p>\r\n\t</li>\r\n</ul>\r\n\r\n<p>Except for thermal printing, document are&nbsp;printed by downloading the PDF format of the document onto the device. Based on the <a href=\"/fulfillment-printing-process$ApplicationPlatform\">application platform</a>, users can select the printer from the list of available printers and release the document to print. Printer setup is not required in the application except when thermal printing is enabled. The report's language is determined based on the user's locale.</p>\r\n\r\n<p><a id=\"thermalprinting\" name=\"thermalprinting\"></a>Thermal printing can be enabled by configuring the required thermal printers using the Label Printers UI. Refer to the <a href=\"https://omni.helpdocsonline.com/printing-configuration$silent-thermal-printing-of-shipping-and-return-labels\">Printing Configuration</a> guide for more details. When thermal printing is enabled, the shipping and returns labels (if enabled) are silently sent for printing to the configured store or device-specific thermal printer. The packing slip, however, continues to be previewed as a PDF document and printed using the applicable&nbsp;<a href=\"/fulfillment-printing-process$ApplicationPlatform\">application platform</a>'s printing capability.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: In the case of custom carrier implementations, when thermal printing is enabled, the user exit input will have the ImageType as “ZPLII”. This would require custom extensions to request the custom carrier to provide the shipping and return (if applicable) labels in the ZPL format and send them in response to the user exit for printing using the configured thermal printer. A null ImageType would imply that thermal printing has not been enabled, and no change is needed in the custom code.</div>\r\n\r\n<h4><a name=\"documents\" id=\"documents\"></a>Documents</h4>\r\n\r\n<p><a id=\"CustomLogoURL\" name=\"CustomLogoURL\"></a>Base supported documents are listed below. To customize any of these reports, the Jasper report templates can be modified.</p>\r\n\r\n<p>Within Store Fulfillment Parameters configuration, the \"Printed Documents Logo URL\" parameter allows for a URL-based image to be shown on Base printed documents such as: Picklist, Slotted Picklist, Pullback Transfer Picklist, Delivery Slip, Packing Slip, and Pullback Transfer Packing Slip. This parameter can be configured with the following:</p>\r\n\r\n<ul>\r\n\t<li>URL parameter is configured with a&nbsp;null, blank, or empty = the default Manhattan Associates&nbsp;logo used.</li>\r\n\t<li>URL parameter is configured with a working image URL =&nbsp;the configured logo is used.</li>\r\n\t<li>URL parameter is&nbsp;configured with a non-working image URL = no image is&nbsp;shown, and the area where an image is shown is left&nbsp;blank.</li>\r\n</ul>\r\n\r\n<h5>Picklist</h5>\r\n\r\n<p>Picklists are&nbsp;used to drive paper-based picking in-store environments without mobile devices or on a temporary basis if no devices are available for a period of time. Picklists&nbsp;can be&nbsp;printed by the user and can be reprinted during picking, if needed. Refer to the <a hqid=\"1808791\" href=\"/fulfillment-picking-process\">Picking guide</a> for additional information.</p>\r\n\r\n<h5>Collate (Packing Slip, Shipping Label and Return Label)</h5>\r\n\r\n<p>When packing&nbsp;is completed for a package,&nbsp;a shipping collate is printed. Packing slip is always printed as part of the collate document. The shipping label and return label (if applicable) portion of the collate are obtained from the carrier via ship&nbsp;request. If the carrier labels cannot be returned from the carrier due to an issue in communication, then the user has the option to optionally print the packing slip portion of the collate and print the labels once communication is&nbsp;restored. When the collate is sent to document printers, a collate document comprises all three components, i.e., Packing Slip, Shipping Label, and Return Label (if configured) as long as communication with the carrier goes through, and it returns the required labels. When thermal printing is enabled, the&nbsp;collate document contains only the packing slip and is sent to the document printer. The labels are silently printed using the configured thermal printer.</p>\r\n\r\n<p>Once printed, the shipping collate can be manually reprinted, if needed. To&nbsp;avoid sending multiple shipping label requests to the carrier, returned label images are stored. When an associate reprints the collate, the application retrieves any previously saved labels. If labels have not yet been saved, the application requests labels from the carrier at that time.</p>\r\n\r\n<p>Note that if an order contains any gift lines (denoted by isGift = yes), the prices are masked on the packing list.</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> The packing slip format is the same for Customer shipments, Pullbacks/Transfers and Store-Initiated Transfers.</div>\r\n\r\n<p>Refer to the <a hqid=\"1808795\" href=\"/shipping-process\">Shipping guide</a>&nbsp;for additional information.</p>\r\n\r\n<h5>Pickup Slip</h5>\r\n\r\n<p>When a customer arrives to retrieve a pickup order, the pickup slip&nbsp;allows an&nbsp;associate&nbsp;to locate the pickup order(s) by matching customer and order information. Based on the&nbsp;permission, pickup slips can also be printed during the submit pick process.&nbsp;A consolidated PDF is generated which contains all the pickup slips for the picklist. If team based picking is enabled, then permission to print pickup slips during submit pick process should be turned off.</p>\r\n\r\n<p>Pickup slips can also be printed during picking , staging and sorting.&nbsp;</p>\r\n\r\n<p>Refer to the <a hqid=\"1808792\" href=\"/staging-process\">Staging guide</a>, <a hqid=\"1947564\" href=\"/fulfillment-sorting-process\">Sorting Process</a>&nbsp;and&nbsp;<a hqid=\"1809747\" href=\"/confirm-pickup-process\">Pickup&nbsp;guide</a>&nbsp;for additional information.</p>\r\n\r\n<h4><a name=\"application-platform\" id=\"application-platform\"></a><a id=\"ApplicationPlatform\" name=\"ApplicationPlatform\"></a>Application platform</h4>\r\n\r\n<h5>Mobile</h5>\r\n\r\n<h6>iOS</h6>\r\n\r\n<p>Documents printed to a document printer from&nbsp;the iOS/iPadOS app are&nbsp;handled via Apple's AirPrint&nbsp;functionality.&nbsp;For AirPrint&nbsp;to operate, the device and the printer must be on the same wireless network. When thermal printing is enabled, the shipping and return labels are directly silently printed using the configured thermal printer.&nbsp;</p>\r\n\r\n<h6>Android</h6>\r\n\r\n<p>Documents printed to a document printer from&nbsp;the Android app are&nbsp;handled by&nbsp;installing manufacturer-specific apps on the mobile device. Printer manufacturers publish their printing applications in the Google Play Store, which enables users to access printers from&nbsp;Android devices. For example, a&nbsp;store would need to install Canon's printing application on the device&nbsp;to print to a Canon device.&nbsp;When thermal printing is enabled, the shipping and return labels are directly silently printed using the configured thermal printer.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: To print from an Android device, both the device and the printer must be on the same wireless network.</div>\r\n\r\n<h5>Browser</h5>\r\n\r\n<p>Printing from the browser requires the associated printers to be&nbsp;configured onto a local machine. Documents to print are downloaded to the device&nbsp;and a PDF document is displayed to the user. The user&nbsp;can&nbsp;choose the printer from the list of available printers.</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> To know more on the&nbsp; reprint activity during offline mode, please refer to the&nbsp;<a hqid=\"3324298\" href=\"/store-inventory-and-fulfillment-offline-support\">Store Offline Support</a>&nbsp;page.</div>\r\n\r\n<div class=\"tip\"><strong>Note:&nbsp;</strong>Thermal printing is not supported on browsers. Printing from a browser is always printed to document printers. If a reprint of a previously generated ZPL label is requested using a browser, only the packing slip is previewed for printing using the standard document printer; the label(s) is not printed.</div>\r\n\r\n<p>Document Reprint</p>\r\n\r\n<p>This option allows store associates to reprint a pickup slip or shipping collate if the original document was damaged, misplaced or not printed properly. In addition, the associate may be requested to print a duplicate copy of the pickup slip for the customer for pickup orders.</p>\r\n\r\n<p>The Get Fulfillments to Reprint Pickup Slip or Packing Slip & Shipping Labels service is used to find the eligible fulfillments for reprinting documents. However, failed shipping label will invoke the toggle for print packing slip.</p>\r\n\r\n<h5>Reprint Shipping Collate</h5>\r\n\r\n<p>There are two ways to reprint a shipping collate – using the reprint option or during the packing process.</p>\r\n\r\n<h6>Reprint Option</h6>\r\n\r\n<p>To reprint a collate using the reprint option, associates input the item (using either the item ID or UPC barcode), package ID or order ID. The following orders are eligible for reprint:</p>\r\n\r\n<ul>\r\n\t<li>Orders with a delivery method of \"ShipToAddress\" or \"ShipToStore\" and destination action is not \"PickUp\"</li>\r\n\t<li>Order status:\r\n\t<ul>\r\n\t\t<li>If the associate enters an Item, orders with that item in 'In Packing', 'Packed'&nbsp;or 'Shipped' status are eligible for reprint and are listed in decreasing order of packed date and time. Once the associate selects an order, the package to reprint must be selected.&nbsp;</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Orders in 'In Packing'&nbsp;status are only eligible for reprint if the entered item has already been packed.</div>\r\n\r\n<ul>\r\n\t<li>If the associate enters a Package or Fulfillment ID, the fulfillment status must be &gt;= ‘In Packing' and &lt;= 'Shipped', and the package status must be 'Packed' or 'Shipped'.</li>\r\n\t<li>If the associate enters the Customer Order ID, then fulfillment belonging to the customer's order must be&nbsp;in the status &gt;= ‘In Packing' and &lt;= 'Shipped', and the package status must be 'Packed' or 'Shipped'.</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note:</strong>&nbsp;Currently, Manhattan Active Omni® Store Inventory & Fulfillment does not support reprinting of labels originally generated in the ZPL format (implying that thermal printing is enabled) using document printers.</div>\r\n\r\n<h6>During Packing</h6>\r\n\r\n<p>Shipping documents can be reprinted during the packing process. The associate inputs the Item or package Id, along with the order Id to reprint the collate.</p>\r\n\r\n<h5>Reprint Pickup Slip</h5>\r\n\r\n<p>Pickup orders are searched by item ID or item&nbsp;UPC&nbsp;barcode. Based on the&nbsp;search criteria, the following attributes&nbsp;are returned:</p>\r\n\r\n<ul>\r\n\t<li>The order has the delivery method \"PickupAtStore\" or \"ShipToStore\" and the destination action \"PickUp\".</li>\r\n\t<li>Order status is \"Picked\".</li>\r\n</ul>\r\n\r\n<p>Orders are displayed in decreasing order of picked date and&nbsp;time. The associate selects an order to reprint the pickup slip for.</p>\r\n\r\n<h6>Substitution during Picking</h6>\r\n\r\n<p>If an order&nbsp;involves substitution, store associates can search for the required order using the substitute item in addition to the originally ordered item. The substitute item(s) is displayed in place of the ordered item(s) for the substituted line(s). A red substituted indicator is also shown for such lines. Additionally, if a store associate taps on a substituted order, the Reprint Pickup Slip Order Details UI displays the substitute item details for the substituted line(s) along with a red substituted indicator. The reprinted pickup slip also displays the substitute item details for the substituted lines. For more details on substitution in stores, refer to its documentation <a href=\"https://omni.helpdocsonline.com/substitution-during-fulfillment$substitution-in-stores\">here</a>.</p>\r\n\r\n<h4><a name=\"report-customization\" id=\"report-customization\"></a>Report Customization</h4>\r\n\r\n<p>Refer to <a hqid=\"3005357\" href=\"/sif-report-customization\">Store Report Customization guide</a> for step-by-step customization of a report.</p>\r\n\r\n<h4><a name=\"troubleshoot-thermal-printing-errors\" id=\"troubleshoot-thermal-printing-errors\"></a>Troubleshoot Thermal Printing Errors</h4>\r\n\r\n<p>Refer to the following table for errors which can be observed while enabling thermal printing.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\">Issue</th>\r\n\t\t\t<th scope=\"col\">Troubleshooting Tip</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p>Unable to see any seed data in the Peripheral Device drop-down list in the Label Printers MUP UI</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Ensure that the following base profile purpose is copied to your&nbsp;custom profile:&nbsp;<strong>dvc::deviceManagementConfigurations</strong></p>\r\n\r\n\t\t\t<ol start=\"2\">\r\n\t\t\t</ol>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Seeing the following toast while triggering a thermal print - \"Printer head open. Try reprinting after closing the printer head.\"</td>\r\n\t\t\t<td>Ensure that the printer head is not open. Contact Zebra support if the issue persists.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Seeing the following toast while triggering a thermal print - \"Printer out of paper. Try reprinting after loading paper.\"</td>\r\n\t\t\t<td>Ensure that the printer hasn't run out of paper. Try reprinting after loading paper if it has. Contact Zebra support if this error is being seen despite the printer having sufficient paper in it.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>See the following toasts: 1. Printing failed. Printer error code = PRINTER_STATUS_INVALID. 2.&nbsp;Printing failed. Printer error code = INVALID_STATUS_COMMAND. 3.&nbsp;Printing failed. Printer error code = PRINT_ERROR.</td>\r\n\t\t\t<td>Follow Zebra support documentation. If the issue persists, reach out to their helpline.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Seeing the following toast: Printing failed. Printer error code = PRINTER_BINARY_RESPONSE.</td>\r\n\t\t\t<td>Refer to Kibana logs. In the case of custom extensions, ensure that the requested print is correctly formatted in the language that the printer can understand. In case this error is seen in the out-of-the-box flows, raised an R&D support ticket.&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Seeing the following toasts: 1. \"Timed out. Printer error code = PRINTER_RESPONSE_TIMEOUT.\" 2.&nbsp;Printer unavailable. Printer error code = PRINTER_UNAVAILABLE.</td>\r\n\t\t\t<td>May be returned to a connectivity glitch. Ensure that the printer is switched on and is connected to the network. Reach out to your network team if you see a connectivity issue. Reach out to Zebra support if the issue persists even after ensuring that your printer is on and that there are no connectivity issues.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Persistent printer failure. How do I restore store operations?&nbsp;</td>\r\n\t\t\t<td>1. Store associates may select another functioning thermal printer using their Store app Settings to reprint the failed labels 2. If no other thermal printer is installed in the store, the retailer's store operations team is&nbsp;required to delete the malfunctioning printer configuration from the Label Printers as soon as possible so that thermal printing at the affected store is disabled and all subsequent label printing requests are executed using standard document printers available in the store. 3.&nbsp;Currently, MA Store Inventory & Fulfillment does not support reprinting of labels originally generated in the ZPL format using document printers.</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h4><a name=\"services\" id=\"services\"></a>Services</h4>\r\n\r\n<p>The&nbsp;APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 600px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\">Service</th>\r\n\t\t\t<th scope=\"col\">Component</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 125px;\">Group</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 332px;\">Service End Point</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 100px;\">Get fulfillments&nbsp; to Reprint Pickup Slip or Packing Slip & Shipping Labels</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td style=\"width: 122px;\">fulfillment-list-controller</td>\r\n\t\t\t<td style=\"width: 329px;\">\r\n\t\t\t<p>fulfillment/api/fulfillment/fulfillment/listFulfillmentsByItem</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n</div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 19680,
  "scraped_at": "2025-08-09T22:36:10.764285"
}