{
  "success": true,
  "permalink": "interaction-configuration",
  "title": "Interaction Configuration",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158742\" href=\"/customer-engagement-3\" class=\"breadcrumb-links\">Customer Engagement</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158395\" href=\"/process-configuration-guides-2\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2812056\" href=\"/ce-interactions\" class=\"breadcrumb-links\">Interactions</a></li><li> <span>››</span>Interaction Configuration</li></ul>  \t\r\n\t\t<h2>Interaction Configuration</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/interaction-configuration$overview\">Overview</a><ul><li><a href=\"/interaction-configuration$interaction-type-configuration\">Interaction Type Configuration</a></li></ul></li><li><a href=\"/interaction-configuration$related-articles\">Related Articles</a></li></ul></div>\r\n\r\n<h3><a name=\"overview\" id=\"overview\"></a><a id=\"overview\" name=\"overview\"></a>Overview</h3>\r\n\r\n<p style=\"text-align: justify;\">Retailers can configure the options mentioned below in the Interactions Configuration UI</p>\r\n\r\n<p style=\"text-align: justify;\">Enable Chatbot : Enables chatbot services for chat interaction. If this configuration is enabled, the customer will be connected to Maven as soon as the customer clicks on the Chat icon. Otherwise, the system tries to connect the customer to a live agent directly.</p>\r\n\r\n<p style=\"text-align: justify;\">Enable Live Chat : Enables live chat services for chat interaction. Connect to Agent button will be enabled on the Chat UI only if this configuration is enabled.&nbsp;</p>\r\n\r\n<h4><a name=\"interaction-type-configuration\" id=\"interaction-type-configuration\"></a><a id=\"Interaction Creation\" name=\"Interaction Creation\"></a>Interaction Type Configuration</h4>\r\n\r\n<p>Retailers can configure various bouncing parameters for the below-mentioned interaction types:</p>\r\n\r\n<ul>\r\n\t<li>Chat</li>\r\n\t<li>Text (includes both SMS and WhatsApp)</li>\r\n\t<li>Email</li>\r\n</ul>\r\n\r\n<div class=\"warning\">Configurations for any other interaction type are not honored by the system; there is no system validation to prevent it.</div>\r\n\r\n<p>Interaction Type</p>\r\n\r\n<p style=\"text-align: justify;\">Expected Agent Initial Response Time (seconds):&nbsp;This is the maximum time allowed for an agent to respond to a customer after an interaction is assigned to them. If the agent doesn't reply within this time, the interaction will be reassigned to another available agent. If no agents are available, the interaction will stay in the queue and be assigned as soon as someone becomes available. The response time must be at least 10 seconds and shorter than the times set for Conversation Idle timer and the Inactive Conversation Closure timer (in seconds).</p>\r\n\r\n<p style=\"text-align: justify;\">Interaction SLA (seconds):&nbsp;The time limit for the first agent response to be sent to an interaction from the customer. If any agent responds within the interaction SLA time, then the interaction is considered for the within SLA metric, configurable in seconds.</p>\r\n\r\n<p style=\"text-align: justify;\">Conversation Idle Timer (seconds):&nbsp;This is the time limit for marking a conversation as inactive. It starts when the conversation begins and resets each time a participant (customer, agent, or chatbot) sends a message. If the time limit is exceeded, the system will reassign the conversation if the agent is inactive or close it if both the agent and customer are inactive. If the customer is inactive, the agent is notified and can decide whether to close the conversation. If no time is set, the default limit is 2 hours. This applies only to chat and text conversations, and the limit must be longer than the Expected Agent Initial Response Time (in seconds) and shorter than the time&nbsp;set for the Inactive Conversation Closure timer (in seconds).</p>\r\n\r\n<p style=\"text-align: justify;\">Inactive Conversation Closure (seconds):&nbsp;This is the time limit for automatically closing a conversation if no one is actively participating. It starts when the conversation begins and resets whenever someone (customer, agent, chatbot, or system) sends a message. If the time limit is reached and no one is active, the system will close the conversation. If no time is set, the default is 2 days. The time limit must be longer than both the Expected Agent Initial Response Time (seconds) and the Conversation Idle Timer (seconds). This applies only to chat and text conversations.</p>\r\n\r\n<div class=\"warning\" style=\"text-align: justify;\">Expected Agent Initial Response Time (seconds), Conversation Idle Timer (seconds) and&nbsp;Inactive Conversation Closure (seconds) parameters have to be configured strictly in ascending order. If not, the system may behave abnormally.</div>\r\n\r\n<div class=\"tip\" style=\"text-align: justify;\"><strong>Note</strong>: If&nbsp;Conversation Idle Timer (seconds) and&nbsp;Inactive Conversation Closure (seconds) are not configured,&nbsp;the system has internal default values (which are not displayed on the UI,&nbsp;populated in the respective fields)&nbsp;of&nbsp;7200 seconds (2 Hrs) and&nbsp;172,800 seconds (2 days) respectively, which cannot be modified unless these parameters are explicitly configured in the interaction type configuration.</div>\r\n\r\n<h3><a name=\"related-articles\" id=\"related-articles\"></a>Related Articles</h3>\r\n\r\n<div class=\"info\"><ul class=\"related-articles\"><li><a href=\"/ce-email-interactions\" hqid=\"2911287\">Emails </a></li><li><a href=\"/ce-interaction-wrapup\" hqid=\"2911288\">Interaction Wrap up </a></li><li><a href=\"/text_messaging\" hqid=\"2631481\">Text Messaging</a></li><li><a href=\"/live-chat\" hqid=\"3338657\">Chat</a></li></ul></div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 6125,
  "scraped_at": "2025-08-09T22:35:05.714268"
}