{
  "success": true,
  "permalink": "inventory-overview",
  "title": "Overview",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158716\" href=\"/enterprise-inventory\" class=\"breadcrumb-links\">Enterprise Inventory</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2163212\" href=\"/inventory\" class=\"breadcrumb-links\">Inventory</a></li><li> <span>››</span>Overview</li></ul>  \t\r\n\t\t<h2>Overview</h2>\r\n\r\n<p><p><span style=\"font-size:11px;\">Last updated: &nbsp;09/23/2022</span></p></p>\r\n\r\n<a href=\"/how-supply-works\" hqid=\"2617849\">Next</a>\r\n<p>With online selling becoming common practice, retailers have adjusted order fulfillment processes to include real-time capabilities like selling and fulfilling against inbound inventory or inventory at third-party drop shippers. Today, as retailers enable their stores to become fulfillment points, the complexity involved in achieving a consistent and accurate global view of inventory grows exponentially. These stores &ndash; along with warehouses or third-party drop shippers &ndash; must become part of a seamless enterprise view of the global inventory network to enable timely and accurate omni channel order fulfillment.&nbsp;</p>\r\n\r\n<p>Manhattan Enterprise Inventory provides retailers with a complete and real-time view of perpetual inventory across every fulfillment location in the enterprise including: stores, in-transit, on-order and third-party owned/fulfilled inventory. Using open APIs to synchronize inventory positions across a retailer&rsquo;s network and external applications in real time, Manhattan Enterprise Inventory delivers the global view of inventory &ndash; a retailer needs to power omni channel commerce. With complete inventory information made available to any sales channels, retailers can confidently offer customers the ability to order products for store pickup or same-day delivery.</p>\r\n\r\n<p>Some of the features and functions of Enterprise Inventory</p>\r\n\r\n<ul>\r\n\t<li>Access a real-time view of all on-hand, in-transit, and on-order inventory at the distribution center (DC), stores, and suppliers</li>\r\n\t<li>Manage inventory dispositions with configurable supply types and dispositions, such as defective, damaged or open box.</li>\r\n\t<li>Use a standard event to publish inventory events and synchronize inventory positions across the network and external applications in real time (using Supply events and Sync)</li>\r\n\t<li>Virtualize division of on-hand inventory across multiple channels, maintaining a single pool at the DC</li>\r\n\t<li>Use single, consolidated purchase order across channels</li>\r\n\t<li>Manage on-order and in-transit inventory per channel while keeping intact a single, consolidated purchase order across channels.</li>\r\n\t<li>Track inventory attributes - Inventory attributes help to track inventory at a more detailed level for an item and a location. For example, inventory can be tracked by country of origin or lot number. Inventory can be tracked based on the attributes listed below.\r\n\t<ul>\r\n\t\t<li>County of Origin - Originating Country for the Inventory</li>\r\n\t\t<li>Batch Number - The batch (or lot) number can be assigned to one or more units that are produced or purchased on the same or various dates. Those units may have a production and/or expiration date.</li>\r\n\t\t<li>Inventory Type - Examples include &quot;Raw&quot;, &quot;Finished Goods&quot;, etc.</li>\r\n\t\t<li>Product Status</li>\r\n\t\t<li>Inventory Attributes 1-5</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Future Supply - Future supply represents the inventory that will be available in a warehouse or store at a future date. POs and ASNs are examples of future inventory. A retailer creates POs to suppliers to procure goods to a specified location at a specified date. Suppliers creates an ASN to indicate that the goods are in transit to the specified location. While future inventory offers the benefit of promising more and hence potentially selling more, uncertainty exists as to when inventory will be physically available at the location.</li>\r\n</ul>\r\n\r\n<h3>Related Articles</h3>\r\n\r\n<div class=\"info\"><ul class=\"related-articles\"><li><a href=\"/audit-archive\" hqid=\"2604761\">Audit & Archive</a></li><li><a href=\"/inventory-troubleshooting\" hqid=\"2656527\">Troubleshooting</a></li><li><a href=\"/infinite-inventory\" hqid=\"2604763\">Infinite Inventory</a></li><li><a href=\"/inventory-rest-apis-user-exits\" hqid=\"2605393\">Rest APIs & User Exits</a></li><li><a href=\"/future-supply\" hqid=\"3305517\">How Future Supply works</a></li><li><a href=\"/how-supply-works\" hqid=\"2617849\">How Supply Works</a></li><li><a href=\"/supply-sync\" hqid=\"3305519\">Supply Sync</a></li><li><a href=\"/segmentation\" hqid=\"2604113\">Segmentation</a></li><li><a href=\"/publish-inventory\" hqid=\"2604060\">Publishing Inventory</a></li><li><a href=\"/reapportionment\" hqid=\"2604760\">Reapportionment </a></li><li><a href=\"/how-to-set-up-supply-profile\" hqid=\"2605312\">How to Configure Supply Profiles</a></li></ul></div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 5593,
  "scraped_at": "2025-08-09T22:48:04.267392"
}