{
  "id": "1903610",
  "permalink": "manager-dashboard-process",
  "title": "Fulfillment Progress Process",
  "type": "topic",
  "level": 6,
  "path": "Manhattan Active® Omni/Store/Process & Configuration Guides/Store Inventory & Fulfillment/Store Order Fulfillment/Fulfillment Progress/Process",
  "raw_item": {
    "id": "1903610",
    "text": "Process",
    "title": "Process",
    "permalink": "manager-dashboard-process",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "145462",
    "parent": "f;145462",
    "created_date": "1505764921",
    "modified_date": "1750385016",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "1"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158410\" href=\"/store\" class=\"breadcrumb-links\">Store Inventory & Fulfillment</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158852\" href=\"/store-fulfillment\" class=\"breadcrumb-links\">Store Order Fulfillment</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2164434\" href=\"/manager-dashboard\" class=\"breadcrumb-links\">Fulfillment Progress</a></li><li> <span>››</span>Fulfillment Progress Process</li></ul>  \t\r\n\t\t<h2>Fulfillment Progress Process</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/manager-dashboard-process$pickup-orders\">Pickup Orders</a><ul><li><a href=\"/manager-dashboard-process$associate-activity-nbsp\">Associate Activity&nbsp;</a><ul><li><a href=\"/manager-dashboard-process$at-risk-evaluation\">At-Risk Evaluation</a></li><li><a href=\"/manager-dashboard-process$not-started-nbsp\">Not Started&nbsp;</a></li><li><a href=\"/manager-dashboard-process$in-progress-nbsp\">In Progress&nbsp;</a></li><li><a href=\"/manager-dashboard-process$prepared-nbsp\">Prepared&nbsp;</a></li><li><a href=\"/manager-dashboard-process$being-sorted\">Being Sorted</a></li></ul></li><li><a href=\"/manager-dashboard-process$customer-activity\">Customer Activity</a><ul><li><a href=\"/manager-dashboard-process$awaiting-pickups\">Awaiting Pickups</a></li><li><a href=\"/manager-dashboard-process$picked-up\">Picked Up</a></li><li><a href=\"/manager-dashboard-process$cancelled\">Cancelled</a></li><li><a href=\"/manager-dashboard-process$curbside-arrived\">Curbside Arrived</a></li><li><a href=\"/manager-dashboard-process$curbside-on-the-way\">Curbside On The Way</a></li><li><a href=\"/manager-dashboard-process$curbside-pending\">Curbside Pending</a></li><li><a href=\"/manager-dashboard-process$pickup-time\">Pickup Time</a></li><li><a href=\"/manager-dashboard-process$additional-purchases\">Additional Purchases</a></li><li><a href=\"/manager-dashboard-process$return-to-shelf\">Return to Shelf</a></li><li><a href=\"/manager-dashboard-process$fulfilled-units\">Fulfilled Units</a></li><li><a href=\"/manager-dashboard-process$fulfillment-time\">Fulfillment Time</a></li><li><a href=\"/manager-dashboard-process$average-curbside-wait\">Average Curbside Wait</a></li></ul></li></ul></li><li><a href=\"/manager-dashboard-process$shipment-orders\">Shipment Orders</a><ul><li><a href=\"/manager-dashboard-process$at-risk-evaluation\">At-Risk Evaluation</a></li><li><a href=\"/manager-dashboard-process$not-started\">Not Started</a></li><li><a href=\"/manager-dashboard-process$in-progress\">In Progress</a></li><li><a href=\"/manager-dashboard-process$being-packed\">Being Packed</a></li><li><a href=\"/manager-dashboard-process$being-sorted\">Being Sorted</a></li><li><a href=\"/manager-dashboard-process$prepared\">Prepared</a></li><li><a href=\"/manager-dashboard-process$store-nbsp-performance\">Store&nbsp;Performance</a><ul><li><a href=\"/manager-dashboard-process$fulfilled-units\">Fulfilled Units</a></li><li><a href=\"/manager-dashboard-process$fulfillment-time-for-shipment-orders\">Fulfillment Time for Shipment Orders</a></li></ul></li></ul></li><li><a href=\"/manager-dashboard-process$services\">Services</a></li></ul></div>\r\n\r\n<p>Fulfillment Progress allows store managers to see the operational status of the day's fulfillment activities in the current store. It&nbsp;provides store managers with operational metrics around&nbsp;the current day's store fulfillment activities.&nbsp;The dashboard provides visibility into&nbsp;the progress of fulfillment and allows&nbsp;the manager the opportunity to act on these metrics.&nbsp;</p>\r\n\r\n<p><a id=\"Dashboard refreshing\" name=\"Dashboard refreshing\"></a>Fulfillment Progress&nbsp;shows store information for the current date based on the store's time zone (12:00 AM - 11:59 PM).&nbsp;The dashboard reloads automatically at a configured interval (default 180 seconds) or can be manually refreshed. The last updated time that is displayed is based on the viewing user's time zone, if&nbsp;the viewing user is in a different time zone than the store. See the <a hqid=\"1905470\" href=\"/manager-dashboard-configuration\">configuration guide</a> for additional information.</p>\r\n\r\n<div class=\"tip\">To know more on the&nbsp; fulfillment progress activity during offline mode, please refer to the&nbsp;<a hqid=\"3324298\" href=\"/store-inventory-and-fulfillment-offline-support\">Store Offline Support</a>&nbsp;page.</div>\r\n\r\n<h4><a name=\"pickup-orders\" id=\"pickup-orders\"></a><a id=\"Pickup Orders\" name=\"Pickup Orders\"></a>Pickup Orders</h4>\r\n\r\n<p>This section provides insights into pickup activities for the current day. Pickups are store orders (fulfillments) whose delivery method is \"Pickup At Store\", or \"Ship To Store\" with \"Pickup\" set as the destination action. All pickups released to the store are represented in different statuses until the day they were picked up or cancelled, after which they will be removed from the count.&nbsp;Based on configuration, pickup metrics can also be displayed in terms of units. Refer to the&nbsp;<a hqid=\"1905470\" href=\"/manager-dashboard-configuration\">Fulfillment Progress Configuration guide</a>&nbsp;for additional details.</p>\r\n\r\n<h5><a name=\"associate-activity-nbsp\" id=\"associate-activity-nbsp\"></a>Associate Activity&nbsp;</h5>\r\n\r\n<p>This section covers the&nbsp;pickup activities that are performed before the customers arrive&nbsp;to pick up their orders.</p>\r\n\r\n<h6><a name=\"at-risk-evaluation\" id=\"at-risk-evaluation\"></a>At-Risk Evaluation</h6>\r\n\r\n<p>At-risk orders are highlighted for in-store pickup orders (including curbside orders)&nbsp;that have not started or are in progress. The at-risk&nbsp;designation&nbsp;indicates&nbsp;that these orders&nbsp;are&nbsp;at risk of missing the promised customer SLA. If the&nbsp;<span style=\"text-align: center;\">order's delivery</span><span style=\"text-align: center;\">&nbsp;due date - time is required to prepare pickup&nbsp;</span><span style=\"text-align: center;\">orders (configured) &lt;= current time</span>, it is&nbsp;at-risk.&nbsp;For example, consider an order with the&nbsp;due date 9/11/2023&nbsp;9:30 AM and configured time as 30 minutes. Once the current time is 9/11/2023&nbsp;9:00 AM or later, the order is at risk of meeting its delivery due date. Refer to the&nbsp;<a hqid=\"1905470\" href=\"/manager-dashboard-configuration\">Fulfillment Progress Configuration guide</a>&nbsp;for additional details.</p>\r\n\r\n<p>The Pickups Not Started and At Risk and Pickups In Progress and At-Risk services are used for evaluating at-risk orders in each of the corresponding statuses.</p>\r\n\r\n<h6><a name=\"not-started-nbsp\" id=\"not-started-nbsp\"></a>Not Started&nbsp;</h6>\r\n\r\n<p>Represents the number of&nbsp;in-store pickup orders (including curbside orders)&nbsp;in the store for which picking has not yet started. It&nbsp;includes pickups that are in \"Open\" status&nbsp;or \"Accepted\" status but are not on an&nbsp;active picklist. If the configuration to display unit metrics&nbsp;is enabled, metrics are displayed in terms of units as well as orders.</p>\r\n\r\n<p>The Pickups Not Started and Pickups Not Started And At-Risk services provide&nbsp;this information,&nbsp;and the Pickup Units Not Started service is used for evaluating units count.</p>\r\n\r\n<h6><a name=\"in-progress-nbsp\" id=\"in-progress-nbsp\"></a>In Progress&nbsp;</h6>\r\n\r\n<p>Represents the number of in-store pickup orders (including curbside orders) in the store for which picking is in progress. If the configuration to display unit metrics&nbsp;is enabled, metrics are displayed in terms of units as well as orders.&nbsp;</p>\r\n\r\n<p>The Pickups In Progress and Pickups In Progress And At-Risk&nbsp;services&nbsp;provide&nbsp;this information,&nbsp;and the Pickup Units In Progress&nbsp;service is used for evaluating units count.&nbsp;</p>\r\n\r\n<h6><a name=\"prepared-nbsp\" id=\"prepared-nbsp\"></a>Prepared&nbsp;</h6>\r\n\r\n<p>Represents the number of in-store pickup orders (including curbside orders) that have been picked for the current date&nbsp;in the store. It&nbsp;includes pickups in the status \"Picked up\" and \"Cancelled\" after picking. &nbsp;If the configuration to display unit metrics&nbsp;is enabled, metrics are displayed in terms of units as well as orders. Rejected units during picking are excluded from the prepared units count.&nbsp;</p>\r\n\r\n<p>The Pickups Prepared Today service provides this information,&nbsp;and the Pickup Units Prepared Today&nbsp;service is used for evaluating units count.</p>\r\n\r\n<h6><a name=\"being-sorted\" id=\"being-sorted\"></a>Being Sorted</h6>\r\n\r\n<p>If multiple associate picking is enabled (see Picking Process guide),&nbsp;this metric is computed. It represents the number of in-store pickup orders (including curbside orders) that have been picked and in the process of sorting. The&nbsp;Pickups Being Sorted service provides this information.</p>\r\n\r\n<h5><a name=\"customer-activity\" id=\"customer-activity\"></a>Customer Activity</h5>\r\n\r\n<p>This section covers the pickup activities performed after the pickup is prepared.</p>\r\n\r\n<h6><a name=\"awaiting-pickups\" id=\"awaiting-pickups\"></a>Awaiting Pickups</h6>\r\n\r\n<p>It represents the number of in-store pickup orders (including curbside orders) that are ready and awaiting pick up by a customer. The count is broken by the number of pickups which have exceeded the allowed number of days for pickup and those that are within the allowed pickup time.</p>\r\n\r\n<p>The Pickups Awaiting Pickup service provides&nbsp;this information.</p>\r\n\r\n<h6><a name=\"picked-up\" id=\"picked-up\"></a>Picked Up</h6>\r\n\r\n<p>Represents the number of in-store pickup orders (including curbside orders) that are picked up for the current date&nbsp;by the customer irrespective of when they were picked. It also&nbsp;includes those orders for which one line has been picked up and the rest has been cancelled.</p>\r\n\r\n<p>The Pickups Completed Today service provides this information.</p>\r\n\r\n<h6><a name=\"cancelled\" id=\"cancelled\"></a>Cancelled</h6>\r\n\r\n<p>Represents the number of in-store pickup orders (including curbside orders) that are cancelled on the current date&nbsp;irrespective of when they were picked.</p>\r\n\r\n<p>The Pickups Cancelled Today service provides this information.</p>\r\n\r\n<h6><a name=\"curbside-arrived\" id=\"curbside-arrived\"></a>Curbside Arrived</h6>\r\n\r\n<p>This displays the count of curbside orders for which customers have arrived and are awaiting pickup. Curbside fulfillments are shown here when they are either in Picked (3000.00) or Sorted status (3300.00), and their Pickup arrival date and time are updated. The UI indicator bar displays the number of curbside orders for a customer who has arrived as a percentage of the total outstanding curbside orders (see Curbside Pending metric below.) This metric is displayed&nbsp;based on a specific curbside Fulfillment Progress permission.</p>\r\n\r\n<p>From the Curbside Arrived metric, store users can link directly to the Curbside Pickup menu to view more information on the arrived curbside orders. This option is only available if the user has permission to view the Curbside Pickup menu.</p>\r\n\r\n<p>The Curbside with Arrival Date and Time service provides this information.</p>\r\n\r\n<h6><a name=\"curbside-on-the-way\" id=\"curbside-on-the-way\"></a><a id=\"Curbside On The Way Metrics\" name=\"Curbside On The Way Metrics\"></a>Curbside On The Way</h6>\r\n\r\n<p>This displays the count of curbside orders for which customers are on the way to the store for pick up. Curbside fulfillments are shown here when they are either in Picked (3000.00) or Sorted status (3300.00), and the customer is on the way,&nbsp;and their Pickup arrival date and time is not available (a time stamp value indicates that the customer has arrived). The UI indicator bar displays the number of curbside orders for a customer who is on the way to store as a percentage of the total outstanding curbside orders (see Curbside Pending metric below.) This metric is displayed&nbsp;based on a specific curbside Fulfillment Progress permission.</p>\r\n\r\n<p>From the Curbside On The Way metric, store users can link directly to the Curbside Pickup menu to view more information on the arrived and on the way curbside orders. This option is only available if the user has permission to view the Curbside Pickup menu.</p>\r\n\r\n<p>The Curbside On The Way&nbsp;service provides this information.</p>\r\n\r\n<h6><a name=\"curbside-pending\" id=\"curbside-pending\"></a>Curbside Pending</h6>\r\n\r\n<p>This represents the total number of curbside orders which are ready for pickup, corresponding to either Picked (3000.00) or Sorted status (3300.00.) This count also includes those pickups for which a customer has arrived (see Curbside Arrived metric above). The metric is displayed is based on a specific curbside Fulfillment Progress permission.</p>\r\n\r\n<p>The Curbside Count service provides this information.</p>\r\n\r\n<h6><a name=\"pickup-time\" id=\"pickup-time\"></a>Pickup Time</h6>\r\n\r\n<p>For all pickup orders picked up&nbsp;for the current date,&nbsp;the minimum, maximum, and average time&nbsp;for customers to pick up their orders in the store since they were&nbsp;prepared is provided. It&nbsp;is calculated as the<span style=\"color: rgb(0, 255, 255);\"> </span>difference between pickup confirmation time and pick completion time.&nbsp;</p>\r\n\r\n<p>The Time Taken To Pickup Today service provides this information.</p>\r\n\r\n<h6><a name=\"additional-purchases\" id=\"additional-purchases\"></a>Additional Purchases</h6>\r\n\r\n<p>When customers walk into a store to pick up their orders, they can&nbsp;purchase additional<span style=\"color: rgb(255, 0, 0);\">&nbsp;</span>items. The following details are provided for the pickup orders picked up for the current date:</p>\r\n\r\n<ul>\r\n\t<li>total value of the&nbsp;additional purchases</li>\r\n\t<li>number of additionally purchased units&nbsp;</li>\r\n\t<li>number of orders for which customers bought additional items</li>\r\n\t<li>% Additional value over value of picked up items</li>\r\n</ul>\r\n\r\n<p>The Additional Purchases Made For Pickups Today service provides this information.&nbsp;</p>\r\n\r\n<h6><a name=\"return-to-shelf\" id=\"return-to-shelf\"></a><span>Return to Shelf</span></h6>\r\n\r\n<p>If the customer does not pick up the orders (No Show by the customer), or cancels orders that are already ready for pickup, then the associate needs to return such orders to the shelf. The Return to Shelf metric displays the number of orders that are eligible for returning to the shelf. This metric is displayed based on the configuration. Refer to the&nbsp;<a hqid=\"1905470\" href=\"/manager-dashboard-configuration\">Fulfillment Progress Configuration</a>&nbsp;guide for details.</p>\r\n\r\n<address>Exception</address>\r\n\r\n<p>Please note that when sorting is enabled, the Return to Shelf menu count&nbsp;displays&nbsp;order line-level records, whereas the Fulfillment Progress always displays the total number of orders that are eligible for returning to the shelf;&nbsp;therefore, when sorting is enabled, the Return to Shelf menu count may not match with the count of the Return to Shelf orders in Fulfillment Progress.</p>\r\n\r\n<p><span style=\"font-size: 1.12em;\">Store Performance</span></p>\r\n\r\n<h6><a name=\"fulfilled-units\" id=\"fulfilled-units\"></a>Fulfilled Units</h6>\r\n\r\n<p>The Pickups Picked And Rejected Units Today service gives&nbsp;% of fulfilled units vs % of rejected units for the pickup orders picked on the current date. For example, if 100 units were ordered for all pickups picked today and 25 units were rejected, then 75% of the units would be considered as fulfilled and 25% of the units rejected.</p>\r\n\r\n<h6><a name=\"fulfillment-time\" id=\"fulfillment-time\"></a>Fulfillment Time</h6>\r\n\r\n<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">Provides&nbsp;the minimum, maximum, and average time taken to prepare pickup orders in the store for the current date. It&nbsp;is calculated as the difference between pick completion and the fulfillment creation time. For the&nbsp;calculation, all the pickups picked for the current date&nbsp;are considered, including orders&nbsp;which are awaiting customer pickup, picked up or cancelled by the customer. This calculation includes both the store fulfillment and non-fulfillment hours.</p>\r\n\r\n<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">If time-based Store Goals are used and Store Fulfillment Hours are configured, the min, max and average fulfillment times on this screen are&nbsp;calculated based on the store's fulfilling hours. Refer to the <a hqid=\"3418180\" href=\"/storegoals\">Store Goals configuration</a> for more information.</p>\r\n\r\n<h6><a name=\"average-curbside-wait\" id=\"average-curbside-wait\"></a>Average Curbside Wait</h6>\r\n\r\n<p>Provides&nbsp;the minimum, maximum, and average time taken to deliver&nbsp;curbside pickup orders to customers in the store&nbsp;for the current date.&nbsp;It&nbsp;is calculated as the difference between the pickup completion time and the pickup arrival time.&nbsp;</p>\r\n\r\n<p>The Avg&nbsp;Curbside Wait Time service provides this information.</p>\r\n\r\n<h4><a name=\"shipment-orders\" id=\"shipment-orders\"></a>Shipment Orders</h4>\r\n\r\n<p>This&nbsp;section&nbsp;presents store managers with the&nbsp;count of shipment&nbsp;orders in various stages of fulfillment&nbsp;as well as&nbsp;key metrics about how the store is performing&nbsp;with respect to 'ship to address'&nbsp;orders for the current day.&nbsp;Shipment orders correspond to&nbsp;fulfillments that&nbsp;have delivery method set to&nbsp;'ship to address' or delivery method set&nbsp;to&nbsp;'ship to store' and destination action set to merge.&nbsp;Based on configuration, shipment metrics can also be displayed in terms of units. Refer to the&nbsp;<a hqid=\"1905470\" href=\"/manager-dashboard-configuration\">Fulfillment Progress Configuration guide</a><a href=\"https://omni.helpdocsonline.com/manager-dashboard-configuration$configuration-for-fulfillment-progress-dashboard-to-consider-only-store-fulfillment-hours\">&nbsp;</a>for additional details.</p>\r\n\r\n<h6><a name=\"at-risk-evaluation\" id=\"at-risk-evaluation\"></a>At-Risk Evaluation</h6>\r\n\r\n<p>At-risk orders are highlighted for orders that are not started, in progress or being packed. The at-risk designation indicates&nbsp;that these orders&nbsp;are&nbsp;at risk of missing the promised customer SLA. If the&nbsp;<span style=\"text-align: center;\">order's shipping</span><span style=\"text-align: center;\">&nbsp;due date - time is required to prepare shipment</span><span style=\"text-align: center;\">&nbsp;orders (configured) &lt;= current time</span>, it is&nbsp;at-risk. Refer to the&nbsp;<a hqid=\"1905470\" href=\"/manager-dashboard-configuration\">Fulfillment Progress Configuration guide</a>&nbsp;for additional details.</p>\r\n\r\n<p>The Shipments Not Started and At-Risk, Shipments In Progress and At Risk&nbsp;and Shipments Being Packed and At-Risk&nbsp;services are used for evaluating at-risk shipments in each of the corresponding statuses.&nbsp;All at-risk counts are shown in terms of order count.</p>\r\n\r\n<div class=\"tip\">Note: The At-Risk indicator is only shown for Ship To Address orders and not for Ship To Store orders.</div>\r\n\r\n<h6><a name=\"not-started\" id=\"not-started\"></a>Not Started</h6>\r\n\r\n<p>Represents the count of all shipments where fulfillment&nbsp;has not yet started.&nbsp;This is a good indicator of the amount of work that&nbsp;needs to be done.&nbsp;Shipments with a maximum fulfillment status of \"Created\" or \"Accepted\" (without an active picklist) are counted here.&nbsp;If the configuration to display unit metrics&nbsp;is enabled, metrics are displayed in terms of units as well as orders.</p>\r\n\r\n<p>The Shipments Not Started service&nbsp;is used for evaluating the number of fulfillments count,&nbsp;and the Shipment Units Not Started service is used for evaluating units count.</p>\r\n\r\n<h6><a name=\"in-progress\" id=\"in-progress\"></a>In Progress</h6>\r\n\r\n<p>Represents the count of shipment orders that are currently&nbsp;being picked by associates. Picking is typically the most time-consuming process of fulfillment.&nbsp;Shipment orders with a minimum fulfillment status&nbsp;\"Accepted\" (with an active picklist) are counted here. If the configuration to display unit metrics&nbsp;is enabled, metrics are displayed in terms of units as well as orders.</p>\r\n\r\n<p>The Shipments In Progress service is used to&nbsp;evaluate&nbsp;the number of fulfillments count and the&nbsp;Shipment Units&nbsp;In Progress service is used for evaluating units count.</p>\r\n\r\n<h6><a name=\"being-packed\" id=\"being-packed\"></a>Being Packed</h6>\r\n\r\n<p>Represents the count of shipment orders that are currently&nbsp;being packed by the associates. Shipment orders with a minimum fulfillment status of \"Picked\" and less than&nbsp;\"Packed\" are counted here. If the configuration to display unit metrics&nbsp;is enabled, metrics are displayed in terms of units as well as orders.</p>\r\n\r\n<p>The Shipments Being Packed service is&nbsp;used for evaluating the number of fulfillments count and the&nbsp;Shipment Units&nbsp;Being Packed service is used for evaluating units count.</p>\r\n\r\n<h6><a name=\"being-sorted\" id=\"being-sorted\"></a>Being Sorted</h6>\r\n\r\n<p>If multiple associate&nbsp;picking is enabled (see&nbsp;Picking Process guide),&nbsp;this metric is computed. It represents the number of shipment orders that have been picked and in the process of sorting. The Shipments&nbsp;Being Sorted service provides this&nbsp;information.</p>\r\n\r\n<h6><a name=\"prepared\" id=\"prepared\"></a>Prepared</h6>\r\n\r\n<p>Represents the count of all shipments that are completely packed for the current day. &nbsp;Shipments&nbsp;with a minimum fulfillment status of &gt;= \"Packed\" and packed date = current day are counted here. If the configuration to display unit metrics&nbsp;is enabled, metrics are displayed in terms of units as well as orders.</p>\r\n\r\n<p>The Shipments Packed Today service is used for the number of fulfillments count&nbsp;and the&nbsp;Shipment Units Packed&nbsp;Today service is used for evaluating units count.</p>\r\n\r\n<h5><a name=\"store-nbsp-performance\" id=\"store-nbsp-performance\"></a>Store&nbsp;Performance</h5>\r\n\r\n<h6><a name=\"fulfilled-units\" id=\"fulfilled-units\"></a>Fulfilled Units</h6>\r\n\r\n<p>Provides the percentage of units fulfilled versus rejected for shipment orders for the current store and day.&nbsp;Fulfilled and rejected percentages are calculated as follows:</p>\r\n\r\n<p>% Fulfilled = Total Ordered - Total Rejected/ Total ordered units* 100 for all shipments&nbsp;prepared on the current day.</p>\r\n\r\n<p>% Rejected = 100% - % Fulfilled</p>\r\n\r\n<p>The Shipments Packed and Rejected Today service provides this metric.</p>\r\n\r\n<h6><a name=\"fulfillment-time-for-shipment-orders\" id=\"fulfillment-time-for-shipment-orders\"></a>Fulfillment Time for Shipment Orders</h6>\r\n\r\n<p>Fulfillment time is calculated as the difference between fulfillment pack completion time and fulfillment&nbsp;created time. The minimum, maximum, and average fulfillment time are calculated for shipment orders that are prepared today. The Time Taken to Prepare Shipments Today service computes this information.</p>\r\n\r\n<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">If time-based Store Goals are used and Store Fulfillment Hours are configured, the min, max and average fulfillment times on this screen are&nbsp;calculated based on the store's fulfilling hours. Refer to the <a hqid=\"3418180\" href=\"/storegoals\">Store Goals configuration</a> for more information.</p>\r\n\r\n<h4><a name=\"services\" id=\"services\"></a>Services</h4>\r\n\r\n<p>The&nbsp;APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<p>While the UI supports viewing for a single store, the following services can be called for one or more stores&nbsp;at a given time.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 1000px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\">Service</th>\r\n\t\t\t<th scope=\"col\">Component</th>\r\n\t\t\t<th scope=\"col\">Group&nbsp;</th>\r\n\t\t\t<th scope=\"col\">Service Endpoint</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Pickups not started and not at risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/notStarted/noRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickups not started and at risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/notStarted/atRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickup Units Not Started And Not At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/pickups/notStarted</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickup Units Not Started And At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/pickups/notStarted/atRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickups in progress and not at risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/inProgress/noRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickups in progress and at risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/inProgress/atRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickup Units In Progress And Not At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/pickups/inProgress/noRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickup Units In Progress And At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/pickups/inProgress/atRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickups Prepared Today</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/readyForPickup</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickup Units Prepared Today</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/pickups/readyForPickup</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickups Being Sorted</td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">Fu</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">lfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent</span></td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">f</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ulfillment-dashboard-co</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">n</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">trol</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">le</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">r</span></td>\r\n\t\t\t<td>fulfillment<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/api/fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent/dashb</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">oard/</span>totalOrders/<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">pickup/beingSorted</span></td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickups awaiting pickup</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/notAged</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickups having no show</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/noShow</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickups Completed today</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/pickedupToday</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickups Cancelled today</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/cancelledToday</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Pickups&nbsp;picked and rejected units today</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalUnits/pickup/pickedAndRejectedToday</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Time taken to pickup today</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/timeTaken/pickup/sincePicking</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Time taken to prepare pickups today</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/timeTaken/pickup/sincePlacing</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Curbside with Arrival Date and Time</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/curbsideWithPickupArrivalDate</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Curbside Count</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/curbside</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Curbside On The Way</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/curbsideWithCustomerOnTheWay</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Avg Curbside Wait Time</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/timeTaken/getAverageCurbsideWaitTime</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Additional purchases made for pickups today</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/pickup/additionalPurchases</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipments Not Started and Not At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/shipments/notStarted/noRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipments Not Started and At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/shipments/notStarted/atRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipments In Progress and Not At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/shipments/inProgress/noRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipments In Progress and At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent-dashboard-controller</span></td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/shipments/inProgress/atRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipments Being Packed and Not At risk</td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">Fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent</span></td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent-dashboard-controller</span></td>\r\n\t\t\t<td>fulfillment<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/</span>api<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/fulfillment/</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">dashboard/</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">t</span>otalOrders/shipments/beingPacked<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif; background-color: rgb(230, 230, 230);\">/</span>noRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipments Being Packed and At risk</td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">Fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent</span></td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent-dashboard-controller</span></td>\r\n\t\t\t<td>fulfillment<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/api/fulfillment/dashboard/</span>totalOrders<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/shipments/</span>beingPacked<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/</span>atRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipments Being Sorted</td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">Fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent</span></td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent-dashboard-controller</span></td>\r\n\t\t\t<td>fulfillment<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/</span>api<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/fulfillment/</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">dashboard/</span>totalOrders<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/shipments/</span>beingSorted</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipments Packed Today</td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">Fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent</span></td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent-dashboard-controller</span></td>\r\n\t\t\t<td>\r\n\t\t\t<p>fulfillment<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/</span>api<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/fulfillment/</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">dashboard/</span>totalOrders/shipments/packed</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Time Taken to Prepare Shipments Today</td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">Fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent</span></td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent-dashboard-controller</span></td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/timeTaken/shipments</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipments Packed and Rejected Today</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent-dashboard-controller</span></td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrders/shipments/packedandRejectedToday</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Eligible Return to Shelf Order Count</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">fulfillm</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent-dashboard-controller</span></td>\r\n\t\t\t<td>fulfillment<span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">/api/fulfillment/dashboard/totalOrders/pickup/returnToShelf</span></td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipment Units Not Started</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/notStarted</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipment Units Not Started and At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/notStarted/atRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipment Units In Progress and Not At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/inProgress/noRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipment Units In Progress and At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/inProgress/atRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipment Units Being Packed and Not At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/beingPacked/noRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipment Units Being Packed and At Risk</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/beingPacked/atRisk</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipment Units Packed Today</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-dashboard-controller</td>\r\n\t\t\t<td>fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/packedToday</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 38289,
  "scraped_at": "2025-08-09T22:04:16.247221",
  "content_clean": "Home ››Manhattan Active® Omni››Store››Process & Configuration Guides››Store Inventory & Fulfillment››Store Order Fulfillment››Fulfillment Progress ››Fulfillment Progress Process Fulfillment Progress Process Pickup OrdersAssociate Activity At-Risk EvaluationNot Started In Progress Prepared Being SortedCustomer ActivityAwaiting PickupsPicked UpCancelledCurbside ArrivedCurbside On The WayCurbside PendingPickup TimeAdditional PurchasesReturn to ShelfFulfilled UnitsFulfillment TimeAverage Curbside WaitShipment OrdersAt-Risk EvaluationNot StartedIn ProgressBeing PackedBeing SortedPreparedStore PerformanceFulfilled UnitsFulfillment Time for Shipment OrdersServices Fulfillment Progress allows store managers to see the operational status of the day's fulfillment activities in the current store. It provides store managers with operational metrics around the current day's store fulfillment activities. The dashboard provides visibility into the progress of fulfillment and allows the manager the opportunity to act on these metrics. Fulfillment Progress shows store information for the current date based on the store's time zone (12:00 AM - 11:59 PM). The dashboard reloads automatically at a configured interval (default 180 seconds) or can be manually refreshed. The last updated time that is displayed is based on the viewing user's time zone, if the viewing user is in a different time zone than the store. See the configuration guide for additional information. To know more on the  fulfillment progress activity during offline mode, please refer to the Store Offline Support page. Pickup Orders This section provides insights into pickup activities for the current day. Pickups are store orders (fulfillments) whose delivery method is \"Pickup At Store\", or \"Ship To Store\" with \"Pickup\" set as the destination action. All pickups released to the store are represented in different statuses until the day they were picked up or cancelled, after which they will be removed from the count. Based on configuration, pickup metrics can also be displayed in terms of units. Refer to the Fulfillment Progress Configuration guide for additional details. Associate Activity This section covers the pickup activities that are performed before the customers arrive to pick up their orders. At-Risk Evaluation At-risk orders are highlighted for in-store pickup orders (including curbside orders) that have not started or are in progress. The at-risk designation indicates that these orders are at risk of missing the promised customer SLA. If the order's delivery due date - time is required to prepare pickup orders (configured) <= current time, it is at-risk. For example, consider an order with the due date 9/11/2023 9:30 AM and configured time as 30 minutes. Once the current time is 9/11/2023 9:00 AM or later, the order is at risk of meeting its delivery due date. Refer to the Fulfillment Progress Configuration guide for additional details. The Pickups Not Started and At Risk and Pickups In Progress and At-Risk services are used for evaluating at-risk orders in each of the corresponding statuses. Not Started Represents the number of in-store pickup orders (including curbside orders) in the store for which picking has not yet started. It includes pickups that are in \"Open\" status or \"Accepted\" status but are not on an active picklist. If the configuration to display unit metrics is enabled, metrics are displayed in terms of units as well as orders. The Pickups Not Started and Pickups Not Started And At-Risk services provide this information, and the Pickup Units Not Started service is used for evaluating units count. In Progress Represents the number of in-store pickup orders (including curbside orders) in the store for which picking is in progress. If the configuration to display unit metrics is enabled, metrics are displayed in terms of units as well as orders. The Pickups In Progress and Pickups In Progress And At-Risk services provide this information, and the Pickup Units In Progress service is used for evaluating units count. Prepared Represents the number of in-store pickup orders (including curbside orders) that have been picked for the current date in the store. It includes pickups in the status \"Picked up\" and \"Cancelled\" after picking.  If the configuration to display unit metrics is enabled, metrics are displayed in terms of units as well as orders. Rejected units during picking are excluded from the prepared units count. The Pickups Prepared Today service provides this information, and the Pickup Units Prepared Today service is used for evaluating units count. Being Sorted If multiple associate picking is enabled (see Picking Process guide), this metric is computed. It represents the number of in-store pickup orders (including curbside orders) that have been picked and in the process of sorting. The Pickups Being Sorted service provides this information. Customer Activity This section covers the pickup activities performed after the pickup is prepared. Awaiting Pickups It represents the number of in-store pickup orders (including curbside orders) that are ready and awaiting pick up by a customer. The count is broken by the number of pickups which have exceeded the allowed number of days for pickup and those that are within the allowed pickup time. The Pickups Awaiting Pickup service provides this information. Picked Up Represents the number of in-store pickup orders (including curbside orders) that are picked up for the current date by the customer irrespective of when they were picked. It also includes those orders for which one line has been picked up and the rest has been cancelled. The Pickups Completed Today service provides this information. Cancelled Represents the number of in-store pickup orders (including curbside orders) that are cancelled on the current date irrespective of when they were picked. The Pickups Cancelled Today service provides this information. Curbside Arrived This displays the count of curbside orders for which customers have arrived and are awaiting pickup. Curbside fulfillments are shown here when they are either in Picked (3000.00) or Sorted status (3300.00), and their Pickup arrival date and time are updated. The UI indicator bar displays the number of curbside orders for a customer who has arrived as a percentage of the total outstanding curbside orders (see Curbside Pending metric below.) This metric is displayed based on a specific curbside Fulfillment Progress permission. From the Curbside Arrived metric, store users can link directly to the Curbside Pickup menu to view more information on the arrived curbside orders. This option is only available if the user has permission to view the Curbside Pickup menu. The Curbside with Arrival Date and Time service provides this information. Curbside On The Way This displays the count of curbside orders for which customers are on the way to the store for pick up. Curbside fulfillments are shown here when they are either in Picked (3000.00) or Sorted status (3300.00), and the customer is on the way, and their Pickup arrival date and time is not available (a time stamp value indicates that the customer has arrived). The UI indicator bar displays the number of curbside orders for a customer who is on the way to store as a percentage of the total outstanding curbside orders (see Curbside Pending metric below.) This metric is displayed based on a specific curbside Fulfillment Progress permission. From the Curbside On The Way metric, store users can link directly to the Curbside Pickup menu to view more information on the arrived and on the way curbside orders. This option is only available if the user has permission to view the Curbside Pickup menu. The Curbside On The Way service provides this information. Curbside Pending This represents the total number of curbside orders which are ready for pickup, corresponding to either Picked (3000.00) or Sorted status (3300.00.) This count also includes those pickups for which a customer has arrived (see Curbside Arrived metric above). The metric is displayed is based on a specific curbside Fulfillment Progress permission. The Curbside Count service provides this information. Pickup Time For all pickup orders picked up for the current date, the minimum, maximum, and average time for customers to pick up their orders in the store since they were prepared is provided. It is calculated as the difference between pickup confirmation time and pick completion time. The Time Taken To Pickup Today service provides this information. Additional Purchases When customers walk into a store to pick up their orders, they can purchase additional items. The following details are provided for the pickup orders picked up for the current date: total value of the additional purchases number of additionally purchased units number of orders for which customers bought additional items % Additional value over value of picked up items The Additional Purchases Made For Pickups Today service provides this information. Return to Shelf If the customer does not pick up the orders (No Show by the customer), or cancels orders that are already ready for pickup, then the associate needs to return such orders to the shelf. The Return to Shelf metric displays the number of orders that are eligible for returning to the shelf. This metric is displayed based on the configuration. Refer to the Fulfillment Progress Configuration guide for details. Exception Please note that when sorting is enabled, the Return to Shelf menu count displays order line-level records, whereas the Fulfillment Progress always displays the total number of orders that are eligible for returning to the shelf; therefore, when sorting is enabled, the Return to Shelf menu count may not match with the count of the Return to Shelf orders in Fulfillment Progress. Store Performance Fulfilled Units The Pickups Picked And Rejected Units Today service gives % of fulfilled units vs % of rejected units for the pickup orders picked on the current date. For example, if 100 units were ordered for all pickups picked today and 25 units were rejected, then 75% of the units would be considered as fulfilled and 25% of the units rejected. Fulfillment Time Provides the minimum, maximum, and average time taken to prepare pickup orders in the store for the current date. It is calculated as the difference between pick completion and the fulfillment creation time. For the calculation, all the pickups picked for the current date are considered, including orders which are awaiting customer pickup, picked up or cancelled by the customer. This calculation includes both the store fulfillment and non-fulfillment hours. If time-based Store Goals are used and Store Fulfillment Hours are configured, the min, max and average fulfillment times on this screen are calculated based on the store's fulfilling hours. Refer to the Store Goals configuration for more information. Average Curbside Wait Provides the minimum, maximum, and average time taken to deliver curbside pickup orders to customers in the store for the current date. It is calculated as the difference between the pickup completion time and the pickup arrival time. The Avg Curbside Wait Time service provides this information. Shipment Orders This section presents store managers with the count of shipment orders in various stages of fulfillment as well as key metrics about how the store is performing with respect to 'ship to address' orders for the current day. Shipment orders correspond to fulfillments that have delivery method set to 'ship to address' or delivery method set to 'ship to store' and destination action set to merge. Based on configuration, shipment metrics can also be displayed in terms of units. Refer to the Fulfillment Progress Configuration guide for additional details. At-Risk Evaluation At-risk orders are highlighted for orders that are not started, in progress or being packed. The at-risk designation indicates that these orders are at risk of missing the promised customer SLA. If the order's shipping due date - time is required to prepare shipment orders (configured) <= current time, it is at-risk. Refer to the Fulfillment Progress Configuration guide for additional details. The Shipments Not Started and At-Risk, Shipments In Progress and At Risk and Shipments Being Packed and At-Risk services are used for evaluating at-risk shipments in each of the corresponding statuses. All at-risk counts are shown in terms of order count. Note: The At-Risk indicator is only shown for Ship To Address orders and not for Ship To Store orders. Not Started Represents the count of all shipments where fulfillment has not yet started. This is a good indicator of the amount of work that needs to be done. Shipments with a maximum fulfillment status of \"Created\" or \"Accepted\" (without an active picklist) are counted here. If the configuration to display unit metrics is enabled, metrics are displayed in terms of units as well as orders. The Shipments Not Started service is used for evaluating the number of fulfillments count, and the Shipment Units Not Started service is used for evaluating units count. In Progress Represents the count of shipment orders that are currently being picked by associates. Picking is typically the most time-consuming process of fulfillment. Shipment orders with a minimum fulfillment status \"Accepted\" (with an active picklist) are counted here. If the configuration to display unit metrics is enabled, metrics are displayed in terms of units as well as orders. The Shipments In Progress service is used to evaluate the number of fulfillments count and the Shipment Units In Progress service is used for evaluating units count. Being Packed Represents the count of shipment orders that are currently being packed by the associates. Shipment orders with a minimum fulfillment status of \"Picked\" and less than \"Packed\" are counted here. If the configuration to display unit metrics is enabled, metrics are displayed in terms of units as well as orders. The Shipments Being Packed service is used for evaluating the number of fulfillments count and the Shipment Units Being Packed service is used for evaluating units count. Being Sorted If multiple associate picking is enabled (see Picking Process guide), this metric is computed. It represents the number of shipment orders that have been picked and in the process of sorting. The Shipments Being Sorted service provides this information. Prepared Represents the count of all shipments that are completely packed for the current day.  Shipments with a minimum fulfillment status of >= \"Packed\" and packed date = current day are counted here. If the configuration to display unit metrics is enabled, metrics are displayed in terms of units as well as orders. The Shipments Packed Today service is used for the number of fulfillments count and the Shipment Units Packed Today service is used for evaluating units count. Store Performance Fulfilled Units Provides the percentage of units fulfilled versus rejected for shipment orders for the current store and day. Fulfilled and rejected percentages are calculated as follows: % Fulfilled = Total Ordered - Total Rejected/ Total ordered units* 100 for all shipments prepared on the current day. % Rejected = 100% - % Fulfilled The Shipments Packed and Rejected Today service provides this metric. Fulfillment Time for Shipment Orders Fulfillment time is calculated as the difference between fulfillment pack completion time and fulfillment created time. The minimum, maximum, and average fulfillment time are calculated for shipment orders that are prepared today. The Time Taken to Prepare Shipments Today service computes this information. If time-based Store Goals are used and Store Fulfillment Hours are configured, the min, max and average fulfillment times on this screen are calculated based on the store's fulfilling hours. Refer to the Store Goals configuration for more information. Services The APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on each service. While the UI supports viewing for a single store, the following services can be called for one or more stores at a given time. Service Component Group Service Endpoint Pickups not started and not at risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/notStarted/noRisk Pickups not started and at risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/notStarted/atRisk Pickup Units Not Started And Not At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/pickups/notStarted Pickup Units Not Started And At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/pickups/notStarted/atRisk Pickups in progress and not at risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/inProgress/noRisk Pickups in progress and at risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/inProgress/atRisk Pickup Units In Progress And Not At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/pickups/inProgress/noRisk Pickup Units In Progress And At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/pickups/inProgress/atRisk Pickups Prepared Today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/readyForPickup Pickup Units Prepared Today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/pickups/readyForPickup Pickups Being Sorted Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/beingSorted Pickups awaiting pickup Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/notAged Pickups having no show Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/noShow Pickups Completed today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/pickedupToday Pickups Cancelled today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/cancelledToday Pickups picked and rejected units today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalUnits/pickup/pickedAndRejectedToday Time taken to pickup today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/timeTaken/pickup/sincePicking Time taken to prepare pickups today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/timeTaken/pickup/sincePlacing Curbside with Arrival Date and Time Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/curbsideWithPickupArrivalDate Curbside Count Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/curbside Curbside On The Way Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/curbsideWithCustomerOnTheWay Avg Curbside Wait Time Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/timeTaken/getAverageCurbsideWaitTime Additional purchases made for pickups today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/additionalPurchases Shipments Not Started and Not At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/shipments/notStarted/noRisk Shipments Not Started and At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/shipments/notStarted/atRisk Shipments In Progress and Not At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/shipments/inProgress/noRisk Shipments In Progress and At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/shipments/inProgress/atRisk Shipments Being Packed and Not At risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/shipments/beingPacked/noRisk Shipments Being Packed and At risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/shipments/beingPacked/atRisk Shipments Being Sorted Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/shipments/beingSorted Shipments Packed Today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/shipments/packed Time Taken to Prepare Shipments Today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/timeTaken/shipments Shipments Packed and Rejected Today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/shipments/packedandRejectedToday Eligible Return to Shelf Order Count Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrders/pickup/returnToShelf Shipment Units Not Started Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/notStarted Shipment Units Not Started and At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/notStarted/atRisk Shipment Units In Progress and Not At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/inProgress/noRisk Shipment Units In Progress and At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/inProgress/atRisk Shipment Units Being Packed and Not At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/beingPacked/noRisk Shipment Units Being Packed and At Risk Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/beingPacked/atRisk Shipment Units Packed Today Fulfillment fulfillment-dashboard-controller fulfillment/api/fulfillment/dashboard/totalOrderUnits/shipments/packedToday"
}