{
  "success": true,
  "permalink": "manual-forecast-change",
  "title": "Manual Forecast Change",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500947\" href=\"/supply-chain-planning\" class=\"breadcrumb-links\">Manhattan Active® Supply Chain Planning</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500948\" href=\"/process-configuration-guides-5\" class=\"breadcrumb-links\">Process &amp; Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500952\" href=\"/demand-forecasting-2\" class=\"breadcrumb-links\">Demand Forecasting</a></li><li> <span>››</span>Manual Forecast Change</li></ul>  \t\r\n\t\t<h2>Manual Forecast Change</h2>\r\n\r\n<a href=\"/forecast-analysis\" hqid=\"3565771\">Previous</a>&nbsp;I&nbsp;<a href=\"/day-of-week-profile\" hqid=\"3609554\">Next</a>\r\n<div class=\"info\"><ul><li><a href=\"/manual-forecast-change$features\">Features</a></li><li><a href=\"/manual-forecast-change$actions\">Actions</a></li></ul></div>\r\n\r\n<h2>Overview</h2>\r\n\r\n<p>The Forecast Adjustment Panel, located on the right-hand side of the Forecast Analysis Details interface, enables users to manage and adjust their forecasts. This functionality improves forecast accuracy by incorporating users’ knowledge of historical data, market trends, and potential volatilities that may not have been captured by the system.&nbsp;<br>\r\nThis panel permits adjustments to future period forecasts. Users can adjust future period forecasts, freeze future forecasts, or enter future seed data for a new item location.<br>\r\nModifications to the current period forecast and its associated information should be performed via the General Tab.<br>\r\nTo open this panel, the user can click the pencil icon next to one of the future periods on the data grid.&nbsp;</p>\r\n\r\n<h3><a name=\"features\" id=\"features\"></a>Features</h3>\r\n\r\n<p><strong>Data Grid</strong></p>\r\n\r\n<ul>\r\n\t<li>Rows that show current or past data are non-editable.&nbsp;</li>\r\n\t<li>The current period row is shaded in a darker color.</li>\r\n\t<li>Pencil colors:</li>\r\n\t<li style=\"margin-left: 40px;\">Blue: Indicates the future period that is shown on the adjustment panel.</li>\r\n\t<li style=\"margin-left: 40px;\">Gray: Indicates past periods.</li>\r\n\t<li style=\"margin-left: 40px;\">Black: Indicates the current period.</li>\r\n\t<li>&nbsp;The seasonalized forecast cell has an indicator on the top right corner for periods where an adjustment has been made.&nbsp;</li>\r\n</ul>\r\n\r\n<p><strong>Adjustment Panel</strong></p>\r\n\r\n<ul>\r\n\t<li>The selected period start date is displayed on the top.</li>\r\n\t<li>When the panel is opened, if there was already a previous manual forecast event created, then this information is displayed on the panel. If there was no previous forecast adjustment, then the panel shows the same seasonalized forecast value that is displayed on the data grid.&nbsp;</li>\r\n\t<li>Clicking on the Cancel, Remove or Save action button closes the panel.</li>\r\n</ul>\r\n\r\n<p><strong>Seasonalized Forecast</strong></p>\r\n\r\n<ul>\r\n\t<li>Changing the Seasonalized Forecast on the right panel updates the projections on the data grid starting from that period until another future period with manual adjustment. For instance, changing period #35 to 100 units and period #40 to 150 units will change projections of period #35- #39 to 100 units, and period #40 onward to 150 units.&nbsp;</li>\r\n</ul>\r\n\r\n<p><strong>Planned Demand Quantity</strong></p>\r\n\r\n<ul>\r\n\t<li>This non-editable field displays the sum of all planned demand quantities for the period, including the Planned Demand percentage after being converted to units.</li>\r\n\t<li>&nbsp;There are multiple planned demand records for the period. The backend process sums up planned demand quantities and percentages for the period, item, and location before displaying the total number on the UI.&nbsp;</li>\r\n\t<li>Occasionally, the Planned Demand in Item Location Analysis can slightly differ from the one in Forecast Analysis, e.g., when manual forecast adjustment was made, but SOQ has not been recalculated in IO.</li>\r\n</ul>\r\n\r\n<p><strong>Total Forecast</strong></p>\r\n\r\n<ul>\r\n\t<li>This non-editable field is the sum of the Seasonalized Forecast and Planned Demand Quantity, calculated by the UI.</li>\r\n</ul>\r\n\r\n<p><strong>Freeze Forecast</strong></p>\r\n\r\n<ul>\r\n\t<li>Freeze Forecast allows a user to freeze the forecast value for a range of time in the future.&nbsp;</li>\r\n\t<li>If a freeze forecast is applied without altering the seasonalized forecast, the seasonalized forecast on the data grid will remain unchanged until that period arrives, in which the backend process will determine the actual seasonalized based on the freeze type (no change, increase only, or decrease only).</li>\r\n\t<li>The Freeze Type indicates whether the forecast value can go down only, go up only, or remain static.&nbsp;</li>\r\n\t<li>The freeze end date calendar widget allows a user to select a future period date.</li>\r\n\t<li>Since forecast calculation is done by period, if the user selects a freeze end date that falls in the middle of the week, the system will still apply the freeze until the end of the week.</li>\r\n</ul>\r\n\r\n<p><strong>Seed Forecast</strong></p>\r\n\r\n<ul>\r\n\t<li>A seed forecast is a manual forecast event that is effective before the first period of demand is there. This helps forecast a new item location without any existing history. After generating forecast projections, the seed forecast can be input as a manual forecast adjustment. Entering a seed forecast without first generating forecast projections is currently not supported.&nbsp;</li>\r\n\t<li>For new item locations, the user can also create an Item Relationship to copy a demand history from a comparable existing item to this new item.</li>\r\n</ul>\r\n\r\n<h3><a name=\"actions\" id=\"actions\"></a>Actions</h3>\r\n\r\n<p><strong>Save&nbsp;</strong></p>\r\n\r\n<ul>\r\n\t<li>The adjustment is immediately processed.</li>\r\n\t<li>Manual forecast changes, freeze dates, and types are stored in a separate entity called Manual Forecast Event.</li>\r\n\t<li>Similar validation as modifying Seasonalized Forecast from the current Forecast UI for the current period is executed.</li>\r\n\t<li>Forecast projections for the corresponding periods are recalculated.</li>\r\n\t<li>A notification indicating either a successful operation or a validation error is displayed on the screen.</li>\r\n\t<li>The data grid is reloaded with updated information.</li>\r\n\t<li>The Forecast API is sent to the replenishment system for Suggested Order Quantity (SOQ) recalculation.</li>\r\n\t<li>The Latest Manual Forecast Apply Date is updated to the Period Start Date of the adjustment.</li>\r\n\t<li>The manual forecast information on the general tab is updated.</li>\r\n</ul>\r\n\r\n<p><strong>Cancel</strong></p>\r\n\r\n<ul>\r\n\t<li>None of the changes were committed.&nbsp;</li>\r\n</ul>\r\n\r\n<p><strong>Remove</strong></p>\r\n\r\n<ul>\r\n\t<li>The remove button serves the purpose of undoing any prior manual modifications made to the forecast. It removes the manual forecast and freeze forecast from the manual forecast entity.</li>\r\n\t<li>This button is only enabled when there is an existing manual forecast event.</li>\r\n\t<li>Forecast projections are recalculated.</li>\r\n\t<li>Forecast projections for the corresponding periods are recalculated.</li>\r\n\t<li>A notification indicating either a successful operation or a validation error is displayed on the screen.</li>\r\n\t<li>The data grid is reloaded with updated information.</li>\r\n\t<li>The Forecast API is sent to the replenishment system for Suggested Order Quantity (SOQ) recalculation.<br>\r\n\t&nbsp;</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 7785,
  "scraped_at": "2025-08-09T22:37:28.188714"
}