{
  "success": true,
  "permalink": "metrics-dashboard",
  "title": "Metrics Dashboard",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158972\" href=\"/order-promising\" class=\"breadcrumb-links\">Order Promising</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2592404\" href=\"/interactive-inv\" class=\"breadcrumb-links\">Interactive Inventory</a></li><li> <span>››</span>Metrics Dashboard</li></ul>  \t\r\n\t\t<h2>Metrics Dashboard</h2>\r\n\r\n<p></p>\r\n\r\n<a href=\"/reservationsfromcache\" hqid=\"2792232\">Previous</a>&nbsp;I&nbsp;<a href=\"/deliverydateperformance\" hqid=\"2837120\">Next</a>\r\n<p>&nbsp;</p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/metrics-dashboard$overview\">Overview</a></li><li><a href=\"/metrics-dashboard$what-is-tracked\">What is Tracked</a></li><li><a href=\"/metrics-dashboard$process-flow\">Process Flow</a><ul><li><a href=\"/metrics-dashboard$inventory-promising-order\">Inventory, Promising & Order</a></li><li><a href=\"/metrics-dashboard$ui-facade\">UI & Facade</a></li></ul></li><li><a href=\"/metrics-dashboard$interactive-inventory-metrics-dashboard-ui\">Interactive Inventory Metrics Dashboard UI</a><ul><li><a href=\"/metrics-dashboard$include-child-organizations\">Include Child Organizations</a></li><li><a href=\"/metrics-dashboard$dashboard-refresh\">Dashboard Refresh</a></li><li><a href=\"/metrics-dashboard$localization-formatting\">Localization & Formatting</a></li><li><a href=\"/metrics-dashboard$view-comparison-based-on-ml-predicted-dates\">View Comparison based on ML Predicted Dates</a></li><li><a href=\"/metrics-dashboard$integration\">Integration</a></li></ul></li><li><a href=\"/metrics-dashboard$configuration\">Configuration</a><ul><li><a href=\"/metrics-dashboard$grants\">Grants</a></li><li><a href=\"/metrics-dashboard$seed-data\">Seed Data</a></li></ul></li><li><a href=\"/metrics-dashboard$services\">Services</a></li><li><a href=\"/metrics-dashboard$related-articles\">Related Articles</a></li></ul></div>\r\n\r\n<h3><a name=\"overview\" id=\"overview\"></a>Overview</h3>\r\n\r\n<p>The Interactive Inventory Metrics Dashboard provides key metrics and KPIs related to Inventory and Promising, such as delivery date lead times and inventory availability. The dashboard provides visibility to the Availability API calls, Delivery Date API calls, and the orders created. The dashboard enables users to:</p>\r\n\r\n<ul>\r\n\t<li>Validate the lead times being promised are meeting business expectations.</li>\r\n\t<li>Assess the customer&#39;s preference with respect to fulfillment options.</li>\r\n\t<li>Improve fulfillment decisions based on the average number of shipments.</li>\r\n\t<li>Understand from where the requests are coming and make fulfillment decisions.</li>\r\n</ul>\r\n\r\n<h3><a name=\"what-is-tracked\" id=\"what-is-tracked\"></a>What is Tracked</h3>\r\n\r\n<p>The primary goal of this dashboard is to have more insight on the calls that are made from the ordering channels with respect to availability and dates. Interactive inventory related services&nbsp;will be tracked with respect to metrics for this dashboard. In addition to that, the dashboard also provides an insight&nbsp;on the orders created from these ordering channels, providing&nbsp;the users with the ability to understand the lead times and fulfillment options before and after an order is created. The following are the different services and touch points&nbsp;that are tracked for this dashboard:</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 1172px;\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 212px;\"><strong>Service</strong></td>\r\n\t\t\t<td style=\"width: 123px;\"><strong>Internal/External</strong></td>\r\n\t\t\t<td style=\"width: 736px;\"><strong>Description</strong></td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 212px;\">Get Location Availability</td>\r\n\t\t\t<td style=\"width: 123px;\">External</td>\r\n\t\t\t<td style=\"width: 736px;\">Service that provides availability status and quantity for a product or a list of products at a particular location on the Product Details Page.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 212px;\">Product Delivery Dates</td>\r\n\t\t\t<td style=\"width: 123px;\">External</td>\r\n\t\t\t<td style=\"width: 736px;\">Service that provides delivery dates on the Product Details Page for a single product.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 212px;\">Cart Delivery Dates</td>\r\n\t\t\t<td style=\"width: 123px;\">External</td>\r\n\t\t\t<td style=\"width: 736px;\">Service that provides delivery dates for the shopping cart during the checkout process.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 212px;\">Order Allocation</td>\r\n\t\t\t<td style=\"width: 123px;\">Internal</td>\r\n\t\t\t<td style=\"width: 736px;\">Allocation of an order once the order is dropped into Manhattan Active&reg; Omni.</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3><a name=\"process-flow\" id=\"process-flow\"></a>Process Flow</h3>\r\n\r\n<p>The following sections give an overview of the components involved end-to-end to capture metrics for interactive inventory and render&nbsp;it on the UI</p>\r\n\r\n<h4><a name=\"inventory-promising-order\" id=\"inventory-promising-order\"></a>Inventory, Promising & Order</h4>\r\n\r\n<p>These components capture&nbsp;the metrics that show up on the dashboard. The inventory component captures metrics related to Get Availability and Get Location Availability services. The promising component captures metrics related to product and cart delivery dates&nbsp;services. The order component captures metrics related to order allocation.</p>\r\n\r\n<p>There are 2 metric types tracked as part of these components:</p>\r\n\r\n<ul>\r\n\t<li>Counters: Counter is a cumulative metric whose value can only increase or be reset to zero on restart of a container. Example: Total number of &ldquo;Product Delivery Dates&rdquo; API will always be an increasing value and hence will be tracked as a counter.</li>\r\n\t<li>Gauge:&nbsp;Gauge represents a single numerical value that can arbitrarily go up and down. Example: Maximum Response time for a &ldquo;Product Delivery Dates&rdquo; API can go up and down and hence will be tracked as a Gauge.</li>\r\n</ul>\r\n\r\n<p>All counters and gauges are tracked as in-memory metrics, which is exposed every time the custom metrics end point is invoked. The respective components will push the metrics to the custom metrics end point, when invoked. These metrics will be tracked at a container level, and every time a container is restarted, these metrics are reset to their initial values.&nbsp;</p>\r\n\r\n<p>Every metric contains a name and a label or a list of labels which uniquely represents the metric. For example, the metric that tracks the request count for the &ldquo;Product&nbsp;Delivery Dates&rdquo; API is named &ldquo;interactive_request_count&quot; and has the following labels:</p>\r\n\r\n<ul>\r\n\t<li>Organization &ndash; Indicates from which organization the API call was made. This will be determined from the authorization token that was used to make the call.</li>\r\n\t<li>Source &ndash; Indicates from which source the API call was made. This will be determined from the request parameter &quot;source&quot;.</li>\r\n\t<li>Request Type &ndash; Indicates what type of request is being made. In this case, it will be &ldquo;CalculateDeliveryDates&rdquo; and will be determined based on&nbsp;the end point that is being invoked.</li>\r\n</ul>\r\n\r\n<p>Refer to <a hqid=\"2683666\" href=\"/metrics-dashboard$Interactive Inventory Metrics\">Interactive Inventory Metrics</a>&nbsp;for details on different metrics tracked for this dashboard.</p>\r\n\r\n<div class=\"tip\">NOTE: Apart from the labels that are created for specific metrics based on the functional use case, some labels like the Container ID, Component Name, etc. are tied to all the metrics. This allows users to query Prometheus for just a specific container data, if required.&nbsp;</div>\r\n\r\n<h4><a name=\"ui-facade\" id=\"ui-facade\"></a>UI & Facade</h4>\r\n\r\n<p>The UI will be available as a menu option on the home screen of the application. When a user, having&nbsp;required grants to access the UI, clicks on the &quot;Interactive Inventory Dashboard&quot; option, the UI sends a list of metric IDs to the facade layer. The facade layer is a translation layer, which will pull the metric information from Prometheus through the controller component and formate&nbsp;the response before sending it to the UI for rendering.&nbsp;For more details on the UI, refer to <a hqid=\"2683666\" href=\"/metrics-dashboard$Metrics Dashboard - UI\">Interactive Inventory Metrics Dashboard UI</a>.</p>\r\n\r\n<h3><a name=\"interactive-inventory-metrics-dashboard-ui\" id=\"interactive-inventory-metrics-dashboard-ui\"></a><a id=\"Metrics Dashboard - UI\" name=\"Metrics Dashboard - UI\"></a>Interactive Inventory Metrics Dashboard UI</h3>\r\n\r\n<p>The metrics dashboard resides in the inventoryfacade component. Users can navigate to <strong>Menu -&gt; Interactive Inventory Dashboard </strong>from the home screen&nbsp;to access the dashboard UI. The dashboard consists of 3 different panels:</p>\r\n\r\n<ul>\r\n\t<li>Product Details Page panel &ndash; Displays metrics related to the &quot;Product Delivery Dates&quot; and &ldquo;Get Location Availability&rdquo; services.</li>\r\n\t<li>Shopping Cart/Checkout panel &ndash; Displays metrics related to the &ldquo;Cart Delivery Dates&rdquo; service.</li>\r\n\t<li>Orders Panel &ndash; Displays Order related information for all orders created over a period of time.</li>\r\n</ul>\r\n\r\n<p>Users can select a specific organization for which the metrics will be displayed. The UI has a static time window of 24 hours, which means that any time the UI is loaded, all the metrics are loaded for the last 24 hours, with the exception of Response time metrics in the PDP and CART panels, which will be loaded for the last 1 hour.</p>\r\n\r\n<h4><a name=\"include-child-organizations\" id=\"include-child-organizations\"></a>Include Child Organizations</h4>\r\n\r\n<p>The dashboard UI has the ability to show metrics for a specific organization or a hierarchy of organizations. When the &ldquo;Include Child Orgs&rdquo; check box is selected, the UI loads with metrics for the selected organization and all the related child organizations, provided the user has access to all child organizations. In scenarios where the inventory is at the parent organization level and orders are at the child organization level, this feature allows the users to see a consolidated view of the metrics across the parent organization and related child organizations.</p>\r\n\r\n<h4><a name=\"dashboard-refresh\" id=\"dashboard-refresh\"></a>Dashboard Refresh</h4>\r\n\r\n<p>The dashboard provides a &quot;Refresh&quot; button that allows the users to&nbsp;get the latest metric information for the last 24 hours.</p>\r\n\r\n<h4><a name=\"localization-formatting\" id=\"localization-formatting\"></a>Localization & Formatting</h4>\r\n\r\n<p>All the static labels and texts on the UI are localized and will be displayed in the locale of the user.&nbsp;For example, 10Day Lead time bucket will be displayed as below for different locales:</p>\r\n\r\n<ul>\r\n\t<li>10Day Lead Time Bucket/EN &ndash; 10 Days</li>\r\n\t<li>10Day Lead Time Bucket/FR &ndash; 10 jours</li>\r\n</ul>\r\n\r\n<p>The units of the metrics are also localized in the user locale. For example: The total number of PDP requests in different locales:</p>\r\n\r\n<ul>\r\n\t<li>Total PDP Requests/EN &ndash; 1 billion</li>\r\n\t<li>Total PDP Requests/FR &ndash; 1 milliard</li>\r\n</ul>\r\n\r\n<p>Contact the implementation team for any changes to be made in the configuration repo. Configuration repo -&nbsp;&nbsp;<strong>/Localization/com-manh-cp-inventoryfacade/labels/en/localization.properties</strong></p>\r\n\r\n<h4 data-renderer-start-pos=\"8934\"><a name=\"view-comparison-based-on-ml-predicted-dates\" id=\"view-comparison-based-on-ml-predicted-dates\"></a>View Comparison based on ML Predicted Dates</h4>\r\n\r\n<p data-renderer-start-pos=\"8934\">On the metrics dashboard, click the View Comparison check box to refresh all the panels of the dashboard based on the predicted dates.</p>\r\n\r\n<div class=\"info\" data-renderer-start-pos=\"8934\">Note: The View Comparison checkbox will be disabled if the <a href=\"https://omni.helpdocsonline.com/predict-promising-with-machine-learning$step-6-turn-on-prediction-select-prediction-mode-options\">Predictive Promising Config</a> is set to Off</div>\r\n\r\n<p data-renderer-start-pos=\"8934\">The dashboard displays the comparison between before and after values. Comparison values are positive or negative, and are displayed following the below convention:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"9259\">For OnTime and Early &rarr; If the value is positive, then the upward arrow (Green) is displayed, else the downward arrow (Red) is displayed.</li>\r\n\t<li data-renderer-start-pos=\"9386\">For Late &rarr; If the value is positive, then the upward arrow (Red) is displayed, else the downward arrow (Green) is displayed.</li>\r\n</ul>\r\n\r\n<div class=\"tip\">Note: In Compare mode (when Predictive Promising Config is set other than Off) - Orders with both Predicted dates and dates computed as per configuration and populated are used for comparison. If there are orders with no predicted dates (because of business/technical failures), then these orders are not used for comparison.<br />\r\n<br />\r\nExample: Consider there are 100 orders. If ship and delivery dates are computed based on configuration, and the predicted date is populated only for 90 orders, then comparison will happen only for the 90 orders and the remaining 10 orders will be skipped.</div>\r\n\r\n<p>Prediction Promising config can be set up in Live or Passive mode. Passive mode is used when retailers want to evaluate Machine Learning to predict ship and delivery dates but not use it in business processes. In Live mode, retailers would want&nbsp;to go live with the predicted ship date, delivery date and also use them&nbsp;in business processes. In Passive mode, the dashboard primarily shows the performance as per the<strong><strong data-renderer-mark=\"true\"> </strong></strong>dates calculated by the configuration data. In Live mode, the dashboard shows the performance as per the predicted dates. Compare option will show the comparison between both modes.</p>\r\n\r\n<p>Refer to <a hqid=\"2837120\" href=\"/deliverydateperformance$MAML\">View details based on MAML</a> section for more details.</p>\r\n\r\n<h4><a name=\"integration\" id=\"integration\"></a>Integration</h4>\r\n\r\n<p>While loading the Interactive Inventory Metrics Dashboard UI, 3 calls are made from the UI to the facade layer, one each for the PDP, CART and Orders panel. As part of these calls, a set of UI Metrics is passed to the facade layer. A single UI Metric corresponds to a unique&nbsp;chart on the UI and can correspond to 1 or multiple backend metrics that the controller component understands. Facade layer converts the&nbsp;UI metric to the corresponding backend metric(s) and calls the controller component with the backend MetricId, Start time, End time and Query to Prometheus. Refer to the <a href=\"https://omni.helpdocsonline.com/metrics-dashboard$seed-data\">Seed Data </a>for more details on UI Metric and the corresponding back end metric.&nbsp;</p>\r\n\r\n<p>If the response from the controller is empty for any of the UI metrics, an informational message is displayed on that specific chart indicating &ldquo;Metrics Not Available&rdquo;. If there is an error or some form of an exception while loading the dashboard, a pop-up is displayed on the UI indicating there was some error. The user has an option in the pop-up to export the error which can be shared with the implementation team for further analysis. When the user clicks &ldquo;OK&rdquo; button on the pop-up, the corresponding panel(s) for which the call failed will be displaying an error message indicating&nbsp;&ldquo;Error while loading metrics&rdquo;.</p>\r\n\r\n<h3><a name=\"configuration\" id=\"configuration\"></a>Configuration</h3>\r\n\r\n<h4><a name=\"grants\" id=\"grants\"></a>Grants</h4>\r\n\r\n<p>To access the Interactive Inventory Metrics Dashboard, the user should have access to the following grants:</p>\r\n\r\n<ul>\r\n\t<li><strong>inventoryfacade::inventorymetricsdashboard::view</strong>. This will give the user, a menu option to access the dashboard.</li>\r\n\t<li>\r\n\t<p><strong>inventoryfacade::read. </strong>The user should have access to this grant to load and view the dashboard.</p>\r\n\t</li>\r\n</ul>\r\n\r\n<h4><a name=\"seed-data\" id=\"seed-data\"></a><a id=\"Metrics Dashboard - Seed Data\" name=\"Metrics Dashboard - Seed Data\"></a>Seed Data</h4>\r\n\r\n<p>The seed data for all the UI Metrics is available as part of the &quot;MetricInfo&quot; entity. The key attributes of this entity are:</p>\r\n\r\n<ul>\r\n\t<li>UiMetricId &ndash; The UI Metric ID that is used to represent a specific chart on the UI</li>\r\n\t<li>UiMetricType &ndash; The type of chart. Example &ndash; LinearGraph, Donut, etc.</li>\r\n\t<li>MetricDetail &ndash; A list of backend metrics with the MetricId and the query&nbsp;corresponding to the UI metric.</li>\r\n</ul>\r\n\r\n<p>Below is an example of a UI metric. The end point to get the complete list of Metric Info&nbsp;seed data can be found <a hqid=\"2683666\" href=\"/metrics-dashboard$Metrics Dashboard - Services\">here</a>.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 1255px;\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 124px;\"><strong>UI Metric ID</strong></td>\r\n\t\t\t<td style=\"width: 154px;\"><strong>UI Metric Type</strong></td>\r\n\t\t\t<td style=\"width: 115px;\"><strong>Backend Metric ID(s)</strong></td>\r\n\t\t\t<td style=\"width: 528px;\"><strong>Description</strong></td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 124px;\">PDPTotalRequestGraph</td>\r\n\t\t\t<td style=\"width: 154px;\">LinearGraph</td>\r\n\t\t\t<td style=\"width: 115px;\">PDPTotalRequest<br />\r\n\t\t\tPDPTotalRequestGraph</td>\r\n\t\t\t<td style=\"width: 528px;\">The &quot;Total Request&quot; chart on the UI is represented using the&nbsp;UIMetricId PDPTotalRequestGraph. The chart contains 2 parts - A &quot;Total Request&quot; and an &quot;Hourly Graph&quot; for the last 24-hour period. As a result, it is mapped to 2 Metric IDs on the backend</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 124px;\">PDPResponseByAvailability</td>\r\n\t\t\t<td style=\"width: 154px;\">PDPResponseByAvailability</td>\r\n\t\t\t<td style=\"width: 115px;\">PDPResponseByAvailability</td>\r\n\t\t\t<td style=\"width: 528px;\">The &quot;Availability&quot; chart on the UI is represented using the&nbsp;UiMetricId PDPResponseByAvailability. This chart corresponds&nbsp;to only 1 backend metric.</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3><a name=\"services\" id=\"services\"></a><a id=\"Metrics Dashboard - Services\" name=\"Metrics Dashboard - Services\"></a>Services</h3>\r\n\r\n<p>The&nbsp;APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><strong><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service</font></strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Component</strong></th>\r\n\t\t\t<th scope=\"col\"><strong><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service Endpoint</font></strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"background-color: rgb(255, 255, 255);\">Controller API to Prometheus</td>\r\n\t\t\t<td style=\"background-color: rgb(255, 255, 255);\">Controller</td>\r\n\t\t\t<td style=\"background-color: rgb(255, 255, 255);\">/controller/api/controller/promMetrics</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"background-color: rgb(255, 255, 255);\">Custom Metrics</td>\r\n\t\t\t<td style=\"background-color: rgb(255, 255, 255);\">Order, Inventory, Promising</td>\r\n\t\t\t<td style=\"background-color: rgb(255, 255, 255);\">/{{Component}}/internal/core/custommetrics</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"background-color: rgb(255, 255, 255);\">Seed Data for Metric Info</td>\r\n\t\t\t<td style=\"background-color: rgb(255, 255, 255);\">Inventoryfacade</td>\r\n\t\t\t<td style=\"background-color: rgb(255, 255, 255);\">/inventoryfacade/api/inventoryfacade/metricInfo</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3><a name=\"related-articles\" id=\"related-articles\"></a>Related Articles</h3>\r\n\r\n<div class=\"info\"><ul class=\"related-articles\"><li><a href=\"/reservationsfromcache\" hqid=\"2792232\">Reservations from Cache</a></li><li><a href=\"/interactive-inventory-3\" hqid=\"2590179\">Delivery Dates Services</a></li><li><a href=\"/deliverydateperformance\" hqid=\"2837120\">Delivery Date Performance Dashboard</a></li><li><a href=\"/interactive_inventory\" hqid=\"2590162\">Overview</a></li></ul></div>\r\n\r\n<ul>\r\n</ul>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 21040,
  "scraped_at": "2025-08-09T22:33:55.733440"
}