{
  "id": "1809211",
  "permalink": "order-orchestration-configuration",
  "title": "Order Orchestration Configuration",
  "type": "topic",
  "level": 4,
  "path": "Manhattan Active® Omni/Order Management/Process & Configuration Guides/Order Orchestration/Order Orchestration Configuration",
  "raw_item": {
    "id": "1809211",
    "text": "Order Orchestration Configuration",
    "title": "Order Orchestration Configuration",
    "permalink": "order-orchestration-configuration",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "129589",
    "parent": "f;129589",
    "created_date": "1482731476",
    "modified_date": "1753167324",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "2"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158746\" href=\"/order-orchestration-2\" class=\"breadcrumb-links\">Order Orchestration</a></li><li> <span>››</span>Order Orchestration Configuration</li></ul>  \t\r\n\t\t<h2>Order Orchestration Configuration</h2>\r\n\r\n<p></p>\r\n\r\n<a href=\"/creating-and-updating-order\" hqid=\"2700326\">Next</a>\r\n<p>This guide outlines the configurations required for order orchestration.</p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/order-orchestration-configuration$order-configuration\">Order Configuration</a></li><li><a href=\"/order-orchestration-configuration$tax-configuration\">Tax Configuration</a></li><li><a href=\"/order-orchestration-configuration$payment-configuration\">Payment Configuration</a></li><li><a href=\"/order-orchestration-configuration$sales-posting-configuration\">Sales Posting Configuration</a></li><li><a href=\"/order-orchestration-configuration$returns-nbsp-configuration\">Returns&nbsp;Configuration</a></li><li><a href=\"/order-orchestration-configuration$miscellaneous-configuration\">Miscellaneous Configuration</a></li><li><a href=\"/order-orchestration-configuration$order-monitoring-configuration\">Order Monitoring Configuration</a><ul><li><a href=\"/order-orchestration-configuration$expected-time-rule\">Expected Time Rule</a></li><li><a href=\"/order-orchestration-configuration$monitoring-time-rule\">Monitoring Time Rule</a></li></ul></li><li><a href=\"/order-orchestration-configuration$selling-channel-configuration\">Selling Channel Configuration</a></li><li><a href=\"/order-orchestration-configuration$reason-nbsp-configuration\">Reason&nbsp;Configuration</a></li><li><a href=\"/order-orchestration-configuration$line-type-configuration\">Line Type Configuration</a></li><li><a href=\"/order-orchestration-configuration$note-type-note-category-configuration\">Note Type & Note Category Configuration</a></li><li><a href=\"/order-orchestration-configuration$configuration-for-non-discountable-items\">Configuration for Non-Discountable Items</a></li><li><a href=\"/order-orchestration-configuration$email-message\">Email Message</a></li><li><a href=\"/order-orchestration-configuration$uis-and-entities\">UIs and Entities</a></li><li><a href=\"/order-orchestration-configuration$troubleshooting\">Troubleshooting</a><ul><li><a href=\"/order-orchestration-configuration$save-button-is-disabled-on-the-order-configuration-ui\">Save button is disabled on the Order Configuration UI</a></li></ul></li><li><a href=\"/order-orchestration-configuration$related-articles\">Related Articles</a></li></ul></div>\r\n\r\n<h4><a name=\"order-configuration\" id=\"order-configuration\"></a>Order Configuration</h4>\r\n\r\n<p>The order configuration UI allows retailers to configure key order selling and orchestration configurations like,</p>\r\n\r\n<ul type=\"disc\">\r\n\t<li>Enable/disable payment, tax, price and promotion, and charges.</li>\r\n\t<li>Return and exchange configurations.</li>\r\n\t<li>Modification rules related to order, order line, return line, and quantity modification types.&nbsp;</li>\r\n\t<li>Order monitoring configurations using milestones.&nbsp;</li>\r\n</ul>\r\n\r\n<p>The Order Configuration UI has been enhanced to&nbsp;include&nbsp;a range of features to optimize the customer experience. The Modification Rules tab provides a search bar to search for a modification type. The header row and modification type column are frozen, which&nbsp;enables you to scroll through the various services available while continuing to view the frozen row and column to&nbsp;configure modification rules for each modification type. Display only relevant email and text message templates in the publish email/text drop-down menus for each Mod type in Modification Rules UI to simplify&nbsp;the selection process. Improved performance and static cancel and save buttons are provided across all sections of the Order configuration UI.</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong>&nbsp;Retailers must update the email and text seed data files for new custom email/text templates to add the associated ModTypId for each template. An additional field called ModTypId has been introduced to the seed data files, allowing for the inclusion of the respective ModTypId.</div>\r\n\r\n<p><strong>How to Access Order Configuration UI</strong></p>\r\n\r\n<ul>\r\n\t<li>Navigate to Menu &gt; Application Configuration &gt; Manage Order Configuration &gt; Order configuration</li>\r\n\t<li>The Order Configuration UI&nbsp;can also be accessed from the&nbsp;omnifacade screen by clicking Order Configuration</li>\r\n</ul>\r\n\r\n<p><strong>Configuration</strong></p>\r\n\r\n<p>To enable the enhanced order config. UI:</p>\r\n\r\n<ul type=\"disc\">\r\n\t<li>Navigate to&nbsp;<strong>Menu</strong>&nbsp;&gt;&nbsp;<strong>Proactive</strong>&nbsp;&gt;&nbsp;<strong>Proactive Menu</strong>&nbsp;&gt;&nbsp;<strong>Review Behavior Changes&nbsp;</strong>&gt;&nbsp;<strong>Order Config UI Improvements</strong>.&nbsp;</li>\r\n</ul>\r\n\r\n<div class=\"tip\">\r\n<p><strong>Note:</strong>&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>The old order configuration UI can be accessed by disabling the behavioral change configuration or by using the URL below:&nbsp;&nbsp;</li>\r\n</ul>\r\n\r\n<p><strong>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;{{url}}/omnifacade/#/orderConfig?redirectToOldOrderConfig=true</strong></p>\r\n\r\n<ul>\r\n\t<li>If the order configuration page is unable to load&nbsp;and is giving a 403 error, clear the Zuul cache by using the below API.</li>\r\n</ul>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; API : DELETE&nbsp;&nbsp;{{url}}/zuulserver/api/admin/cache/resources</p>\r\n</div>\r\n\r\n<h4><a name=\"tax-configuration\" id=\"tax-configuration\"></a>Tax Configuration</h4>\r\n\r\n<p>The settings in the tax configuration section are required only if the Tax check box has been enabled. The following configurations are required for tax:</p>\r\n\r\n<ul>\r\n\t<li><strong>Invoice Tax Mode</strong>:<strong>&nbsp;</strong>When a shipment or adjustment invoice is created, this setting controls if and how tax is recalculated for the invoiced&nbsp;items. See the <a href=\"https://omni.helpdocsonline.com/order-pricing-tax\">Tax Configuration</a>&nbsp;guide for details about each configuration option.</li>\r\n\t<li><strong>Tax Comparison Strategy</strong>: When quotation tax details have&nbsp;to be compared with invoice tax details to arrive at tax computations for various&nbsp;invoice tax modes, this setting controls the strategy to be considered&nbsp;by the application. See the <a href=\"https://omni.helpdocsonline.com/order-pricing-tax\">Tax Configuration</a>&nbsp;guide for details about each configuration option.</li>\r\n\t<li><strong>Return Tax Mode</strong>:&nbsp;When a return invoice is created, this setting controls if and how tax is recalculated for the invoiced items. See the <a href=\"https://omni.helpdocsonline.com/order-pricing-tax\">Tax Configuration</a>&nbsp;guide for details about each configuration option.</li>\r\n\t<li><strong>Tax Gateway</strong>:<strong>&nbsp;</strong>This attribute selects the third-party tax gateway that is used for tax calculation. Vertex is the default provider. If a different third-party tax gateway is required, then the gateway can be added and integration can be completed via user exit.</li>\r\n</ul>\r\n\r\n<div class=\"info\" style=\"text-align: justify;\"><strong>Note</strong>: The Tax comparison strategy configuration 'Tax Code' can be enabled only for the new orders created in the application after enabling the Tax Comparison Strategy feature. Orders created prior to enabling the Tax Comparison Strategy feature will by default be considered to be configured for Tax Comparison Strategy 'Jurisdiction' and cannot be modified or updated even though the tax configurations applicable to the order are changed or modified.</div>\r\n\r\n<div class=\"warning\" style=\"text-align: justify;\">The System stamps the settings configured for the above-mentioned Tax Configurations on the order header at the time of order creation. This&nbsp;will refer to the settings stamped on the order header for all future processes for the entire lifetime of the order, which cannot be modified or removed from the order. Any modifications or updates to these configurations after the order is created will not be reflected in the order header. The only time these configurations on the order header will be reevaluated is when the order type of the order is modified or changed.&nbsp;</div>\r\n\r\n<h4><a name=\"payment-configuration\" id=\"payment-configuration\"></a>Payment Configuration</h4>\r\n\r\n<p>The settings in&nbsp;the payment configuration section are required only if the Payment check box has been enabled. The following configurations are available to control payment and invoicing:</p>\r\n\r\n<ul>\r\n\t<li><strong>Process Payment Immediately on Complete Shipment</strong>:<strong>&nbsp;</strong>This setting controls whether settlement occurs immediately upon shipment of completely shipped orders. See <a href=\"https://omni.helpdocsonline.com/how-payment-processing-works\">How Payment Processing&nbsp;Works</a> for details.</li>\r\n\t<li><strong>Process Payment On Release:&nbsp;</strong>This configuration indicates that units can only be released if there&nbsp;is a valid authorization or settlement amount to cover the releasable unit total. If the order is pre-authorized or pre-settled at the time of capture, the system performs a check on the order payment details to confirm that the authorized or settled amount is greater than or equal to the releasable amount, as well as restrict re-authorization of any amount greater than releasable amount. If the order is not pre-authorized or pre-settled, the system attempts to authorize or settle the releasable unit total at the time release is attempted, and restricts the release if the payment is not successful. See <a href=\"https://omni.helpdocsonline.com/authorization$authorization-on-release-for-pre-orders\">Authorization</a><a href=\"http://omni.helpdocsonline.com/authorization$release-based-authorization\">&nbsp;Based Release</a><a href=\"https://omni.helpdocsonline.com/authorization$authorization-on-release-for-pre-orders\">&nbsp;</a>for details.\r\n\t<ul>\r\n\t\t<li>For example, the customer places an order with two order lines having one quantity each, and no authorization is done on order capture. Now, if the first order line is ready for release, authorization is attempted only for the amount on the first order line. If the authorization succeeds, the order line is released. When the second order line is ready for release, authorization is attempted only for the second order line. If the authorization succeeds, the order line is released.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li><strong>Create Invoice On</strong>: For each delivery method, define the status in which units should be invoiced. For example, if \"Fulfilled\" status is selected for the delivery method \"Ship to Address\", then invoices are created for each unit (quantity detail) that reaches a status equal to or greater than \"Fulfilled\" status.&nbsp;\r\n\t<ul>\r\n\t\t<li>For each delivery method, indicate whether the order ReadyForTender flag must be set to true before invoicing can occur. This flag should be set to true for all in-store delivery methods, including \"Store Sale\" and \"Store Return.\" This flag should be set to false for all other delivery methods. See <a href=\"https://omni.helpdocsonline.com/invoicing-sales-posting$how-invoicing-works\">How Invoicing Works</a>&nbsp;for details.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<h4><a name=\"sales-posting-configuration\" id=\"sales-posting-configuration\"></a>Sales Posting Configuration</h4>\r\n\r\n<p>The settings in&nbsp;the sales posting configuration section are required only if the Payment check box has been enabled. The following configurations are required for sales postings:</p>\r\n\r\n<ul>\r\n\t<li>Publish sales posting immediately on shipment</li>\r\n\t<li>Publish all&nbsp;invoices as part of sales posting</li>\r\n\t<li>\r\n\t<p>Sales Posting Format</p>\r\n\t</li>\r\n</ul>\r\n\r\n<p>Refer to <a href=\"https://omni.helpdocsonline.com/invoicing-sales-posting$sales-posting\">Sales Posting </a>for additional&nbsp;details.</p>\r\n\r\n<h4><a name=\"returns-nbsp-configuration\" id=\"returns-nbsp-configuration\"></a>Returns&nbsp;Configuration</h4>\r\n\r\n<p>The&nbsp;settings in&nbsp;the returns section control processing for return order lines.&nbsp;The following configurations are required:</p>\r\n\r\n<ul>\r\n\t<li>Re-price&nbsp;even exchange lines</li>\r\n\t<li>Auto approve if receipt is not expected</li>\r\n\t<li>Minimum and Maximum allowed status for calculating Returnable Qty</li>\r\n</ul>\r\n\r\n<p>Refer to the&nbsp;<a href=\"https://omni.helpdocsonline.com/returns-overview\">Return & Exchange</a> guides for details.</p>\r\n\r\n<h4><a name=\"miscellaneous-configuration\" id=\"miscellaneous-configuration\"></a><a id=\"overage\" name=\"overage\"></a>Miscellaneous Configuration</h4>\r\n\r\n<p>The Miscellaneous section contains a setting that enables OMS&nbsp; to honor \"overages\" from the Fulfillment System.&nbsp; When the flag \"<strong>Overage Allowed</strong>\" is checked, then&nbsp;Over Pick, Pack, and Ship are allowed. By default, this flag is unchecked.&nbsp;When \"Overage Allowed\" is enabled, then the payment section gets automatically disabled. This is to ensure over-ship doesn’t affect the Invoice flow.</p>\r\n\r\n<p>The Shorten Self-Service URL info&nbsp;configuration can be used to enable the application to call a third party URL shortening service for shortening DSS URLs so that they can be included in respective text messages. By default, this configuration is switched off. If this configuration is enabled, make sure the required configurations for the third-party URL shortening service are properly set up in the application, else any failures may result in the associated processes in the system to fail. Refer to&nbsp;<a href=\"https://omni.helpdocsonline.com/transactional-texts$third-party-url-shortening-service-provider-account-configuration\">Transactional Texts - Third Party Url Shortening Service Provider Account Configuration</a>&nbsp;for details.</p>\r\n\r\n<h4><a name=\"order-monitoring-configuration\" id=\"order-monitoring-configuration\"></a><a id=\"Order_Monitoring_Config\" name=\"Order_Monitoring_Config\"></a>Order Monitoring Configuration</h4>\r\n\r\n<p>Order monitoring rules are defined using milestones. For each milestone, the configuration&nbsp;can be broken into two parts: an expected time in which a milestone should be achieved, and the action which should be taken if that milestone is not reached within the expected time. The expected time rule and monitoring rules are configured on the Monitoring tab of the Order Configuration UI.</p>\r\n\r\n<h6><a name=\"expected-time-rule\" id=\"expected-time-rule\"></a>Expected Time Rule</h6>\r\n\r\n<p>Expected time rules are defined as a length of time with respect to another milestone being achieved. Only one expected time rule can be configured per milestone. For each expected time rule, configure the milestone, the duration, and the dependent milestone. For example,&nbsp;a retailer expects orders to be allocated two hours after order confirmation or an event&nbsp;should be raised. This retailer defines an expected time rule with milestone = Allocated, duration = 7200 seconds (2 hours), and dependent milestone = Confirmed. This means that the Allocation milestone is expected 7200 seconds after the Confirmed milestone is achieved, or an event&nbsp;should be raised.</p>\r\n\r\n<h6><a name=\"monitoring-time-rule\" id=\"monitoring-time-rule\"></a>Monitoring Time Rule</h6>\r\n\r\n<p>Monitoring rules define the action that should be taken if a milestone is not reached within the expected time. Multiple monitoring rules can be configured for each milestone. Each monitoring rule defines the duration of time in which the rule is executed, and the event which should be fired if the milestone is not met within the expected time. The event name must be registered to the Extensibility Framework in the Extension Point entity.&nbsp;</p>\r\n\r\n<p>For example, a retailer expects an order to be shipped two days after order confirmation or an event should be raised.&nbsp;This retailer defines an expected time rule with milestone = Fulfilled, duration = 604800&nbsp;seconds (1 week), and dependent milestone = Confirmed. This means that the Fulfilled milestone is expected 604800 seconds after the Confirmed milestone is achieved, or an event&nbsp;should be raised. The retailer wants to raise an event if this milestone has not been reached one week after confirmation, so a monitoring rule is configured with milestone = Fulfilled, duration = 0, and event name =&nbsp;Order::Milestone::Shipped::After1Week. This event name can be used to configure an extension handler so that the project can call a custom service to send an email or create a case.</p>\r\n\r\n<p>For example, a retailer expects an order to be released 30 minutes after order confirmation or an event should be raised.&nbsp;This retailer defines an expected time rule with milestone = Released, duration = 1800 seconds (30 minutes), and dependent milestone = Confirmed. This means that the Released milestone is expected 1800 seconds after the Confirmed milestone is achieved, or an event&nbsp;should be raised. The retailer wants to raise an event if this milestone has not been reached 30 minutes after confirmation, so a monitoring rule is configured with milestone = Released, duration = 0, and event name =&nbsp;Order:Order:Event:OnReadyForRelease. This event name can be used to configure an extension handler so that the project can call a custom service to send an email or create a case.</p>\r\n\r\n<p class=\"info\">Order Publish messages triggered from an Event configured through Monitoring Rule does not honor custom publish order templates. As a workaround&nbsp;configure \"Order:Order:Event:OnPublishOrder\" extension handler to&nbsp;enhance the order json with the required publish order template information.&nbsp;</p>\r\n\r\n<div class=\"tip\">\r\n<p>Restrict by Date should be enabled to trigger the Order Milestone. Also, default monitoring scheduler runs every&nbsp;minute.</p>\r\n</div>\r\n\r\n<h4><a name=\"selling-channel-configuration\" id=\"selling-channel-configuration\"></a><a id=\"selling_channel\" name=\"selling_channel\"></a>Selling Channel Configuration</h4>\r\n\r\n<p>Selling channel specifies the channel where the order was captured, such as store, call center, or web. When an order is imported, the order selling channel is validated against the configured values.&nbsp;Selling channel can be used to configure order processing rules or to report on order data. Selling channels are configured in the <a hqid=\"1835286\" href=\"/order-orchestration$selling_channels\">Selling Channels UI.</a></p>\r\n\r\n<h4><a name=\"reason-nbsp-configuration\" id=\"reason-nbsp-configuration\"></a><a id=\"reason_config\" name=\"reason_config\"></a>Reason&nbsp;Configuration</h4>\r\n\r\n<p>The following types of reason codes need to be configured for&nbsp;order processing. For each reason type, the configured reason codes are displayed in the UI drop-down list when users select a reason code for the given type. Reason codes can be configured in the Order Reason UI. Reasons can also be <a hqid=\"2786252\" href=\"/order-modifications$channel-specific-reason-codes\">channel-specific.</a>&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>Cancel reason</li>\r\n\t<li>Price override reason</li>\r\n\t<li>Post void reason</li>\r\n\t<li>Tax exempt</li>\r\n\t<li>AVS reason</li>\r\n\t<li>Charge override reason</li>\r\n\t<li>Appeasement reason</li>\r\n\t<li>Return Aging Override reason</li>\r\n</ul>\r\n\r\n<p>To sort the order of the reason codes in the UI drop-downs, the system uses the \"SequenceNumber\" attribute value. The sorting logic is as follows:&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>Null values will always have higher priority. If you want to sort an entity, make sure to provide a sequence number for all values.</li>\r\n\t<li>Reason codes will be sorted by ascending sequence number.</li>\r\n\t<li>If 2 reason codes have the same sequence number, then the created DTTM acts as the tiebreaker.</li>\r\n</ol>\r\n\r\n<p>The&nbsp;SequenceNumber field is not available in the configuration UI yet. If you need to populate it, it needs to be done by direct API call:&nbsp;<em><strong>{{url}}/order/api/order/reason/save</strong></em></p>\r\n\r\n<p class=\"info\"><strong>Note</strong>: The \"Initiated by\" field&nbsp;is used for cancel and short reason codes. It will not be honored for other reason types. It can have values of \"Customer\", \"System\", or \"Not applicable\" (value for all other reason codes other than cancel and short reason codes).&nbsp;<br>\r\nFor cancel and short reason codes, this field will be used to trigger different mod types in the order configuration (Cancel line - customer, Cancel line - System, Decrease quantity - Customer, decrease quantity - System).&nbsp;</p>\r\n\r\n<h4><a name=\"line-type-configuration\" id=\"line-type-configuration\"></a><a id=\"line_type\" name=\"line_type\"></a>Line Type Configuration</h4>\r\n\r\n<p>Line type is a way to categorize types of order lines within an order. No default logic exists for line type, but this attribute can be used for configuration or for reporting purposes. Line types are configured in the <a hqid=\"1835286\" href=\"/order-orchestration$Line_types\">Line Types UI</a>.</p>\r\n\r\n<h4><a name=\"note-type-note-category-configuration\" id=\"note-type-note-category-configuration\"></a><a id=\"note_type\" name=\"note_type\"></a>Note Type & Note Category Configuration</h4>\r\n\r\n<p>Note types are used to categorize order notes. Each note type can be in one of two categories: Instruction or Customer Communication. Instructions should be used for any notes that capture fulfillment or delivery instructions. Notes of category 'Instruction' are passed on the release outbound sent to fulfillment systems, but cannot be updated after quantities have been released for fulfillment.</p>\r\n\r\n<p>Customer Communication notes should be used&nbsp;for other types of notes that are informational for CSRs or users who are viewing order history. Note types are configured in the <a hqid=\"1835286\" href=\"/order-orchestration$Note_types\">Note Types UI</a>. Notes in the category 'Communication' can be updated after quantities have been released to fulfillment systems.</p>\r\n\r\n<h4><a name=\"configuration-for-non-discountable-items\" id=\"configuration-for-non-discountable-items\"></a>Configuration for Non-Discountable Items</h4>\r\n\r\n<p>To enable the&nbsp;feature&nbsp;that prorates&nbsp;header manual discounts&nbsp;only to discountable items:</p>\r\n\r\n<ol>\r\n\t<li>Navigate to the Charge Type Override UI</li>\r\n\t<li>Add an entry to this table for the charge type 'Discount'</li>\r\n\t<li>Enable the&nbsp;'Skip Non-Discountable Items' check box</li>\r\n</ol>\r\n\r\n<p>Note: This configuration can be enabled&nbsp;only for charge type 'Discount', 'Appeasement, 'Promotion', and 'Coupons'. Ensure that the isDiscountable field is mapped to the order line, whether directly imported on orders or copied from the item master.</p>\r\n\r\n<h4><a name=\"email-message\" id=\"email-message\"></a><a id=\"Email_Messages\" name=\"Email_Messages\"></a>Email Message</h4>\r\n\r\n<p>Email Messages provides you with the ability to publish Email Messages via the application, which are used by&nbsp;a third-party email marketing system to consume and send emails to the customers&nbsp;notifying them of an event affecting their order, for example, Shipment Confirmation.</p>\r\n\r\n<p>The following Email Messages are available out of the box.</p>\r\n\r\n<ul>\r\n\t<li>ShipConfirmation – published when the Ship To Address delivery method order line is shipped.</li>\r\n\t<li>ReturnConfirmationNonReceipt – published when Return Order with Return Lines of Ship To Return Center delivery method is confirmed with Receipt Expected set to False.</li>\r\n\t<li>ReturnConfirmationReceipt – published when Return Order with Return Lines of Ship To Return Center delivery method is confirmed with Receipt Expected set to True.</li>\r\n</ul>\r\n\r\n<p>Email Messages provided out of the box cannot be deleted or modified.</p>\r\n\r\n<p>New Email Messages can be created after creating a Serviceable DTO&nbsp;having the attributes required for the Email Template and implementing a service that can be invoked to generate the Email Message outbound.</p>\r\n\r\n<p>To include the Order DTO in the above-mentioned EMail Messages - configure&nbsp;includeOrderAttributes on the respective Email Message to True. By default, this configuration will be set to False. For each Email Message Type (ShipConfirmation and ReturnConfirmation) mentioned above, one specific base template is available for including the Order DTO. This can be customized and limited to only additional attributes required.&nbsp;</p>\r\n\r\n<p class=\"warning\">The base Order Template includes the entire Order, Order Lines, Extended, and child entities. It is strongly recommended that the base order template is&nbsp;customized to include only additional attributes not included in the base Email Message Template and keep it as light as possible. Base does not evaluate any duplicate attributes included in the Order Template and the Email Message will end up having duplicate attributes.&nbsp;</p>\r\n\r\n<h4><a name=\"uis-and-entities\" id=\"uis-and-entities\"></a>UIs and Entities</h4>\r\n\r\n<p>The configuration UIs mentioned in this document are listed in the following&nbsp;table below, along with information to&nbsp;navigate&nbsp;to the API documentation.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:650px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\" style=\"width: 168px;\">UI Name</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 30px;\">Component</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 185px;\">Group</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 111px;\">Seed Data Present?</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 100px;\">Seed Data Profile</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 154px;\">Hold Resolve Reasons&nbsp;&nbsp; &nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 16px;\">Order&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 170px;\">&nbsp;HoldResolveReason services</td>\r\n\t\t\t<td style=\"width: 97px;\">Yes&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 86px;\">Base</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 154px;\">Hold Types</td>\r\n\t\t\t<td style=\"width: 16px;\">Order&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 170px;\">HoldType services</td>\r\n\t\t\t<td style=\"width: 97px;\">Yes&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 86px;\">Base</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 154px;\">Line Types</td>\r\n\t\t\t<td style=\"width: 16px;\">Order&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 170px;\">LineType services&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 97px;\">No&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 86px;\">Base</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 154px;\">Note Types&nbsp; &nbsp;&nbsp;</td>\r\n\t\t\t<td style=\"width: 16px;\">Order&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 170px;\">NoteType services</td>\r\n\t\t\t<td style=\"width: 97px;\">Yes</td>\r\n\t\t\t<td style=\"width: 86px;\">Base</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" rowspan=\"3\" style=\"width: 154px;\">Order Configurations</td>\r\n\t\t\t<td colspan=\"1\" rowspan=\"3\" style=\"width: 16px;\">Order&nbsp;&nbsp; &nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 170px;\">OrderConfig services&nbsp;</td>\r\n\t\t\t<td style=\"width: 97px;\">Yes&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 86px;\">Base</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 170px;\">OrderExpectedTimeRule services&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 97px;\">Yes&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 86px;\">Base</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 170px;\">OrderMonitoringRule services&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 97px;\">Yes&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 86px;\">Base</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 154px;\">Order Reason&nbsp;&nbsp; &nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 16px;\">Order&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 170px;\">&nbsp;Reason services</td>\r\n\t\t\t<td style=\"width: 97px;\">Yes&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 86px;\">Base</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 154px;\">Order Types&nbsp;&nbsp; &nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 16px;\">Order&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 170px;\">OrderType services&nbsp;</td>\r\n\t\t\t<td style=\"width: 97px;\">Yes&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 86px;\">Base</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 154px;\">Selling Channels&nbsp;&nbsp; &nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 16px;\">Order&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 170px;\">SellingChannel services&nbsp;</td>\r\n\t\t\t<td style=\"width: 97px;\">Yes&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 86px;\">Base</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 154px;\">Email Message&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 16px;\">Order&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 170px;\">EmailMessage services</td>\r\n\t\t\t<td style=\"width: 97px;\">Yes&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td style=\"width: 86px;\">Base</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h4><a name=\"troubleshooting\" id=\"troubleshooting\"></a>Troubleshooting</h4>\r\n\r\n<h5><a name=\"save-button-is-disabled-on-the-order-configuration-ui\" id=\"save-button-is-disabled-on-the-order-configuration-ui\"></a>Save button is disabled on the Order Configuration UI</h5>\r\n\r\n<p>The save button will be enabled only if \"DaysToArchive\" is less than or equals to 365.</p>\r\n\r\n<h4><a name=\"related-articles\" id=\"related-articles\"></a>Related Articles</h4>\r\n\r\n<div class=\"info\"><ul class=\"related-articles\"><li><a href=\"/order-archiving\" hqid=\"2993718\">Order Archiving</a></li><li><a href=\"/order_tagging\" hqid=\"2656391\">Order Tagging</a></li><li><a href=\"/deliverytracking\" hqid=\"2837045\">Delivery Tracking</a></li><li><a href=\"/shipping-restriction\" hqid=\"2918532\">Shipping Restriction</a></li><li><a href=\"/cart-and-preview-mode\" hqid=\"2746028\">Cart and Preview Mode</a></li><li><a href=\"/how-publish-order-works\" hqid=\"3041650\">Publishing Order </a></li><li><a href=\"/order-audit\" hqid=\"2700329\">Order Audit </a></li><li><a href=\"/order-cancellation\" hqid=\"2601857\">Order Cancellation</a></li><li><a href=\"/creating-and-updating-order\" hqid=\"2700326\">Creating and Updating Order</a></li><li><a href=\"/mod-types\" hqid=\"2729796\">Mod Types</a></li><li><a href=\"/order-orchestration-process\" hqid=\"1809208\">Order Orchestration Process</a></li><li><a href=\"/order-hold-and-unhold\" hqid=\"2601859\">Holds</a></li></ul></div>\r\n\r\n<p>&nbsp;</p>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 30999,
  "scraped_at": "2025-08-09T21:56:21.968645",
  "content_clean": "Home ››Manhattan Active® Omni››Order Management››Process & Configuration Guides››Order Orchestration ››Order Orchestration Configuration Order Orchestration Configuration Next This guide outlines the configurations required for order orchestration. Order ConfigurationTax ConfigurationPayment ConfigurationSales Posting ConfigurationReturns ConfigurationMiscellaneous ConfigurationOrder Monitoring ConfigurationExpected Time RuleMonitoring Time RuleSelling Channel ConfigurationReason ConfigurationLine Type ConfigurationNote Type & Note Category ConfigurationConfiguration for Non-Discountable ItemsEmail MessageUIs and EntitiesTroubleshootingSave button is disabled on the Order Configuration UIRelated Articles Order Configuration The order configuration UI allows retailers to configure key order selling and orchestration configurations like, Enable/disable payment, tax, price and promotion, and charges. Return and exchange configurations. Modification rules related to order, order line, return line, and quantity modification types. Order monitoring configurations using milestones. The Order Configuration UI has been enhanced to include a range of features to optimize the customer experience. The Modification Rules tab provides a search bar to search for a modification type. The header row and modification type column are frozen, which enables you to scroll through the various services available while continuing to view the frozen row and column to configure modification rules for each modification type. Display only relevant email and text message templates in the publish email/text drop-down menus for each Mod type in Modification Rules UI to simplify the selection process. Improved performance and static cancel and save buttons are provided across all sections of the Order configuration UI. Note: Retailers must update the email and text seed data files for new custom email/text templates to add the associated ModTypId for each template. An additional field called ModTypId has been introduced to the seed data files, allowing for the inclusion of the respective ModTypId. How to Access Order Configuration UI Navigate to Menu > Application Configuration > Manage Order Configuration > Order configuration The Order Configuration UI can also be accessed from the omnifacade screen by clicking Order Configuration Configuration To enable the enhanced order config. UI: Navigate to Menu > Proactive > Proactive Menu > Review Behavior Changes > Order Config UI Improvements. Note: The old order configuration UI can be accessed by disabling the behavioral change configuration or by using the URL below: {{url}}/omnifacade/#/orderConfig?redirectToOldOrderConfig=true If the order configuration page is unable to load and is giving a 403 error, clear the Zuul cache by using the below API. API : DELETE  {{url}}/zuulserver/api/admin/cache/resources Tax Configuration The settings in the tax configuration section are required only if the Tax check box has been enabled. The following configurations are required for tax: Invoice Tax Mode: When a shipment or adjustment invoice is created, this setting controls if and how tax is recalculated for the invoiced items. See the Tax Configuration guide for details about each configuration option. Tax Comparison Strategy: When quotation tax details have to be compared with invoice tax details to arrive at tax computations for various invoice tax modes, this setting controls the strategy to be considered by the application. See the Tax Configuration guide for details about each configuration option. Return Tax Mode: When a return invoice is created, this setting controls if and how tax is recalculated for the invoiced items. See the Tax Configuration guide for details about each configuration option. Tax Gateway: This attribute selects the third-party tax gateway that is used for tax calculation. Vertex is the default provider. If a different third-party tax gateway is required, then the gateway can be added and integration can be completed via user exit. Note: The Tax comparison strategy configuration 'Tax Code' can be enabled only for the new orders created in the application after enabling the Tax Comparison Strategy feature. Orders created prior to enabling the Tax Comparison Strategy feature will by default be considered to be configured for Tax Comparison Strategy 'Jurisdiction' and cannot be modified or updated even though the tax configurations applicable to the order are changed or modified. The System stamps the settings configured for the above-mentioned Tax Configurations on the order header at the time of order creation. This will refer to the settings stamped on the order header for all future processes for the entire lifetime of the order, which cannot be modified or removed from the order. Any modifications or updates to these configurations after the order is created will not be reflected in the order header. The only time these configurations on the order header will be reevaluated is when the order type of the order is modified or changed. Payment Configuration The settings in the payment configuration section are required only if the Payment check box has been enabled. The following configurations are available to control payment and invoicing: Process Payment Immediately on Complete Shipment: This setting controls whether settlement occurs immediately upon shipment of completely shipped orders. See How Payment Processing Works for details. Process Payment On Release: This configuration indicates that units can only be released if there is a valid authorization or settlement amount to cover the releasable unit total. If the order is pre-authorized or pre-settled at the time of capture, the system performs a check on the order payment details to confirm that the authorized or settled amount is greater than or equal to the releasable amount, as well as restrict re-authorization of any amount greater than releasable amount. If the order is not pre-authorized or pre-settled, the system attempts to authorize or settle the releasable unit total at the time release is attempted, and restricts the release if the payment is not successful. See Authorization Based Release for details. For example, the customer places an order with two order lines having one quantity each, and no authorization is done on order capture. Now, if the first order line is ready for release, authorization is attempted only for the amount on the first order line. If the authorization succeeds, the order line is released. When the second order line is ready for release, authorization is attempted only for the second order line. If the authorization succeeds, the order line is released. Create Invoice On: For each delivery method, define the status in which units should be invoiced. For example, if \"Fulfilled\" status is selected for the delivery method \"Ship to Address\", then invoices are created for each unit (quantity detail) that reaches a status equal to or greater than \"Fulfilled\" status. For each delivery method, indicate whether the order ReadyForTender flag must be set to true before invoicing can occur. This flag should be set to true for all in-store delivery methods, including \"Store Sale\" and \"Store Return.\" This flag should be set to false for all other delivery methods. See How Invoicing Works for details. Sales Posting Configuration The settings in the sales posting configuration section are required only if the Payment check box has been enabled. The following configurations are required for sales postings: Publish sales posting immediately on shipment Publish all invoices as part of sales posting Sales Posting Format Refer to Sales Posting for additional details. Returns Configuration The settings in the returns section control processing for return order lines. The following configurations are required: Re-price even exchange lines Auto approve if receipt is not expected Minimum and Maximum allowed status for calculating Returnable Qty Refer to the Return & Exchange guides for details. Miscellaneous Configuration The Miscellaneous section contains a setting that enables OMS  to honor \"overages\" from the Fulfillment System.  When the flag \"Overage Allowed\" is checked, then Over Pick, Pack, and Ship are allowed. By default, this flag is unchecked. When \"Overage Allowed\" is enabled, then the payment section gets automatically disabled. This is to ensure over-ship doesn’t affect the Invoice flow. The Shorten Self-Service URL info configuration can be used to enable the application to call a third party URL shortening service for shortening DSS URLs so that they can be included in respective text messages. By default, this configuration is switched off. If this configuration is enabled, make sure the required configurations for the third-party URL shortening service are properly set up in the application, else any failures may result in the associated processes in the system to fail. Refer to Transactional Texts - Third Party Url Shortening Service Provider Account Configuration for details. Order Monitoring Configuration Order monitoring rules are defined using milestones. For each milestone, the configuration can be broken into two parts: an expected time in which a milestone should be achieved, and the action which should be taken if that milestone is not reached within the expected time. The expected time rule and monitoring rules are configured on the Monitoring tab of the Order Configuration UI. Expected Time Rule Expected time rules are defined as a length of time with respect to another milestone being achieved. Only one expected time rule can be configured per milestone. For each expected time rule, configure the milestone, the duration, and the dependent milestone. For example, a retailer expects orders to be allocated two hours after order confirmation or an event should be raised. This retailer defines an expected time rule with milestone = Allocated, duration = 7200 seconds (2 hours), and dependent milestone = Confirmed. This means that the Allocation milestone is expected 7200 seconds after the Confirmed milestone is achieved, or an event should be raised. Monitoring Time Rule Monitoring rules define the action that should be taken if a milestone is not reached within the expected time. Multiple monitoring rules can be configured for each milestone. Each monitoring rule defines the duration of time in which the rule is executed, and the event which should be fired if the milestone is not met within the expected time. The event name must be registered to the Extensibility Framework in the Extension Point entity. For example, a retailer expects an order to be shipped two days after order confirmation or an event should be raised. This retailer defines an expected time rule with milestone = Fulfilled, duration = 604800 seconds (1 week), and dependent milestone = Confirmed. This means that the Fulfilled milestone is expected 604800 seconds after the Confirmed milestone is achieved, or an event should be raised. The retailer wants to raise an event if this milestone has not been reached one week after confirmation, so a monitoring rule is configured with milestone = Fulfilled, duration = 0, and event name = Order::Milestone::Shipped::After1Week. This event name can be used to configure an extension handler so that the project can call a custom service to send an email or create a case. For example, a retailer expects an order to be released 30 minutes after order confirmation or an event should be raised. This retailer defines an expected time rule with milestone = Released, duration = 1800 seconds (30 minutes), and dependent milestone = Confirmed. This means that the Released milestone is expected 1800 seconds after the Confirmed milestone is achieved, or an event should be raised. The retailer wants to raise an event if this milestone has not been reached 30 minutes after confirmation, so a monitoring rule is configured with milestone = Released, duration = 0, and event name = Order:Order:Event:OnReadyForRelease. This event name can be used to configure an extension handler so that the project can call a custom service to send an email or create a case. Order Publish messages triggered from an Event configured through Monitoring Rule does not honor custom publish order templates. As a workaround configure \"Order:Order:Event:OnPublishOrder\" extension handler to enhance the order json with the required publish order template information. Restrict by Date should be enabled to trigger the Order Milestone. Also, default monitoring scheduler runs every minute. Selling Channel Configuration Selling channel specifies the channel where the order was captured, such as store, call center, or web. When an order is imported, the order selling channel is validated against the configured values. Selling channel can be used to configure order processing rules or to report on order data. Selling channels are configured in the Selling Channels UI. Reason Configuration The following types of reason codes need to be configured for order processing. For each reason type, the configured reason codes are displayed in the UI drop-down list when users select a reason code for the given type. Reason codes can be configured in the Order Reason UI. Reasons can also be channel-specific. Cancel reason Price override reason Post void reason Tax exempt AVS reason Charge override reason Appeasement reason Return Aging Override reason To sort the order of the reason codes in the UI drop-downs, the system uses the \"SequenceNumber\" attribute value. The sorting logic is as follows: Null values will always have higher priority. If you want to sort an entity, make sure to provide a sequence number for all values. Reason codes will be sorted by ascending sequence number. If 2 reason codes have the same sequence number, then the created DTTM acts as the tiebreaker. The SequenceNumber field is not available in the configuration UI yet. If you need to populate it, it needs to be done by direct API call: {{url}}/order/api/order/reason/save Note: The \"Initiated by\" field is used for cancel and short reason codes. It will not be honored for other reason types. It can have values of \"Customer\", \"System\", or \"Not applicable\" (value for all other reason codes other than cancel and short reason codes). For cancel and short reason codes, this field will be used to trigger different mod types in the order configuration (Cancel line - customer, Cancel line - System, Decrease quantity - Customer, decrease quantity - System). Line Type Configuration Line type is a way to categorize types of order lines within an order. No default logic exists for line type, but this attribute can be used for configuration or for reporting purposes. Line types are configured in the Line Types UI. Note Type & Note Category Configuration Note types are used to categorize order notes. Each note type can be in one of two categories: Instruction or Customer Communication. Instructions should be used for any notes that capture fulfillment or delivery instructions. Notes of category 'Instruction' are passed on the release outbound sent to fulfillment systems, but cannot be updated after quantities have been released for fulfillment. Customer Communication notes should be used for other types of notes that are informational for CSRs or users who are viewing order history. Note types are configured in the Note Types UI. Notes in the category 'Communication' can be updated after quantities have been released to fulfillment systems. Configuration for Non-Discountable Items To enable the feature that prorates header manual discounts only to discountable items: Navigate to the Charge Type Override UI Add an entry to this table for the charge type 'Discount' Enable the 'Skip Non-Discountable Items' check box Note: This configuration can be enabled only for charge type 'Discount', 'Appeasement, 'Promotion', and 'Coupons'. Ensure that the isDiscountable field is mapped to the order line, whether directly imported on orders or copied from the item master. Email Message Email Messages provides you with the ability to publish Email Messages via the application, which are used by a third-party email marketing system to consume and send emails to the customers notifying them of an event affecting their order, for example, Shipment Confirmation. The following Email Messages are available out of the box. ShipConfirmation – published when the Ship To Address delivery method order line is shipped. ReturnConfirmationNonReceipt – published when Return Order with Return Lines of Ship To Return Center delivery method is confirmed with Receipt Expected set to False. ReturnConfirmationReceipt – published when Return Order with Return Lines of Ship To Return Center delivery method is confirmed with Receipt Expected set to True. Email Messages provided out of the box cannot be deleted or modified. New Email Messages can be created after creating a Serviceable DTO having the attributes required for the Email Template and implementing a service that can be invoked to generate the Email Message outbound. To include the Order DTO in the above-mentioned EMail Messages - configure includeOrderAttributes on the respective Email Message to True. By default, this configuration will be set to False. For each Email Message Type (ShipConfirmation and ReturnConfirmation) mentioned above, one specific base template is available for including the Order DTO. This can be customized and limited to only additional attributes required. The base Order Template includes the entire Order, Order Lines, Extended, and child entities. It is strongly recommended that the base order template is customized to include only additional attributes not included in the base Email Message Template and keep it as light as possible. Base does not evaluate any duplicate attributes included in the Order Template and the Email Message will end up having duplicate attributes. UIs and Entities The configuration UIs mentioned in this document are listed in the following table below, along with information to navigate to the API documentation. UI Name Component Group Seed Data Present? Seed Data Profile Hold Resolve Reasons Order HoldResolveReason services Yes Base Hold Types Order HoldType services Yes Base Line Types Order LineType services No Base Note Types Order NoteType services Yes Base Order Configurations Order OrderConfig services Yes Base OrderExpectedTimeRule services Yes Base OrderMonitoringRule services Yes Base Order Reason Order Reason services Yes Base Order Types Order OrderType services Yes Base Selling Channels Order SellingChannel services Yes Base Email Message Order EmailMessage services Yes Base Troubleshooting Save button is disabled on the Order Configuration UI The save button will be enabled only if \"DaysToArchive\" is less than or equals to 365. Related Articles Order ArchivingOrder TaggingDelivery TrackingShipping RestrictionCart and Preview ModePublishing Order Order Audit Order CancellationCreating and Updating OrderMod TypesOrder Orchestration ProcessHolds"
}