{
  "id": "2788879",
  "permalink": "order-pricing-local-tax",
  "title": "Local Tax",
  "type": "topic",
  "level": 6,
  "path": "Manhattan Active® Omni/Order Management/Process & Configuration Guides/Order Selling/Order Pricing/Tax/Local Tax",
  "raw_item": {
    "id": "2788879",
    "text": "Local Tax",
    "title": "Local Tax",
    "permalink": "order-pricing-local-tax",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "t;2788753",
    "parent": "2788753",
    "created_date": "1623262859",
    "modified_date": "1747160322",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "1"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2163646\" href=\"/order-selling-2\" class=\"breadcrumb-links\">Order Selling</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2163648\" href=\"/order-pricing\" class=\"breadcrumb-links\">Order Pricing</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2788753\" href=\"/order-pricing-tax\" class=\"breadcrumb-links\">Tax</a></li><li> <span>››</span>Local Tax</li></ul>  \t\r\n\t\t<h2>Local Tax</h2>\r\n\r\n<p></p>\r\n\r\n<a href=\"/retail-delivery-fees\" hqid=\"3154971\">Next</a>\r\n<p>&nbsp;</p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/order-pricing-local-tax$overview\">Overview</a></li><li><a href=\"/order-pricing-local-tax$advanced-tax-rates\">Advanced Tax Rates</a><ul><li><a href=\"/order-pricing-local-tax$tax-codes-in-advanced-tax-rates\">Tax Codes in Advanced Tax Rates</a><ul><li><a href=\"/order-pricing-local-tax$tax-rates\">Tax Rates</a></li><li><a href=\"/order-pricing-local-tax$tax-rates-based-on-price-threshold\">Tax Rates based on Price Threshold</a></li><li><a href=\"/order-pricing-local-tax$incremental-rates-in-nbsp-advanced-tax-rates\">Incremental Rates in&nbsp;Advanced Tax Rates</a></li><li><a href=\"/order-pricing-local-tax$non-incremental-rates-in-nbsp-advanced-tax-rates\">Non-Incremental Rates in&nbsp;Advanced Tax Rates</a></li></ul></li></ul></li><li><a href=\"/order-pricing-local-tax$tax-break-up\">Tax break up</a></li><li><a href=\"/order-pricing-local-tax$sales-tax-versus-nbsp-informational-vat-tax\">Sales Tax versus&nbsp;Informational (VAT) Tax</a></li><li><a href=\"/order-pricing-local-tax$tax-exemption\">Tax exemption</a></li></ul></div>\r\n\r\n<div class=\"page\" title=\"Page 7\">\r\n<div class=\"section\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<h3><a name=\"overview\" id=\"overview\"></a>Overview</h3>\r\n\r\n<p>For regions such as Europe or Latin America which do not have complex tax rules like the United States, the rules for calculating tax are fairly simple, and a third-party tax engine is not required. A set of local tax logic can be used to meet these requirements. The local tax rules reside in the Tax component, which the Order component calls during order creation or updates to calculate taxes.&nbsp;Currently, local tax is only supported when Invoice Tax Mode&nbsp;\"Quotation\" is selected.&nbsp;</p>\r\n\r\n<p>Tax rates for items can be configured based on Selling Location and Product Class.&nbsp;If both order and line-level Selling Location are&nbsp;provided, then&nbsp;line-level Selling Location is used. If an order line is eligible for&nbsp;multiple tax rules, then the following logic is used to select a rule:</p>\r\n\r\n<ul>\r\n\t<li>Apply tax rate with Selling Location and Product Class</li>\r\n\t<li>Else, apply tax rate with specific Product Class&nbsp;and no Selling Location&nbsp;specified</li>\r\n\t<li>Else,&nbsp;apply tax rate with specific&nbsp;Selling Location and no Product Class&nbsp;specified</li>\r\n\t<li>Else, apply with no Selling Location or Product Class specified</li>\r\n</ul>\r\n\r\n<p>For example, the tax rate for Product Class \"Electronic\" is been configured 8% for Store A and 10% for Store B.&nbsp; If a $100&nbsp;item of Product Class \"Electronic\" sells from Store A,&nbsp;then $8 tax is applied to the order line. If&nbsp;the same item sells from Store B,&nbsp;then $10 tax is applied.&nbsp;</p>\r\n\r\n<p>For local tax rules which are not specific to a Selling Location, the order Country Code is used to select a tax rate.&nbsp;&nbsp;If a tax rate has been configured for generic location \"All\" and country code \"US,\" then the tax rate is applied to orders with country code \"US\" and null selling location. If an order has a null country code, then the country code of the organization of the order is used for calculation.</p>\r\n\r\n<p>The tax rates for charges are configured based on&nbsp;Tax Code and Selling Location, with similar logic as the item-level logic described above.&nbsp;</p>\r\n\r\n<p>If Is Informational flag is set to True on a Tax Rate and VAT Tax code is defined for tax rates, then VAT Tax Code gets populated on Order and Order Line Tax Detail records.&nbsp;</p>\r\n\r\n<p>Configuration steps for the general tax rate:&nbsp;<br>\r\n<div class=\"toggle_outerdiv\"><p class=\"toggle_div\"><a href=\"#tg-1\" class=\"toggle-content\"><span class=\"toggle-title\">Local Tax - configuration steps</span></a></p><div id=\"tg-1\"><p>1. To use local tax rules for a set of orders, configure the <strong>tax gateway as &quot;Local Tax&quot; and the invoice tax mode as &quot;Quotation&quot; in the Order Configuration UI</strong>.</p>\r\n\r\n<p>2. <strong>Line item taxation</strong> - Local tax rules for items can be configured in one of the following ways by defining Tax Rates with the appropriate attributes:</p>\r\n\r\n<ul>\r\n\t<li>By Product Class and Selling Location</li>\r\n\t<li>By Product Class for all Selling Locations (set LocationId = &quot;ALL&quot;)</li>\r\n\t<li>By Selling Location&nbsp;for all Product Classes (set ProductClass&nbsp;= &quot;ALL&quot;)</li>\r\n\t<li>For all Product Classes and all Selling Locations&nbsp;&nbsp;(set&nbsp;ProductClass&nbsp;and LocationId = &quot;ALL&quot;)</li>\r\n</ul>\r\n\r\n<p>Example - Sell an item for 100.00 at Location 12 whose product class is SHIRTS in system configured for local tax.&nbsp;</p>\r\n\r\n<p>The tax lookup for that item will follow the following precedence logic:</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" width=\"823\">\r\n\t<tbody>\r\n\t\t<tr height=\"21\">\r\n\t\t\t<td height=\"21\" width=\"87\">1</td>\r\n\t\t\t<td width=\"736\">IF a Tax Rate is defined for which LocationId = 12 AND&nbsp;ProductClass = SHIRTS THEN use this rate ELSE</td>\r\n\t\t</tr>\r\n\t\t<tr height=\"21\">\r\n\t\t\t<td height=\"21\">2</td>\r\n\t\t\t<td>IF a Tax Rate is defined for which LocationId = ALL AND&nbsp;ProductClass = SHIRTS THEN use this rate ELSE (this would be an ORG-wide rate for that specific class)</td>\r\n\t\t</tr>\r\n\t\t<tr height=\"21\">\r\n\t\t\t<td height=\"21\">3</td>\r\n\t\t\t<td>IF a Tax Rate is defined for which LocationId = 12 AND&nbsp;ProductClass = ALL THEN use this rate ELSE</td>\r\n\t\t</tr>\r\n\t\t<tr height=\"21\">\r\n\t\t\t<td height=\"21\">4</td>\r\n\t\t\t<td>IF a Tax Rate is defined for which LocationId = ALL AND&nbsp;ProductClass = ALL THEN use this rate ELSE (this would be an ORG-wide tax default)</td>\r\n\t\t</tr>\r\n\t\t<tr height=\"21\">\r\n\t\t\t<td height=\"21\">5</td>\r\n\t\t\t<td>IF there is no ALL Tax Rate record defined for this ORG, AND no specific location record for LocationId 12, THEN no tax on this item</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><strong>Note</strong>: To make a specific product class, or all items sold at a specific location, nontaxable, configure the Tax Rate for that location (or product class) as 0%.</p>\r\n\r\n<p>3. <strong>Charge type taxation&nbsp;</strong>(ex. taxable VAS, taxable shipping) - Similarly, define tax rules for charges (such as Shipping or VAS) by using Tax Code instead of Product Class.&nbsp;&nbsp;</p>\r\n\r\n<p>Note that each order chargeType is&nbsp;associated to a Tax Code.&nbsp; For example, value added service charge type is to be associated to Tax Code &quot;VAS&quot;.&nbsp; Create one or more Tax Rates, leave Product Class blank, and associate to Tax Code VAS.</p>\r\n\r\n<p>Example - To tax value added services at all locations in an Org, create a Tax Rate with LocationID ALL and Tax Code VAS (do not populate the Product Class in this case).&nbsp;To tax VAS differently at specific Location&nbsp;12, create a Tax Rate with LocationID&nbsp;12&nbsp;and Tax Code VAS.&nbsp;</p>\r\n\r\n<p><strong>Note</strong>: To make VAS nontaxable only in that location, define the Tax Rate as 0%.&nbsp;&nbsp;</p>\r\n</div></div></p>\r\n\r\n<h3><a name=\"advanced-tax-rates\" id=\"advanced-tax-rates\"></a><a id=\"advancedTaxRates_localTax\" name=\"advancedTaxRates_localTax\"></a>Advanced Tax Rates</h3>\r\n\r\n<p>Advanced tax rates for local tax bring&nbsp;in flexibility&nbsp;to configure tax rates for specific period.&nbsp;When tax rates are changing, users can configure the changing tax rates upfront for future dates. This&nbsp;also brings&nbsp;in support to calculate tax rates by jurisdiction and for tax holidays. Such as, some states in US participate in tax holidays, and have special tax rates&nbsp;for certain period in a year on select product class. During such US tax holidays these special tax rate could be applied&nbsp;based on certain threshold, above the threshold regular taxes apply.&nbsp;</p>\r\n\r\n<p>Along with the above local tax rate capabilities, the advanced tax rate will allow the retailers to calculate&nbsp;local tax rates based on the following attributes:</p>\r\n\r\n<ul>\r\n\t<li>Tax rates by tax code</li>\r\n\t<li>Tax rates by jurisdiction</li>\r\n\t<li>Tax rates by date ranges (start datetime and end datetime)</li>\r\n</ul>\r\n\r\n<div class=\"tip\">The advancedTaxRateV2 entity uses the following business key: [\"bookId\", \"country\", \"locationId\", \"taxCode\", \"jurisdictionType\", \"beginDate\", \"endDate\", \"jurisdiction\"]. Once a record is created with a specific value for the business key, it cannot be updated. This behavior is intentional and by design.<br>\r\nIf you need to update the beginDate or endDate, you can delete the existing taxRateV2 record and create a new one with the updated values.</div>\r\n\r\n<ul>\r\n\t<li>Tax rates for tax holidays with price thresholds\r\n\t<ul>\r\n\t\t<li>Incremental tax rates</li>\r\n\t\t<li>non-Incremental tax rates</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>The local tax - advanced&nbsp;tax rate&nbsp;overrides the above&nbsp;local tax rate&nbsp;when business flag configuration \"Enable&nbsp;Advanced Local Tax\" is&nbsp;set to TRUE and uses the tax&nbsp;rates from \"Advanced Tax Rate\" configuration and not from \"Tax Rate\" configuration. While this is designed for US taxation, this can also be used for regions such as Europe or Latin America&nbsp;to configure tax rates in advanced if the rates for changing is in coming months/years. And this can also be used as Offline tax for resilient cloud (edge server) when third party engine for tax cannot be reached.</p>\r\n\r\n<p>Local Tax with Advanced Tax rate is applicable to regular tax implementation and for VAT (Informational tax).</p>\r\n\r\n<p><div class=\"toggle_outerdiv\"><p class=\"toggle_div\"><a href=\"#tg-2\" class=\"toggle-content\"><span class=\"toggle-title\">Local Tax - Advanced Tax Rates</span></a></p><div id=\"tg-2\"><p>To use advanced tax rate rules&nbsp;for a set of orders, configure the tax gateway as<strong> &quot;Local Tax&quot;</strong> in the Order Config UI<strong> </strong>and<strong>&nbsp;</strong>set &quot;Enable Advanced Local Tax&quot; to true&nbsp;in Advanced Tax configurations. When this is true, the above local tax - general tax rate will not be used.</p>\n\n<p>Advanced Tax rates&nbsp;for items can be configured based on tax rate requirement but below attributes are mandatory:</p>\n\n<ul>\n\t<li>Book Id: This should be set as &quot;Default&quot;</li>\n\t<li>Country: The country code of the country for which the tax rate is configured</li>\n\t<li>Location Id: If generic rate is fine across all locations, then provide &quot;ALL&quot;</li>\n\t<li>By tax code: Where tax code can be Item product class, or Item&gt; Selling attributes&gt; tax code, or can be for all items i.e. taxCode = ALL.\n\t<ul>\n\t\t<li>This field should continue to be used for taxable order charges as well such as&nbsp;VAS, Shipping, or&nbsp;Return Fee.</li>\n\t</ul>\n\t</li>\n\t<li>Begin date time and End date time</li>\n\t<li>Tax Jurisdiction: If generic then provide &quot;ALL&quot;</li>\n\t<li>Tax rate detail: To configure the actual tax rate</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p><strong>Advanced Tax rates by Jurisdiction</strong></p>\n\n<p>Jurisdiction for advanced tax rate can be defined from &quot;Tax Jurisdiction&quot; on Config&nbsp;UI. Once the tax jurisdictions are defined,&nbsp;It will be available while configuring the advanced tax rates. For example,&nbsp;Jurisdictions can be defined as State, County and City, then advanced tax rates can be configured at each of these tax jurisdiction i.e. State tax rate = 4%, Country Tax rate = 2% and City tax rate = 1%.</p>\n\n<p><strong>Compound Tax in Advanced Tax rates</strong></p>\n\n<p>In some instances, some taxes are themselves taxable.&nbsp; The common example of this currently is the Product Improvement fee (PIF) in some Colorado jurisdictions.&nbsp; To support this via MAO local Advanced Tax, such taxes which are again taxable can be defined as <strong>compound tax</strong>.</p>\n\n<p>When any location has compound taxes configured then such taxes are applied first and then the regular taxes get applied on top of order total and compound taxes.&nbsp; Rather than each separate tax rate applying to a consistent taxable amount, the compound tax increases the taxable amount for subsequent tax rates.</p>\n\n<p>For example: If a location has&nbsp;3% compound taxes&nbsp;+ 4% regular taxes, If you have a @100.00 item subject to this tax rate then 100.00 item is taxed as follows:</p>\n\n<ul>\n\t<li>3% of 100.00 = 3.00, taxable amount = 100, compound tax amount = 3.00, tax rate = 3%</li>\n\t<li>4% of 103.00 = 4.12, taxable amount = 103, tax amount = 4.12, tax rate = 4% (Even though the price of the item is <strong>100.00</strong>, the 4% tax rates applies to <strong>103.00</strong> because of the initial 3% &#39;compound tax&#39;.)</li>\n</ul>\n\n<p><strong>Tax sequence</strong>:&nbsp; Single compound tax at a location should be defined as tax sequence = 1 (compound tax always applies first).&nbsp; In the event of multiple compound taxes, the order would be important and more complicated - although currently the United States does not have any instances where you have more than one compound tax at a location, we have provided for the possibility.</p>\n\n<p>If you want to define&nbsp;multiple compound tax rate then it can be done with same tax sequence, or across multiple tax sequences.&nbsp;</p>\n\n<p>&nbsp;Two compound taxes at same tax sequence: For example-&nbsp;If a location has&nbsp;3% compound taxes at tax sequence=1 and 4%&nbsp;compound taxes at tax sequence= 1 &nbsp;+ 5% regular taxes, If you have a @100.00 item subject to this tax rate then 100.00 item is taxed as follows:</p>\n\n<ul>\n\t<li>3% of 100.00 = 3.00, taxable amount = 100, compound tax amount = 3.00, tax rate = 3%</li>\n\t<li>4% of 100.00 = 4.00, taxable amount = 100, compound tax amount = 4.00, tax rate = 4%</li>\n\t<li>5% of 107.00 = 5.35, taxable amount = 107,&nbsp;tax amount = 5.35, tax rate = 5%</li>\n</ul>\n\n<p>Two compound taxes across&nbsp;tax sequence: For example-&nbsp;If a location has&nbsp;3% compound taxes at tax sequence=1 and 4%&nbsp;compound taxes at tax sequence=2&nbsp;&nbsp;+ 5% regular taxes, If you have a @100.00 item subject to this tax rate then 100.00 item is taxed as follows:</p>\n\n<ul>\n\t<li>3% of 100.00 = 3.00, taxable amount = 100, compound tax amount = 3.00, tax rate = 3%</li>\n\t<li>4% of 103.00 = 4.12, taxable amount = 103, compound tax amount = 4.12, tax rate = 4%</li>\n\t<li>5% of 107.12&nbsp;= 5.356 (~5.36), taxable amount = 107.12,&nbsp;tax amount = 5.36, tax rate = 5%</li>\n</ul>\n\n<p>Tax sequences are only used for compound tax sequencing. By&nbsp;default, base only has tax sequence as 1 and 2 seeded;&nbsp;user can add more tax sequences as required.&nbsp;</p>\n</div></div></p>\r\n\r\n<h4><a name=\"tax-codes-in-advanced-tax-rates\" id=\"tax-codes-in-advanced-tax-rates\"></a>Tax Codes in Advanced Tax Rates</h4>\r\n\r\n<p>Tax rates can be configured based on tax code. And the tax code can be based on either of the values below:</p>\r\n\r\n<ul>\r\n\t<li>Item&nbsp;&gt; selling attributes &gt; Tax code : Used when items across multiple product class have the same tax code or vice versa. Or when&nbsp;items within the same product class are taxed differently.</li>\r\n\t<li>Item &gt; details &gt; Product class :&nbsp;Used when all items within a product class are taxed the same.</li>\r\n\t<li>Order charges &gt; Tax code: Used to configure tax rates for order charges such as VAS, Return fee, and so on.</li>\r\n</ul>\r\n\r\n<h5><a name=\"tax-rates\" id=\"tax-rates\"></a>Tax Rates</h5>\r\n\r\n<p>Regular tax rates can be defined in advanced tax rate details without any lower and upper price threshold. The tax rates are defined in decimal percentage i.e. 0.12 for 12%.</p>\r\n\r\n<h5><a name=\"tax-rates-based-on-price-threshold\" id=\"tax-rates-based-on-price-threshold\"></a>Tax Rates based on Price Threshold</h5>\r\n\r\n<p>Some states in US participate&nbsp;in tax holidays such as back to school, hurricane preparedness tax free deals,&nbsp;Emergency essentials tax free items. During such tax holidays, the rates&nbsp;can&nbsp;be&nbsp;different&nbsp;on certain categories of items up to a set price threshold. Users can configure tax rates per price threshold for such items or category of items.</p>\r\n\r\n<h5><a name=\"incremental-rates-in-nbsp-advanced-tax-rates\" id=\"incremental-rates-in-nbsp-advanced-tax-rates\"></a>Incremental Rates in&nbsp;Advanced Tax Rates</h5>\r\n\r\n<p>Certain jurisdictions&nbsp;have rules such as&nbsp;all clothing and footwear items at $100 or less are exempt from sales tax but items above $100 are taxable state wide with rate of 7% for remainder of item price. But this rate is applied only when item&nbsp;price of clothing and footwear is beyond $100. For example, you buy a pair of jeans priced at $120. The first $100 in that price is not taxable, so you would only pay the sales tax rate of 7% on the remainder of the jeans’ price. In this case, you’d only pay tax on $20. In the final tally, you would only pay 20*0.07=$1.4 in sales tax on your $120 jeans in that location.&nbsp;</p>\r\n\r\n<p><div class=\"toggle_outerdiv\"><p class=\"toggle_div\"><a href=\"#tg-3\" class=\"toggle-content\"><span class=\"toggle-title\">Incremental tax rate configuration</span></a></p><div id=\"tg-3\"><p>If you&nbsp;want to configure&nbsp;tax rates for certain location where tax rates are applied incrementally after the threshold has&nbsp;reached, then you&nbsp;need to set &quot;Is Incremental&quot; = true at advanced tax rate and define tax rate per price threshold range.</p>\n\n<p>For example: In US for&nbsp;location&nbsp;&quot;34 Avenue&quot; if all items under Item product class &quot;Clothes&quot; which are&nbsp;$100 or less are exempt from sales tax from Aug 1st to 5th but items above $100 are taxable statewide with rate of 7% for remainder of item price, then configure the advanced tax rate as below</p>\n\n<p>Advanced Tax Rate Header:</p>\n\n<p>Note: If user has set 2 tax rates for different time period, i.e. tax rate of 10% from&nbsp;2010 to 2100 year&nbsp;and below tax rates of 7% for&nbsp;Aug 1st to 5th of 2020. When order is created before Aug 1 or After Aug 6, 10% tax rate is applied and when order is created during&nbsp;Aug 1 to&nbsp;Aug 5th 2020, then 7% tax rate is picked. In a case like this with overlapping date ranges, the system picks tax rate with&nbsp;the most recent start date. In affect this gives you the ability to create exceptional&nbsp;&quot;tax holiday&quot; windows for temporary tax.</p>\n\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td><strong>Attribute</strong></td>\n\t\t\t<td><strong>Value</strong></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>bookId</td>\n\t\t\t<td>Default</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Country</td>\n\t\t\t<td>US</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>locationId</td>\n\t\t\t<td>34 Avenue&nbsp;(Can be set as &quot;ALL&quot; for flat rates across all locations)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>TaxCode</td>\n\t\t\t<td>Clothes (Can be set as &quot;ALL&quot; for flat rates across all items)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>TaxType</td>\n\t\t\t<td>Sales</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Begin Date in UTC</td>\n\t\t\t<td>08/01/2020, 12:00 AM (User should convert manually to UTC based on the location in which tax rate is defined)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>end Date in UTC</td>\n\t\t\t<td>08/06/2020, 12:00 AM (User should convert manually to UTC based on the location in which tax rate is defined)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Tax Jurisdiction</td>\n\t\t\t<td>ALL or blank (Can be per jurisdiction as well)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Jurisdiction Name</td>\n\t\t\t<td>(Optional for this use case)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>is Exemptable</td>\n\t\t\t<td>Default = TRUE (Not applicable for this use case)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Is Information</td>\n\t\t\t<td>Use if it is for Value added Tax i.e Informational tax&nbsp;(Optional for this use case)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Is Incremental</td>\n\t\t\t<td>TRUE</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>VAT Tax Code</td>\n\t\t\t<td>(Optional for this use case)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Description</td>\n\t\t\t<td>(Optional for this use case)</td>\n\t\t</tr>\n\t</tbody>\n</table>\n\n<p>&nbsp;</p>\n\n<p>Advanced Tax rate detail: Add 2 values under the same header</p>\n\n<p>You buy a pair of jeans priced at $120. The first $100 is 0 tax, and remaining $20 is taxed at&nbsp;7%. &nbsp;</p>\n\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td><strong>Attribute</strong></td>\n\t\t\t<td><strong>Value</strong></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Lower price Threshold</td>\n\t\t\t<td>0&nbsp;(or leave blank if there is no lower&nbsp;limit)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Upper Price Threshold</td>\n\t\t\t<td>100 (This value is equal to or less than)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Tax rate</td>\n\t\t\t<td>0</td>\n\t\t</tr>\n\t</tbody>\n</table>\n\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n\t<tbody>\n\t\t<tr>\n\t\t\t<td><strong>Attribute</strong></td>\n\t\t\t<td><strong>Value</strong></td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Lower price Threshold</td>\n\t\t\t<td>100 (This value is more than configured. i.e. taxed from 100.01)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Upper Price Threshold</td>\n\t\t\t<td>(Leave blank if there is no upper limit)</td>\n\t\t</tr>\n\t\t<tr>\n\t\t\t<td>Tax rate</td>\n\t\t\t<td>0.07</td>\n\t\t</tr>\n\t</tbody>\n</table>\n\n<p>Note: The lower and upper price threshold can be null or blank if user want to set a flat tax rate</p>\n</div></div></p>\r\n\r\n<h5><a name=\"non-incremental-rates-in-nbsp-advanced-tax-rates\" id=\"non-incremental-rates-in-nbsp-advanced-tax-rates\"></a>Non-Incremental Rates in&nbsp;Advanced Tax Rates</h5>\r\n\r\n<p>Certain jurisdictions have rules such as&nbsp;all clothing and footwear items at $100 or less are exempt from sales tax but items above $100 are taxable state wide with rate of 7% for entire item price. For example,&nbsp;you buy a pair of jeans priced at $80&nbsp;since item price&nbsp;is below the threshold, the sales tax is exempted. But if you buy a jeans for $120, which is above the tax holiday threshold sales tax rate of 7% on the entire&nbsp;of the jeans’ price&nbsp;in that location.</p>\r\n\r\n<p><div class=\"toggle_outerdiv\"><p class=\"toggle_div\"><a href=\"#tg-4\" class=\"toggle-content\"><span class=\"toggle-title\">Non-Incremental tax rate configuration</span></a></p><div id=\"tg-4\"><p>If you&nbsp;want to configure&nbsp;tax rates for certain location where tax rates are&nbsp;applied non-incrementally after the threshold is reached, then you&nbsp;need to set &quot;Is Incremental&quot; = false&nbsp;at advanced tax rate and define tax rate per price threshold range.</p>\n\n<p>For example: In US for&nbsp;location&nbsp;&quot;34 Avenue&quot; if all items under Item product class &quot;Clothes&quot; which are&nbsp;$100 or less are exempt from sales tax from Aug 1st to 5th but items above $100 are taxable statewide with rate of 7% for entire item price,&nbsp;then configure the advanced tax rate as below</p>\n\n<p>Advanced Tax Rate Header: Use same configured as above but make &quot;Is Incremental&quot; = false</p>\n\n<p>Advanced Tax Rate Details: Use same configuration as above</p>\n\n<p>With this configuration, if you buy a pair of jeans priced at $80, then you will be taxed at 0%. But if you buy a pair&nbsp;of jeans priced at $120, i.e. more than threshold then entire $120 is taxed at 7%.</p>\n</div></div></p>\r\n\r\n<h3><a name=\"tax-break-up\" id=\"tax-break-up\"></a><a id=\"local_tax_break_up\" name=\"local_tax_break_up\"></a>Tax break up</h3>\r\n\r\n<p>This allows for different tax levels to be separated out on the receipt.&nbsp; The most common example is GST/PST/HST presentation in Canada. To configure local tax system to support this, the tax rates need to be defined in \"Advanced Tax&nbsp;Rate V2\" and \"Enable Advanced local Tax V2\" should be enabled under Advanced Tax Configurations. The above&nbsp;configuration with tax mapping will work the same with local taxes also when defined as recommended below.</p>\r\n\r\n<ol>\r\n\t<li>Define Tax Jurisdiction Type for Canada Local tax rate\r\n\t<ol>\r\n\t\t<li>For Canada tax only valid JurisdictionTypes are&nbsp;<em data-renderer-mark=\"true\">“COUNTRY“</em>&nbsp;and&nbsp;<em data-renderer-mark=\"true\">“PROVINCE“</em></li>\r\n\t</ol>\r\n\t</li>\r\n\t<li>After #1 above, define tax rate in advanced tax rate V2 for each of this jurisdiction types.\r\n\t<ol>\r\n\t\t<li>Federal Rate: Example is to use \"Jurisdiction\": \"Canada\" and&nbsp;\"TaxRateType\": \"GST/HST\"</li>\r\n\t\t<li>Federal Rate: Example is to use \"Jurisdiction\": \"Manitoba\" and&nbsp;\"TaxRateType\": \"Retail Sales Tax (RST)\"</li>\r\n\t</ol>\r\n\t</li>\r\n\t<li>If base seed data Tax mapping is changed, the local tax rate configuration also need to be revisited accordingly.</li>\r\n</ol>\r\n\r\n<h3><a name=\"sales-tax-versus-nbsp-informational-vat-tax\" id=\"sales-tax-versus-nbsp-informational-vat-tax\"></a>Sales Tax versus&nbsp;Informational (VAT) Tax</h3>\r\n\r\n<p>The above Local Tax setup can be used to create US-Type Sales Tax and&nbsp;European/Asian-type VAT (Informational) tax.&nbsp; If a third party tax engine such as Vertex is used, the retailer must work with the vendor to ensure that the engine has appropriate configs to support Sales vs Informational&nbsp;logic.&nbsp;</p>\r\n\r\n<p>US Sales&nbsp;Tax logic: Tax is calculated from item prices and appended to them.&nbsp;Customer will pay 110.00 for a 100.00 item taxed at 10% and Active® Omni&nbsp;will populate taxableAmount = 100.00, taxAmount = 10.00.&nbsp;</p>\r\n\r\n<p>VAT Informational Tax Logic: Tax is considered to be included in the price of an item.&nbsp; Customer will pay 100.00 for a 100.00 item taxed at 10%, but Active® Omni&nbsp;will back-calculate the taxableAmount and taxAmount from the inclusive 100.00.&nbsp; In this case, taxableAmount = 90.91 and taxAmount = 9.09.</p>\r\n\r\n<p>VAT Tax Code: In case of VAT tax /Informational Tax, user can specify VAT Tax Codes to be persistently associated to a Tax Rate.&nbsp;This is an optional field.</p>\r\n\r\n<p>This is important in jurisdictions such as Japan where for example most items are taxable at 10% but food items are taxable at 8% - in order to report on how much tax is collected for 'nonfood' vs 'food' and summarize the amounts correctly, the 10% VAT could be associated to VAT Code NF (for Nonfood) and the 8% VAT could be associated to Code F (for Food).</p>\r\n\r\n<p>1. As noted - to use local tax rules for a set of orders for either SALES or INFORMATIONAL tax, configure the tax gateway as \"Local Tax\" in the Order Config UI.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Is Informational flag must be set to True for system to use Informational (VAT) logic. If Is Informational is set to False, Sales Tax logic will be used.&nbsp;&nbsp;</div>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> Tax Exempt and Tax Override are not supported for Informational Tax.&nbsp; Users should not be given UI grants to these override options in POS.</div>\r\n\r\n<p>2. Line item taxation and&nbsp;charge type taxation can be configured for either Sales or Informational&nbsp;tax logic using the steps above.&nbsp;</p>\r\n\r\n<p>Calculation for Informational Tax is as follows:</p>\r\n\r\n<p>Taxable amount = Item price ÷ ( 1+ tax rate) where the tax rate is in decimal. &nbsp;I.E., 10% = 0.1</p>\r\n\r\n<h3><a name=\"tax-exemption\" id=\"tax-exemption\"></a><a id=\"localTaxExemption\" name=\"localTaxExemption\"></a>Tax exemption</h3>\r\n\r\n<p>Tax exemption is also applicable and allowed when application is configured to use MAO Local&nbsp;tax engine.</p>\r\n\r\n<p>The process of applying the TAX EXEMPT function&nbsp;remains the same as&nbsp;when application is using Vertex as a tax engine.</p>\r\n\r\n<p>However, the end result is less flexible than when Vertex applies exemption rules.&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>If for each item, its assigned relevant local tax rate has been&nbsp;defined as isExemptable TRUE, then the tax for that item will be zero'd out.</li>\r\n\t<li>If this flag is turned off then that&nbsp;tax rate is always applied in spite of the TAX EXEMPT function&nbsp;applied to the&nbsp;transaction.</li>\r\n</ul>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n\r\n<div class=\"page\" title=\"Page 7\">\r\n<div class=\"section\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<p>&nbsp;</p>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 29079,
  "scraped_at": "2025-08-09T21:58:31.166563",
  "content_clean": "Home ››Manhattan Active® Omni››Order Management››Process & Configuration Guides››Order Selling››Order Pricing››Tax ››Local Tax Local Tax Next OverviewAdvanced Tax RatesTax Codes in Advanced Tax RatesTax RatesTax Rates based on Price ThresholdIncremental Rates in Advanced Tax RatesNon-Incremental Rates in Advanced Tax RatesTax break upSales Tax versus Informational (VAT) TaxTax exemption Overview For regions such as Europe or Latin America which do not have complex tax rules like the United States, the rules for calculating tax are fairly simple, and a third-party tax engine is not required. A set of local tax logic can be used to meet these requirements. The local tax rules reside in the Tax component, which the Order component calls during order creation or updates to calculate taxes. Currently, local tax is only supported when Invoice Tax Mode \"Quotation\" is selected. Tax rates for items can be configured based on Selling Location and Product Class. If both order and line-level Selling Location are provided, then line-level Selling Location is used. If an order line is eligible for multiple tax rules, then the following logic is used to select a rule: Apply tax rate with Selling Location and Product Class Else, apply tax rate with specific Product Class and no Selling Location specified Else, apply tax rate with specific Selling Location and no Product Class specified Else, apply with no Selling Location or Product Class specified For example, the tax rate for Product Class \"Electronic\" is been configured 8% for Store A and 10% for Store B.  If a $100 item of Product Class \"Electronic\" sells from Store A, then $8 tax is applied to the order line. If the same item sells from Store B, then $10 tax is applied. For local tax rules which are not specific to a Selling Location, the order Country Code is used to select a tax rate.  If a tax rate has been configured for generic location \"All\" and country code \"US,\" then the tax rate is applied to orders with country code \"US\" and null selling location. If an order has a null country code, then the country code of the organization of the order is used for calculation. The tax rates for charges are configured based on Tax Code and Selling Location, with similar logic as the item-level logic described above. If Is Informational flag is set to True on a Tax Rate and VAT Tax code is defined for tax rates, then VAT Tax Code gets populated on Order and Order Line Tax Detail records. Configuration steps for the general tax rate: Local Tax - configuration steps1. To use local tax rules for a set of orders, configure the tax gateway as \"Local Tax\" and the invoice tax mode as \"Quotation\" in the Order Configuration UI. 2. Line item taxation - Local tax rules for items can be configured in one of the following ways by defining Tax Rates with the appropriate attributes: By Product Class and Selling Location By Product Class for all Selling Locations (set LocationId = \"ALL\") By Selling Location for all Product Classes (set ProductClass = \"ALL\") For all Product Classes and all Selling Locations  (set ProductClass and LocationId = \"ALL\") Example - Sell an item for 100.00 at Location 12 whose product class is SHIRTS in system configured for local tax. The tax lookup for that item will follow the following precedence logic: 1 IF a Tax Rate is defined for which LocationId = 12 AND ProductClass = SHIRTS THEN use this rate ELSE 2 IF a Tax Rate is defined for which LocationId = ALL AND ProductClass = SHIRTS THEN use this rate ELSE (this would be an ORG-wide rate for that specific class) 3 IF a Tax Rate is defined for which LocationId = 12 AND ProductClass = ALL THEN use this rate ELSE 4 IF a Tax Rate is defined for which LocationId = ALL AND ProductClass = ALL THEN use this rate ELSE (this would be an ORG-wide tax default) 5 IF there is no ALL Tax Rate record defined for this ORG, AND no specific location record for LocationId 12, THEN no tax on this item Note: To make a specific product class, or all items sold at a specific location, nontaxable, configure the Tax Rate for that location (or product class) as 0%. 3. Charge type taxation (ex. taxable VAS, taxable shipping) - Similarly, define tax rules for charges (such as Shipping or VAS) by using Tax Code instead of Product Class. Note that each order chargeType is associated to a Tax Code.  For example, value added service charge type is to be associated to Tax Code \"VAS\".  Create one or more Tax Rates, leave Product Class blank, and associate to Tax Code VAS. Example - To tax value added services at all locations in an Org, create a Tax Rate with LocationID ALL and Tax Code VAS (do not populate the Product Class in this case). To tax VAS differently at specific Location 12, create a Tax Rate with LocationID 12 and Tax Code VAS. Note: To make VAS nontaxable only in that location, define the Tax Rate as 0%. Advanced Tax Rates Advanced tax rates for local tax bring in flexibility to configure tax rates for specific period. When tax rates are changing, users can configure the changing tax rates upfront for future dates. This also brings in support to calculate tax rates by jurisdiction and for tax holidays. Such as, some states in US participate in tax holidays, and have special tax rates for certain period in a year on select product class. During such US tax holidays these special tax rate could be applied based on certain threshold, above the threshold regular taxes apply. Along with the above local tax rate capabilities, the advanced tax rate will allow the retailers to calculate local tax rates based on the following attributes: Tax rates by tax code Tax rates by jurisdiction Tax rates by date ranges (start datetime and end datetime) The advancedTaxRateV2 entity uses the following business key: [\"bookId\", \"country\", \"locationId\", \"taxCode\", \"jurisdictionType\", \"beginDate\", \"endDate\", \"jurisdiction\"]. Once a record is created with a specific value for the business key, it cannot be updated. This behavior is intentional and by design. If you need to update the beginDate or endDate, you can delete the existing taxRateV2 record and create a new one with the updated values. Tax rates for tax holidays with price thresholds Incremental tax rates non-Incremental tax rates The local tax - advanced tax rate overrides the above local tax rate when business flag configuration \"Enable Advanced Local Tax\" is set to TRUE and uses the tax rates from \"Advanced Tax Rate\" configuration and not from \"Tax Rate\" configuration. While this is designed for US taxation, this can also be used for regions such as Europe or Latin America to configure tax rates in advanced if the rates for changing is in coming months/years. And this can also be used as Offline tax for resilient cloud (edge server) when third party engine for tax cannot be reached. Local Tax with Advanced Tax rate is applicable to regular tax implementation and for VAT (Informational tax). Local Tax - Advanced Tax RatesTo use advanced tax rate rules for a set of orders, configure the tax gateway as \"Local Tax\" in the Order Config UI and set \"Enable Advanced Local Tax\" to true in Advanced Tax configurations. When this is true, the above local tax - general tax rate will not be used. Advanced Tax rates for items can be configured based on tax rate requirement but below attributes are mandatory: Book Id: This should be set as \"Default\" Country: The country code of the country for which the tax rate is configured Location Id: If generic rate is fine across all locations, then provide \"ALL\" By tax code: Where tax code can be Item product class, or Item> Selling attributes> tax code, or can be for all items i.e. taxCode = ALL. This field should continue to be used for taxable order charges as well such as VAS, Shipping, or Return Fee. Begin date time and End date time Tax Jurisdiction: If generic then provide \"ALL\" Tax rate detail: To configure the actual tax rate Advanced Tax rates by Jurisdiction Jurisdiction for advanced tax rate can be defined from \"Tax Jurisdiction\" on Config UI. Once the tax jurisdictions are defined, It will be available while configuring the advanced tax rates. For example, Jurisdictions can be defined as State, County and City, then advanced tax rates can be configured at each of these tax jurisdiction i.e. State tax rate = 4%, Country Tax rate = 2% and City tax rate = 1%. Compound Tax in Advanced Tax rates In some instances, some taxes are themselves taxable.  The common example of this currently is the Product Improvement fee (PIF) in some Colorado jurisdictions.  To support this via MAO local Advanced Tax, such taxes which are again taxable can be defined as compound tax. When any location has compound taxes configured then such taxes are applied first and then the regular taxes get applied on top of order total and compound taxes.  Rather than each separate tax rate applying to a consistent taxable amount, the compound tax increases the taxable amount for subsequent tax rates. For example: If a location has 3% compound taxes + 4% regular taxes, If you have a @100.00 item subject to this tax rate then 100.00 item is taxed as follows: 3% of 100.00 = 3.00, taxable amount = 100, compound tax amount = 3.00, tax rate = 3% 4% of 103.00 = 4.12, taxable amount = 103, tax amount = 4.12, tax rate = 4% (Even though the price of the item is 100.00, the 4% tax rates applies to 103.00 because of the initial 3% 'compound tax'.) Tax sequence:  Single compound tax at a location should be defined as tax sequence = 1 (compound tax always applies first).  In the event of multiple compound taxes, the order would be important and more complicated - although currently the United States does not have any instances where you have more than one compound tax at a location, we have provided for the possibility. If you want to define multiple compound tax rate then it can be done with same tax sequence, or across multiple tax sequences. Two compound taxes at same tax sequence: For example- If a location has 3% compound taxes at tax sequence=1 and 4% compound taxes at tax sequence= 1  + 5% regular taxes, If you have a @100.00 item subject to this tax rate then 100.00 item is taxed as follows: 3% of 100.00 = 3.00, taxable amount = 100, compound tax amount = 3.00, tax rate = 3% 4% of 100.00 = 4.00, taxable amount = 100, compound tax amount = 4.00, tax rate = 4% 5% of 107.00 = 5.35, taxable amount = 107, tax amount = 5.35, tax rate = 5% Two compound taxes across tax sequence: For example- If a location has 3% compound taxes at tax sequence=1 and 4% compound taxes at tax sequence=2  + 5% regular taxes, If you have a @100.00 item subject to this tax rate then 100.00 item is taxed as follows: 3% of 100.00 = 3.00, taxable amount = 100, compound tax amount = 3.00, tax rate = 3% 4% of 103.00 = 4.12, taxable amount = 103, compound tax amount = 4.12, tax rate = 4% 5% of 107.12 = 5.356 (~5.36), taxable amount = 107.12, tax amount = 5.36, tax rate = 5% Tax sequences are only used for compound tax sequencing. By default, base only has tax sequence as 1 and 2 seeded; user can add more tax sequences as required. Tax Codes in Advanced Tax Rates Tax rates can be configured based on tax code. And the tax code can be based on either of the values below: Item > selling attributes > Tax code : Used when items across multiple product class have the same tax code or vice versa. Or when items within the same product class are taxed differently. Item > details > Product class : Used when all items within a product class are taxed the same. Order charges > Tax code: Used to configure tax rates for order charges such as VAS, Return fee, and so on. Tax Rates Regular tax rates can be defined in advanced tax rate details without any lower and upper price threshold. The tax rates are defined in decimal percentage i.e. 0.12 for 12%. Tax Rates based on Price Threshold Some states in US participate in tax holidays such as back to school, hurricane preparedness tax free deals, Emergency essentials tax free items. During such tax holidays, the rates can be different on certain categories of items up to a set price threshold. Users can configure tax rates per price threshold for such items or category of items. Incremental Rates in Advanced Tax Rates Certain jurisdictions have rules such as all clothing and footwear items at $100 or less are exempt from sales tax but items above $100 are taxable state wide with rate of 7% for remainder of item price. But this rate is applied only when item price of clothing and footwear is beyond $100. For example, you buy a pair of jeans priced at $120. The first $100 in that price is not taxable, so you would only pay the sales tax rate of 7% on the remainder of the jeans’ price. In this case, you’d only pay tax on $20. In the final tally, you would only pay 20*0.07=$1.4 in sales tax on your $120 jeans in that location. Incremental tax rate configurationIf you want to configure tax rates for certain location where tax rates are applied incrementally after the threshold has reached, then you need to set \"Is Incremental\" = true at advanced tax rate and define tax rate per price threshold range. For example: In US for location \"34 Avenue\" if all items under Item product class \"Clothes\" which are $100 or less are exempt from sales tax from Aug 1st to 5th but items above $100 are taxable statewide with rate of 7% for remainder of item price, then configure the advanced tax rate as below Advanced Tax Rate Header: Note: If user has set 2 tax rates for different time period, i.e. tax rate of 10% from 2010 to 2100 year and below tax rates of 7% for Aug 1st to 5th of 2020. When order is created before Aug 1 or After Aug 6, 10% tax rate is applied and when order is created during Aug 1 to Aug 5th 2020, then 7% tax rate is picked. In a case like this with overlapping date ranges, the system picks tax rate with the most recent start date. In affect this gives you the ability to create exceptional \"tax holiday\" windows for temporary tax. Attribute Value bookId Default Country US locationId 34 Avenue (Can be set as \"ALL\" for flat rates across all locations) TaxCode Clothes (Can be set as \"ALL\" for flat rates across all items) TaxType Sales Begin Date in UTC 08/01/2020, 12:00 AM (User should convert manually to UTC based on the location in which tax rate is defined) end Date in UTC 08/06/2020, 12:00 AM (User should convert manually to UTC based on the location in which tax rate is defined) Tax Jurisdiction ALL or blank (Can be per jurisdiction as well) Jurisdiction Name (Optional for this use case) is Exemptable Default = TRUE (Not applicable for this use case) Is Information Use if it is for Value added Tax i.e Informational tax (Optional for this use case) Is Incremental TRUE VAT Tax Code (Optional for this use case) Description (Optional for this use case) Advanced Tax rate detail: Add 2 values under the same header You buy a pair of jeans priced at $120. The first $100 is 0 tax, and remaining $20 is taxed at 7%. Attribute Value Lower price Threshold 0 (or leave blank if there is no lower limit) Upper Price Threshold 100 (This value is equal to or less than) Tax rate 0 Attribute Value Lower price Threshold 100 (This value is more than configured. i.e. taxed from 100.01) Upper Price Threshold (Leave blank if there is no upper limit) Tax rate 0.07 Note: The lower and upper price threshold can be null or blank if user want to set a flat tax rate Non-Incremental Rates in Advanced Tax Rates Certain jurisdictions have rules such as all clothing and footwear items at $100 or less are exempt from sales tax but items above $100 are taxable state wide with rate of 7% for entire item price. For example, you buy a pair of jeans priced at $80 since item price is below the threshold, the sales tax is exempted. But if you buy a jeans for $120, which is above the tax holiday threshold sales tax rate of 7% on the entire of the jeans’ price in that location. Non-Incremental tax rate configurationIf you want to configure tax rates for certain location where tax rates are applied non-incrementally after the threshold is reached, then you need to set \"Is Incremental\" = false at advanced tax rate and define tax rate per price threshold range. For example: In US for location \"34 Avenue\" if all items under Item product class \"Clothes\" which are $100 or less are exempt from sales tax from Aug 1st to 5th but items above $100 are taxable statewide with rate of 7% for entire item price, then configure the advanced tax rate as below Advanced Tax Rate Header: Use same configured as above but make \"Is Incremental\" = false Advanced Tax Rate Details: Use same configuration as above With this configuration, if you buy a pair of jeans priced at $80, then you will be taxed at 0%. But if you buy a pair of jeans priced at $120, i.e. more than threshold then entire $120 is taxed at 7%. Tax break up This allows for different tax levels to be separated out on the receipt.  The most common example is GST/PST/HST presentation in Canada. To configure local tax system to support this, the tax rates need to be defined in \"Advanced Tax Rate V2\" and \"Enable Advanced local Tax V2\" should be enabled under Advanced Tax Configurations. The above configuration with tax mapping will work the same with local taxes also when defined as recommended below. Define Tax Jurisdiction Type for Canada Local tax rate For Canada tax only valid JurisdictionTypes are “COUNTRY“ and “PROVINCE“ After #1 above, define tax rate in advanced tax rate V2 for each of this jurisdiction types. Federal Rate: Example is to use \"Jurisdiction\": \"Canada\" and \"TaxRateType\": \"GST/HST\" Federal Rate: Example is to use \"Jurisdiction\": \"Manitoba\" and \"TaxRateType\": \"Retail Sales Tax (RST)\" If base seed data Tax mapping is changed, the local tax rate configuration also need to be revisited accordingly. Sales Tax versus Informational (VAT) Tax The above Local Tax setup can be used to create US-Type Sales Tax and European/Asian-type VAT (Informational) tax.  If a third party tax engine such as Vertex is used, the retailer must work with the vendor to ensure that the engine has appropriate configs to support Sales vs Informational logic. US Sales Tax logic: Tax is calculated from item prices and appended to them. Customer will pay 110.00 for a 100.00 item taxed at 10% and Active® Omni will populate taxableAmount = 100.00, taxAmount = 10.00. VAT Informational Tax Logic: Tax is considered to be included in the price of an item.  Customer will pay 100.00 for a 100.00 item taxed at 10%, but Active® Omni will back-calculate the taxableAmount and taxAmount from the inclusive 100.00.  In this case, taxableAmount = 90.91 and taxAmount = 9.09. VAT Tax Code: In case of VAT tax /Informational Tax, user can specify VAT Tax Codes to be persistently associated to a Tax Rate. This is an optional field. This is important in jurisdictions such as Japan where for example most items are taxable at 10% but food items are taxable at 8% - in order to report on how much tax is collected for 'nonfood' vs 'food' and summarize the amounts correctly, the 10% VAT could be associated to VAT Code NF (for Nonfood) and the 8% VAT could be associated to Code F (for Food). 1. As noted - to use local tax rules for a set of orders for either SALES or INFORMATIONAL tax, configure the tax gateway as \"Local Tax\" in the Order Config UI. Note: Is Informational flag must be set to True for system to use Informational (VAT) logic. If Is Informational is set to False, Sales Tax logic will be used. Note: Tax Exempt and Tax Override are not supported for Informational Tax.  Users should not be given UI grants to these override options in POS. 2. Line item taxation and charge type taxation can be configured for either Sales or Informational tax logic using the steps above. Calculation for Informational Tax is as follows: Taxable amount = Item price ÷ ( 1+ tax rate) where the tax rate is in decimal.  I.E., 10% = 0.1 Tax exemption Tax exemption is also applicable and allowed when application is configured to use MAO Local tax engine. The process of applying the TAX EXEMPT function remains the same as when application is using Vertex as a tax engine. However, the end result is less flexible than when Vertex applies exemption rules. If for each item, its assigned relevant local tax rate has been defined as isExemptable TRUE, then the tax for that item will be zero'd out. If this flag is turned off then that tax rate is always applied in spite of the TAX EXEMPT function applied to the transaction."
}