{
  "id": "2786251",
  "permalink": "order-creation",
  "title": "Order Creation",
  "type": "topic",
  "level": 5,
  "path": "Manhattan Active® Omni/Order Management/Process & Configuration Guides/Customer Service/Item Search/Order Creation",
  "raw_item": {
    "id": "2786251",
    "text": "Order Creation",
    "title": "Order Creation",
    "permalink": "order-creation",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "t;2781976",
    "parent": "2781976",
    "created_date": "1622653148",
    "modified_date": "1753077878",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "1"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158820\" href=\"/customer-service\" class=\"breadcrumb-links\">Customer Service</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2781976\" href=\"/itemsearch\" class=\"breadcrumb-links\">Item Search</a></li><li> <span>››</span>Order Creation</li></ul>  \t\r\n\t\t<h2><a name=\"order-creation\" id=\"order-creation\"></a>Order Creation</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/order-creation$order-creation\">Order Creation</a><ul><li><a href=\"/order-creation$create-order-nbsp\">Create Order&nbsp;</a><ul><li><a href=\"/order-creation$select-nbsp-available-delivery-options\">Select&nbsp;Available Delivery Options</a></li><li><a href=\"/order-creation$select-nbsp-a-nbsp-shipping-method\">Select&nbsp;a&nbsp;Shipping Method</a></li><li><a href=\"/order-creation$tax-exemption-in-contact-center\">Tax Exemption in Contact Center</a><ul><li><a href=\"/order-creation$tax-exemption-configuration\">Tax Exemption Configuration</a></li></ul></li></ul></li><li><a href=\"/order-creation$grants-and-configuration\">Grants and Configuration</a><ul><li><a href=\"/order-creation$capturing-payment\">Capturing Payment</a><ul><li><a href=\"/order-creation$using-a-saved-payment-method\">Using a Saved Payment Method</a></li></ul></li></ul></li><li><a href=\"/order-creation$alternate-pickup-person\">Alternate Pickup Person</a><ul><li><a href=\"/order-creation$configurations\">Configurations</a></li></ul></li><li><a href=\"/order-creation$address-verification-services\">Address Verification Services</a><ul><li><a href=\"/order-creation$address-verification-for-imported-orders\">Address Verification for imported orders</a></li></ul></li><li><a href=\"/order-creation$capturing-notes\">Capturing Notes</a><ul><li><a href=\"/order-creation$note-type-note-nbsp\">Note Type & Note&nbsp;</a></li></ul></li><li><a href=\"/order-creation$opt-in-opt-out-of-transactional-sms-in-the-contact-center-ui\">Opt in/Opt out of transactional SMS in the Contact Center UI</a></li><li><a href=\"/order-creation$capturing-phone-number\">Capturing Phone Number</a><ul><li><a href=\"/order-creation$capture-phone-number-country-code\">Capture Phone Number Country Code</a><ul><li><a href=\"/order-creation$country-code-capture\">Country Code Capture</a></li><li><a href=\"/order-creation$suggested-phone-number-formats-nbsp-by-country\">Suggested Phone Number Formats&nbsp;by Country</a></li><li><a href=\"/order-creation$country-code-edits\">Country Code Edits</a></li><li><a href=\"/order-creation$including-nbsp-phone-code-and-phone-in-outbound-messages\">Including&nbsp;Phone Code and Phone in Outbound Messages</a></li></ul></li></ul></li><li><a href=\"/order-creation$shipping-restrictions\">Shipping Restrictions</a></li><li><a href=\"/order-creation$delete-order-line\">Delete Order Line</a></li><li><a href=\"/order-creation$configuration\">Configuration</a><ul><li><a href=\"/order-creation$cybersource-nbsp-for-credit-card-payments\">CyberSource&nbsp;For Credit Card Payments</a></li><li><a href=\"/order-creation$address-verification-service-avs\">Address Verification Service (AVS)</a></li><li><a href=\"/order-creation$payment-types-displayed-in-contact-center\">Payment Types Displayed in Contact Center</a></li></ul></li><li><a href=\"/order-creation$implementation-flavor\">Implementation Flavor</a><ul><li><a href=\"/order-creation$accommodate-different-address-format-in-call-center\">Accommodate different address format in call center</a></li><li><a href=\"/order-creation$how-to-invoke-custom-message-when-switching-tabs\">How to invoke custom message when switching tabs</a></li><li><a href=\"/order-creation$how-does-system-generate-order-numbers\">How does system generate order numbers</a></li><li><a href=\"/order-creation$how-to-search-for-orders-using-custom-search-fields\">How to search for orders using custom search fields</a></li></ul></li><li><a href=\"/order-creation$related-articles\">Related Articles</a></li></ul></li></ul></div>\r\n\r\n<h3><a name=\"create-order-nbsp\" id=\"create-order-nbsp\"></a>Create Order&nbsp;</h3>\r\n\r\n<p data-pm-slice=\"1 1 []\">Another common scenario that a CSR faces is a request to place a new order for a customer over the phone. In this case, the CSR first asks the customer which item(s) they are interested in purchasing. The customer describes the name of the item, and possibly some additional qualifying attributes such as style, color, size, and so on. The CSR uses the item search to search for the item. The CSR uses the Item List page to view the item search results&nbsp;as indicated in the<span style=\"background-color:#ffffff;\">&nbsp;</span><a href=\"https://omni.helpdocsonline.com/search-items\"><span style=\"background-color:#ffffff;\">Search Items</span></a><span style=\"background-color:#ffffff;\">&nbsp;guide</span><strong><span style=\"background-color:#ffffff;\">.&nbsp;</span></strong>Refer to <a href=\"http://omni.helpdocsonline.com/customer-service-ui-resources\">UI Resources</a>&nbsp;for the required grants to create an order.</p>\r\n\r\n<p>Once the CSR has located the item that the customer wishes to purchase, the CSR will ask the customer for the size,&nbsp;color, and quantity of the item to see if the item is available. The CSR may also view any active promotions or discounts on this screen, such as “Buy One Get One Free” or “Buy One Get Another Free”. Typically, CSRs will tell the customer that they qualify for a promotion to let the customer feel that they are getting the best price on their purchase. Additional information about inventory availability, promotions, and discounts is available in the&nbsp;<a href=\"https://omni.helpdocsonline.com/search-items\">Search Items</a>&nbsp;guide. The CSR should note that the call center screen will pull the lowest price (ProductPrice) and reflect that as the price for the style, but the individual item price will be reflected once the CSR selects that specific item.&nbsp;</p>\r\n\r\n<h4><a name=\"select-nbsp-available-delivery-options\" id=\"select-nbsp-available-delivery-options\"></a><a id=\"select delivery options\" name=\"select delivery options\"></a>Select&nbsp;Available Delivery Options</h4>\r\n\r\n<p>Next, the CSR asks the customer the delivery options if they would like to have the item shipped to their home, or if they would prefer to pick it up in a store.</p>\r\n\r\n<ol>\r\n\t<li><strong>Ship To Address </strong>-If the customer selects a ship to Home, then the&nbsp;CSR will enter shipping address details later in the process</li>\r\n\t<li>\r\n\t<p><strong>Pick Up at Store</strong>&nbsp;- Based on the Delivery Method Sub Type, the selected item is picked up by the customer from the selected/preferred store or it is delivered at the store curbside. Select an appropriate Delivery Method Sub Type from the following options: curbside and in-store</p>\r\n\r\n\t<ul>\r\n\t\t<li>If the customer prefers to pick up the item in a store, the CSR uses the Store Locator to find a store close to the customer’s location. The Store Locator screen allows the CSR to view a map of stores within a radius (i.e. 10 miles, 20 miles, etc.) of a city or postal code and also indicates which stores allow for item pickup or for ship to store. The Store Locator lists all store locations (not only those that support pick-ups or shipping), but the Pick Up and Ship To buttons are only enabled for stores that support pick-up in store or ship to store. The Store Locator will also provide the store price saved with the item selected. If the store has a lower price due to markdowns or regional sales, then the CSR will see this price on the locator. This price is shown for visibility for the CSR but cannot be used on the order.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>\r\n\t<p><strong>Ship to Store</strong>&nbsp;- Ship the selected item to a nearby store to be picked up by the customer.&nbsp;Click '<em>Select'&nbsp;</em>to select the store that has the item in stock. See the topic&nbsp;<a href=\"https://omni.helpdocsonline.com/search-items$Store Locator\">Store Locator</a>&nbsp;for more information.</p>\r\n\t</li>\r\n</ol>\r\n\r\n<h4><a name=\"select-nbsp-a-nbsp-shipping-method\" id=\"select-nbsp-a-nbsp-shipping-method\"></a>Select&nbsp;a&nbsp;Shipping Method</h4>\r\n\r\n<p>Finally, the CSR asks the customer for a preferred shipping speed and selects a shipping method.The shipping rates for each item are configured by the system based on different attributes, such as weight, volume, and value of the item.</p>\r\n\r\n<p>To select the shipping method for the selected item, perform the following steps:</p>\r\n\r\n<ol>\r\n\t<li>\r\n\t<p>On the<strong> </strong>'<em>Item Search'</em>&nbsp;page,&nbsp;<a href=\"https://omni.helpdocsonline.com/search-items$ItemList\">search and select an item</a>.&nbsp;&nbsp;</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>After a delivery option is selected for the&nbsp;item, the shipping methods are&nbsp;enabled along with&nbsp;the estimated delivery date.&nbsp;Select the necessary shipping method.</p>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Shipping methods can be filtered using the country code and postal code fields. The country drop-down is populated from the countries configured in the Country Configuration UI, where \"Shipping Restricted\" is set to false. By entering the country and postal code and clicking the arrow button, the list of eligible shipping methods will be filtered to those that ship to that location. To re-set the shipping methods, the user can click the 'X'.</p>\r\n\r\n<div class=\"tip\" style=\"text-align: justify;\"><strong>Note</strong>: For filtering shipping methods using country code and the postal code, the system uses calculateDeliveryDates API. To enable calculateDeliveryDates API calls, configure \"Promising Configuration Used For Item Delivery Date Calculation\" with the appropriate&nbsp;promising configuration ID. Refer to <a href=\"https://omni.helpdocsonline.com/call-centerconfiguration$display-delivery-dates-on-item-details\">Display Delivery Dates on Item Details</a> for more information.</div>\r\n\r\n<p>Once all of these selections have been made, if the customer wishes to add more items to the order, the CSR clicks the Add to Cart button which allows them to remain on the item search screen while they build a shopping cart. If the customer confirms that this is the only item for the order, the CSR clicks Add to Order and Proceed,&nbsp;which advances the user to the next order creation screen. The&nbsp;<a href=\"https://omni.helpdocsonline.com/search-items\">Search Items</a>&nbsp;guide includes additional details about the Add and Checkout buttons.</p>\r\n\r\n<p>Once the CSR clicks on Add and&nbsp;Checkout, they are asked if they would like to search for an existing customer to link to this order. If so, they may search for the customer (using name, email, or phone number) or create a new customer in the system.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>:&nbsp;Out of the box, if the CustomerIdGenerationStrategy is based on an emailId, entering an email is mandatory. Otherwise, the system does not mandate customer email.</div>\r\n\r\n<p>On creation of order it will navigate to order details screen where user can select address for shipping, mode of payment and confirm the changes done.&nbsp;Once the CSR confirms the order by clicking on the 'Place Order' button, the system tries to authorize the payment, and later&nbsp;he is presented with a popup to&nbsp;register the customer.</p>\r\n\r\n<p>After registering the&nbsp;customer, the user is taken to the customer&nbsp;<a hqid=\"2778910\" href=\"/overview$Cust Transaction list\">transaction list</a>&nbsp;page.</p>\r\n\r\n<p>Now that CSR has built the order with the appropriate items, CSR may ask if the customer wishes to add a gift message, gift wrapping, or any other Value Added Service (VAS) to the line items. Instructions on how to do this can be found in the&nbsp;<a hqid=\"1808451\" href=\"/modify-existing-orders$VAS GUIDE\">VAS guide</a>. Next, the CSR asks the customer for the appropriate shipping address. This may be pre-populated with the default shipping address if the CSR has selected a registered customer which includes a saved default address. If the order line is to be picked up in a store, the CSR confirms with the customer that the correct store is selected. Additional detail on shipping destination selection can be found in the&nbsp;<a href=\"https://omni.helpdocsonline.com/search-items\">Search Items</a>&nbsp;guide. Once a shipping destination has been selected, the CSR may then proceed by clicking the Proceed to Payment&nbsp;button.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: It is not mandatory for all countries to require a state and/or postal codes in their addresses. Base seed data has configuration in place to confirm if&nbsp;postal code and/or state is mandatory for a specific country. The customer service UI is enhanced to dynamically compute validation of address format depending on the address country. If the configuration is not in place for a certain country, base behavior will assume they are both required. This configuration is in country configuration seed data within the organization component.</div>\r\n\r\n<h4><a name=\"tax-exemption-in-contact-center\" id=\"tax-exemption-in-contact-center\"></a>Tax Exemption in Contact Center</h4>\r\n\r\n<p>Users can view, apply, and modify tax exemptions in the Contact Center UIs. Tax exemption can be&nbsp;applied&nbsp;while&nbsp;creating an order. The tax exemption can be&nbsp;modified&nbsp;while editing an order using the raindrop menu or the E icon available on the order.</p>\r\n\r\n<p>When a tax exemption is applied to an order, a blue “E” indicator is displayed in the Order Details section of the Order. This indicator also appears in the Order Status and Transactions List UIs in the&nbsp; Contact center UI's. On editing the order, users can click the blue “E” in the Order Details section to open the pop-up window to edit the Tax Exemption Id and reason code or remove the tax exemption. Whereas on the Order Status and Transaction List UI, users&nbsp;can only view the Tax Exemption details but cannot change the values.</p>\r\n\r\n<p>In the customer engagement UI, the E icon can be seen and modified&nbsp;in the&nbsp;Order Details section of the Order while creating an order or editing an order. It can also be seen on the Order status page - no edits are allowed on the order status page.</p>\r\n\r\n<p>If a customer has a saved Tax Exemption Id on the customer record (customer profile), a red “E” indicator is displayed on the Order Details section for the order. Users can click the red “E” to open a pop-up and copy or apply the tax exemption details to the order. Tax calculations are handled by a third-party tax engine, which determines the eligibility of items and orders and calculates the actual tax. If the user edits the Tax Exemption Id that was copied from the customer profile to the order and wishes to retrieve the original Tax Exemption Id on the customer, the ‘Copy from Customer’ button can be used to repopulate the Tax Exemption Id as stored on the customer's profile.</p>\r\n\r\n<p>Tax exemption can be applied on fulfilled orders. Refer to&nbsp;<a href=\"https://omni.helpdocsonline.com/order-pricing-tax$tax-exemption-after-order-is-fulfilled\">Tax exemption on fulfilled orders </a>for more information.</p>\r\n\r\n<p>Tax exemption details are automatically copied to return and exchange orders. There is no ability to modify tax exemption details on the Return and Exchange Contact Center UIs.</p>\r\n\r\n<p>When a tax exemption is applied, modified, or removed, an entry is created in the Order Timeline UI.</p>\r\n\r\n<h5><a name=\"tax-exemption-configuration\" id=\"tax-exemption-configuration\"></a>Tax Exemption Configuration</h5>\r\n\r\n<p>To enable Tax Exemptions in the Contact Center UI, navigate to Menu &gt; Manage Contact Center Configuration (Call Center) &gt; Contact Center&nbsp;Configuration (Call Center), and then set&nbsp;ApplyTaxExemptions&nbsp;to true. If this feature is not enabled, then the tax exemption indicator, menu entry, and pop-up are not displayed.</p>\r\n\r\n<h3 data-pm-slice=\"1 1 []\"><a name=\"grants-and-configuration\" id=\"grants-and-configuration\"></a>Grants and Configuration</h3>\r\n\r\n<p>Call center config ApplyTaxExemptions enables users to apply and view tax exemptions in the Contact Center and Customer Engagement&nbsp;UI.&nbsp;If disabled, the tax exemption menu option and indicator are not displayed in the Contact Center UI.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><strong>Grants</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Details</strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>customerservice::order::tax-exempt</td>\r\n\t\t\t<td>To enable the tax exemption menu and apply button in the tax exemption pop-up</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<div class=\"tip\">\r\n<p><strong>Note</strong>:</p>\r\n\r\n<ul>\r\n\t<li>Validation of tax exemptions is done outside of Order Management in the tax engine.&nbsp;For example, Vertex. This includes jurisdiction-level validation, as exemptions are generally valid only in one state, county, and so on. For example,&nbsp;if an exemption is valid in Kentucky, and the exemption ID is saved on an order with one line shipping to Kentucky and one line shipping to Tennessee, then Vertex is responsible for calculating the applicable tax for each line. No logic exists in Order Management&nbsp;to validate the exemption ID against the destination jurisdictions.&nbsp;This behaviour is supported only if the order is not invoiced.</li>\r\n\t<li>Exemptions can be applied at order level only and not at line level. The tax engine determines&nbsp;if items are non-exemptible.</li>\r\n</ul>\r\n</div>\r\n\r\n<h4><a name=\"capturing-payment\" id=\"capturing-payment\"></a>Capturing Payment</h4>\r\n\r\n<p>While on the payment screen, the CSR requests that the customer provide payment for the order. The customer can choose to pay with any combination of credit card, gift card, or E-check. The CSR must enter sufficient payment for the Remaining To Pay&nbsp;amount to equal zero before they are able to proceed to the Summary screen. On the Summary screen, the CSR can see a full view of the order including shipping, payment, VAS, and&nbsp;promotions. The CSR validates this information with the customer before clicking the Place Order button.&nbsp;Finally, the CSR clicks the Home icon to return to the home screen to serve the next customer.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: If the total order amount has been paid and the Remaining to Pay=0, the Add Card Info will be disabled provided the&nbsp;<b>Prevent adding new credit card if balance due is zero</b>&nbsp;flag is set to true in the&nbsp;<a href=\"https://omni.helpdocsonline.com/call-center-configuration$prevent-adding-credit-card-post-full-payment\">Call Center Configuration</a>.</div>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Manhattan Active® Omni permits order creation even with expired credit cards. If the payment gateway authorization fails, an exception is triggered, and the system places the order on hold until a valid payment method is provided.</div>\r\n\r\n<p>Refer to the&nbsp;<a href=\"https://omni.helpdocsonline.com/capturing-payment\">Capturing Payment</a>&nbsp;guide for more information on tokenization and integration with payment gateways.</p>\r\n\r\n<h5><a name=\"using-a-saved-payment-method\" id=\"using-a-saved-payment-method\"></a>Using a Saved Payment Method</h5>\r\n\r\n<p>When a saved payment method is used and the card verification value (CVV) is captured in the Contact Center UI, this CVV value is currently not passed to the payment gateway. The CVV is not passed in any API calls, logged in any browser caches, logged in application logs, or saved in the Active Omni database.</p>\r\n\r\n<h3><a name=\"alternate-pickup-person\" id=\"alternate-pickup-person\"></a>Alternate Pickup Person</h3>\r\n\r\n<p data-pm-slice=\"1 1 []\" data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">The Alternate Pickup Person feature allows Contact Center Agents to assign, edit, or delete an alternate pickup person for BOPIS (Buy Online Pickup in Store) or ship-to-store orders within the contact center UI.</p>\r\n\r\n<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">To add an alternate pickup person, the Contact Center Agent clicks on the “Add Alternate Pickup Person” button, which opens a form containing fields for the first name, last name, email (optional), and phone number (optional). After entering the necessary information, the Contact Center Agent can save the details, which will be reflected in the order. Upon saving, the first and last name of the alternate pickup person are displayed prominently, while the email and phone number are shown as tooltips when hovering over the person's name.&nbsp;</p>\r\n\r\n<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">Once an alternate pickup person is added, the Contact Center Agent can edit or delete the information, provided they have the <a hqid=\"2604082\" href=\"/customer-service-ui-resources\">appropriate permissions</a>.&nbsp;</p>\r\n\r\n<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">Only one alternate pickup person can be designated per store. In addition to the edit order screen, where the agent can add and view the alternate pickup person, the alternate pickup person's details are also displayed on the Transaction List page and Order Status page within the Planned and In-Progress shipment sections. Please refer to the configurations&nbsp;section for configuration of the alternate pickup person in contact center.&nbsp;</p>\r\n\r\n<div class=\"info\" data-pm-slice=\"1 3 []\" data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">\r\n<p data-pm-slice=\"1 3 []\" data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">When a store change is made in the contact center UI:</p>\r\n\r\n<ul data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"bulletList\">\r\n\t<li data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"listItem\">\r\n\t<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">If an alternate pickup person is assigned to the current store, they will be removed before the store change is processed.</p>\r\n\t</li>\r\n\t<li data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"listItem\">\r\n\t<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">If the new store already has an alternate pickup person assigned, this person remains unchanged for the items already going to that store. The agent can re-save the alternate pickup person to ensure that items added to the new store also have the same pickup person.</p>\r\n\t</li>\r\n\t<li data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"listItem\">\r\n\t<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">If the new store does not have an alternate pickup person, no alternate pickup person will be assigned to the order.</p>\r\n\t</li>\r\n</ul>\r\n</div>\r\n\r\n<div class=\"tip\" data-pm-slice=\"1 3 []\" data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">\r\n<p data-pm-slice=\"1 3 []\" data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">It is recommended to add the pickup person to the store only after all items for that store have been added.</p>\r\n\r\n<ul data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"bulletList\">\r\n\t<li data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"listItem\">\r\n\t<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">For example, if a store has two releases, and you first add one release and then add the pickup person, followed by adding a second release, there is a possibility that the pickup person might not be updated for the second release.</p>\r\n\t</li>\r\n\t<li data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"listItem\">\r\n\t<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">To avoid this, always add all the items to the store first, and only then add the alternate pickup person.</p>\r\n\t</li>\r\n\t<li data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"listItem\">\r\n\t<p data-prosemirror-content-type=\"node\" data-prosemirror-node-block=\"true\" data-prosemirror-node-name=\"paragraph\">If you add items after assigning the pickup person, and those items belong to a different release, the Contact Center Agent should double-check the alternate pickup person and re-save it to ensure it's correctly associated with the newly added items.</p>\r\n\t</li>\r\n</ul>\r\n</div>\r\n\r\n<h4><a name=\"configurations\" id=\"configurations\"></a>Configurations</h4>\r\n\r\n<p>The below-mentioned mod types in the order configuration should be setup.&nbsp;</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><strong>Sl No.&nbsp;</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Mod Type</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Config</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Restrict From Status</strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>1</td>\r\n\t\t\t<td>OrderLine::OrderLinePickupDetail::Add</td>\r\n\t\t\t<td>Allows adding an alternate pickup person for a pickup at store order line&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;</td>\r\n\t\t\t<td>Order Line status to restrict the modification.</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>If the mod type is not available, the order config has to be synced using the API mentioned below.</p>\r\n\r\n<ul>\r\n\t<li>{{url}}/order/api/order/orderConfig/sync (request body is not required)</li>\r\n\t<li>The Add Pickup Detail mod type will be triggered when a new record is added to orderLinePikckupDetails &nbsp;</li>\r\n\t<li>This mod type can be used to implement any custom logic that is required to be executed when a new&nbsp;record is added to orderLinePikckupDetails &nbsp;</li>\r\n</ul>\r\n\r\n<h3><a name=\"address-verification-services\" id=\"address-verification-services\"></a>Address Verification Services</h3>\r\n\r\n<p>While providing a ship-to address for ship to home orders, Manhattan Active Omni will call the address verification services. The customer service UI uses Cybersource as an out-of-the-box Address Verification Service while capturing the shipping address. The&nbsp;AVS call is supported in the shipping tab of the order capture screen and is not performed in the return/exchange screen flows. Original orders and un-even exchange flows direct the CSR to the shipping tab of the order capture screen call AVS. Refer For more details on UI help for the responses received from AVS, please reference UI help <a hqid=\"1808451\" href=\"/modify-existing-orders$AVS\">here</a>.</p>\r\n\r\n<ul>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note</strong>:&nbsp;For third party AVS integration,&nbsp;the command router on call center or CustomerService:ShippingAddress:UserExit:VerifyAddress user exit&nbsp;can be implemented. In case user exit is implemented, simulator and Cybersouce cannot be used.</div>\r\n\r\n<div class=\"tip\"><strong>Note</strong>:&nbsp;Verifying Billing Address via third-party AVS integration is not provided out of the box and has to be customized if required.</div>\r\n\r\n<h4><a name=\"address-verification-for-imported-orders\" id=\"address-verification-for-imported-orders\"></a>Address Verification for imported orders</h4>\r\n\r\n<p>To ensure accurate shipping information is captured in e-commerce orders, it is advisable to implement the following steps:</p>\r\n\r\n<p>1. Implement Mandatory Field Checks: It is highly recommended to incorporate null checks on the e-commerce website for essential fields such as postal code, city, and address line1.This helps in preventing incomplete or inaccurate addresses from being entered into the application.</p>\r\n\r\n<p>2. In the event that the address entered by a customer is incorrect, <b>AVS (Address Verification System)</b> will recommend the correct address to the customer to proceed with order placement. If the customer does not choose the recommended address and continues with the incorrect address, order line should be held by following either of the below options.</p>\r\n\r\n<ul>\r\n\t<li>Option 1: Before pushing order save to base queue, add it in a custom queue. Then, invoke the below API</li>\r\n</ul>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<a href=\"https://%3c%3chost%3e%3e/customerengagementfacade/api/customerengagementfacade/ds/address/verifyAddress\">https://&lt;&lt;host&gt;&gt;/customerengagementfacade/api/customerengagementfacade/ds/address/verifyAddress</a></p>\r\n\r\n<ul>\r\n\t<li>Option 2: Alternatively, directly web service call can be made to perform address verification. Based on the response received from the AVS, if the address is not successfully verified, the order line can be placed on hold. Then push this order save to base queue, order lines which are on hold will not be processed further from allocation / release.</li>\r\n</ul>\r\n\r\n<h3><a name=\"capturing-notes\" id=\"capturing-notes\"></a>Capturing Notes</h3>\r\n\r\n<p>CSR can capture instruction or communication notes across the order or order line while creating or editing an order.&nbsp;The text box will expand to display the amount of text inside to allow for better visibility.&nbsp; Adding or editing&nbsp;order header or order line notes is managed by grants. See the&nbsp;<a href=\"https://omni.helpdocsonline.com/customer-service-ui-resources\">UI Resources</a>&nbsp;page.&nbsp;</p>\r\n\r\n<p>The order notes can be added or edited across the order header or order line level from various screens, such as:&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>Order Status&nbsp;</li>\r\n\t<li>Order Creation</li>\r\n\t<li>Order Edit&nbsp;</li>\r\n\t<li>Return order creation&nbsp;</li>\r\n\t<li>Return/Exchange order status&nbsp;&nbsp;</li>\r\n</ul>\r\n\r\n<p>Refer to the <a href=\"https://omni.helpdocsonline.com/addnotes\">Add Notes</a> section for detailed steps on how to add/edit notes for an order/order line.</p>\r\n\r\n<div class=\"tip\"><strong>Note:&nbsp;</strong>When a user wants to add a new note to an order that currently has no existing notes, clicking on the notes icon will open the order notes pop-up, providing a blank row for the user to enter the note and select the note type. If the order or order line already has existing notes, clicking the notes icon will allow the user to open and edit any of those notes. In this case, an empty row will not be automatically provided; the user will need to click the \"+\" icon to add a new note to an order or order line with existing notes.</div>\r\n\r\n<h4><a name=\"note-type-note-nbsp\" id=\"note-type-note-nbsp\"></a>Note Type & Note&nbsp;</h4>\r\n\r\n<p>Note types are used to categorize order notes. Each note type can be in one of two categories: Instruction or Customer Communication. Instructions should be used for any notes that capture fulfillment or delivery instructions. Notes of category 'Instruction' are passed on the release outbound sent to fulfillment systems, but cannot be updated after quantities have been released for fulfillment.</p>\r\n\r\n<p>Customer Communication notes should be used&nbsp;for other types of notes that are informational for CSRs or users who are viewing order history. Note types are configured in the&nbsp;<a hqid=\"1835286\" href=\"/order-orchestration\">Note Types UI</a>. Notes in the category 'Communication' can be updated after quantities have been released to fulfillment systems.</p>\r\n\r\n<h3><a name=\"opt-in-opt-out-of-transactional-sms-in-the-contact-center-ui\" id=\"opt-in-opt-out-of-transactional-sms-in-the-contact-center-ui\"></a>Opt in/Opt out of transactional SMS in the Contact Center UI</h3>\r\n\r\n<p data-renderer-start-pos=\"3\">This feature empowers agents to manage transactional SMS notification preferences for both registered and unregistered customers within the Call Center application, providing flexibility to opt in or out of transactional SMS notifications based on customer preferences.</p>\r\n\r\n<p data-renderer-start-pos=\"260\">The&nbsp; \"Opt-In\" section is available under the Preferences tab in the customer profile. Agents can enable or disable SMS notifications for registered customers using a checkbox. This preference automatically applies to all future orders placed by the customer.</p>\r\n\r\n<p data-renderer-start-pos=\"528\">Additionally, the SMS opt-in/out option is available on the customer details pop-up during order placement for both registered and unregistered customers. For registered customers, the default status reflects the opt-in setting from the customer profile. For unregistered customers, this option is disabled by default but can be enabled during the order process.</p>\r\n\r\n<p data-renderer-start-pos=\"892\">Unregistered customers can similarly modify their preferences through the register customer pop up while confirming the order. Registered customers can similarly modify their preferences through the update customer pop-up after placing an order.</p>\r\n\r\n<p data-renderer-start-pos=\"1139\">The \"<a href=\"https://omni.helpdocsonline.com/call-centerconfiguration$opt-in-opt-out-of-sms-in-the-contact-center-ui\">Communications Opt-In</a>\"&nbsp;setting in the Call Center configuration determines the visibility of the SMS opt-in option. When enabled, the SMS opt-in option appears on relevant screens within the Call Center UI. If disabled, the option is hidden from view.</p>\r\n\r\n<h3><a name=\"capturing-phone-number\" id=\"capturing-phone-number\"></a><a id=\"order creation - capturing phone number\" name=\"order creation - capturing phone number\"></a>Capturing Phone Number</h3>\r\n\r\n<p>When adding item(s) to the cart, the contact center agent has the option to select a registered customer versus a new customer. Upon selecting a registered customer, the saved phone number will populate.&nbsp;When a new customer is created, a phone number can be provided, but it is not required to proceed to order creation.</p>\r\n\r\n<p>Phone numbers can be required for new customers if a customer ID generation strategy is set to phone. If a phone number is required and the contact center agent does not provide an error, it will populate \"You must enter a value\".</p>\r\n\r\n<h4><a name=\"capture-phone-number-country-code\" id=\"capture-phone-number-country-code\"></a><a id=\"capture-phone-number-country-code\" name=\"capture-phone-number-country-code\"></a><a id=\"CS Process International Phone Codes\" name=\"CS Process International Phone Codes\"></a>Capture Phone Number Country Code</h4>\r\n\r\n<p>For international implementations, contact center agents can select a country code (prefix) for&nbsp;phone numbers&nbsp;in&nbsp;the contact center. In this feature, agents can select a country code from a drop-down&nbsp;when adding or editing phone numbers.&nbsp;This feature can optionally be enabled by following the&nbsp;steps&nbsp;<a hqid=\"1805028\" href=\"/call-centerconfiguration\">here</a>. If this feature is enabled, the country code field is not required to be captured.</p>\r\n\r\n<h5><a name=\"country-code-capture\" id=\"country-code-capture\"></a><a id=\"country-code-capture\" name=\"country-code-capture\"></a><a id=\"international-phone-codes-throughout-order-creation\" name=\"international-phone-codes-throughout-order-creation\"></a>Country Code Capture</h5>\r\n\r\n<p>With this feature, phone numbers in the contact center are entered with a country code separate from your phone number. However, phone numbers are always saved in the database in e164 format, which concatenates the country code and phone number into a single field. For example, if an agent enters country code \"1\" and phone \"555-222-4545\" in the contact center UI, the customer's phone is saved as \"+15552224545\" in the database and on all outbound interfaces such as Publish Order, Sales Posting, etc. Once a phone number is saved, the UI displays it in e164 format.</p>\r\n\r\n<p>The country code (prefix)&nbsp;defaults to the default country configured in Call Center Configuration. Agents can use the pre-populated prefix,&nbsp;select a new prefix, or nullify the&nbsp;prefix. Prefix&nbsp;is not required when this feature is enabled and&nbsp;agents can continue providing a full phone number in the phone number field.</p>\r\n\r\n<h5><a name=\"suggested-phone-number-formats-nbsp-by-country\" id=\"suggested-phone-number-formats-nbsp-by-country\"></a>Suggested Phone Number Formats&nbsp;by Country</h5>\r\n\r\n<p>If an agent selects a country code, a suggested phone number format is displayed.&nbsp;If the phone number provided does not follow the suggested format (it has fewer or more characters&nbsp;than the international prefix standard), a warning is displayed. This error is not a hard-stop and&nbsp;agents can continue with the number as-is.</p>\r\n\r\n<p>There are 20 country phone number formats that are provided out of the box. To add new country formats or modify the existing&nbsp;formats, update the country configuration entity. API:&nbsp;api/organization/countryConfiguration/save&nbsp;</p>\r\n\r\n<h5><a name=\"country-code-edits\" id=\"country-code-edits\"></a><a id=\"country-code-edits\" name=\"country-code-edits\"></a><a id=\"international-phone-codes-throughout-order-edit\" name=\"international-phone-codes-throughout-order-edit\"></a>Country Code Edits</h5>\r\n\r\n<p>When this feature is enabled and a&nbsp;phone number is edited, the application displays the phone number in edit mode in the UI&nbsp;with the country code separate from&nbsp;phone number. Because the phone number is saved in e164 format in the database, the Get Order API has logic to separate the concatenated phone number&nbsp;into two values:&nbsp;country code and&nbsp;phone number.</p>\r\n\r\n<p>The logic to separate the customer phone value on the order header into country code and phone number is as follows:</p>\r\n\r\n<ul>\r\n\t<li>If the phone code for the&nbsp;country&nbsp;of&nbsp;the order header ship-to&nbsp;address&nbsp;matches the&nbsp;first digit(s) of the phone value, then the first digit(s) are separated into the country code field in the response.</li>\r\n\t<li>If there is no address or the code for that country&nbsp;does not match the first digits in the phone number,&nbsp;then&nbsp;the system uses the country from the organization's address (address type: headquarters).&nbsp;If the country phone code for this country matches the first digit(s) of the phone value, then the first digit(s) are separated into the country code field in the response.</li>\r\n\t<li>If there is no match based on the above logic, the country code is null and the phone number remains as-is. Agents can edit the phone number and provide&nbsp;a country code if necessary.</li>\r\n</ul>\r\n\r\n<p>For example:</p>\r\n\r\n<ul>\r\n\t<li>An order from an organization with their headquarters in London&nbsp;has header ship-to address country 'France' and the customer phone is +33912434543, the system separates out into country code +33 (French phone code) and phone number&nbsp;9 12 43 45 43 values because the first digit(s) matched the order header ship-to address country.</li>\r\n\t<li>An order from an organization with their&nbsp;headquarters in London has header ship-to address the country 'France' and the phone is +449124345433, the system separates out into country code +44&nbsp;(UK phone code) and phone number&nbsp;91 2434 5433. This is because there was no match with the header address, but the first digit(s) matched the organization's address (address type: headquarters).&nbsp;</li>\r\n\t<li>An order in an organization with their&nbsp;headquarters in London has header ship-to address the country 'France' and the phone is +15559099898, the system does not separate the values and country code is null&nbsp;and phone number stays as&nbsp; is:&nbsp;+15559099898. This is because there was no match with the header address or with the organization's address (address type: headquarters).&nbsp;</li>\r\n</ul>\r\n\r\n<p>The logic for separating the ship-to and bill-to phone numbers&nbsp;into country codes and phone numbers is as follows:</p>\r\n\r\n<ul>\r\n\t<li>If the phone code for the&nbsp;country&nbsp;of&nbsp;the ship-to/bill-to address being edited matches the&nbsp;first digit(s) of the phone value, then the first digit(s) is separated into the country code field in the response.</li>\r\n\t<li>If the order header has no address or the code for that country&nbsp;does not match the first digits in the phone number provided,&nbsp;then&nbsp;the system uses the country from the organization's address (address type: headquarters). If the country phone code for this country matches the first digit(s) of the phone value, then the first digit(s)'s separated into the country code field in the response.</li>\r\n\t<li>If there is no match based on the above logic, the country code is null and phone number remains as-is. Agents can edit the phone number and provide&nbsp;a country code if necessary.</li>\r\n</ul>\r\n\r\n<h5><a name=\"including-nbsp-phone-code-and-phone-in-outbound-messages\" id=\"including-nbsp-phone-code-and-phone-in-outbound-messages\"></a><a id=\"including-nbsp-phone-code-and-phone-in-outbound-messages\" name=\"including-nbsp-phone-code-and-phone-in-outbound-messages\"></a>Including&nbsp;Phone Code and Phone in Outbound Messages</h5>\r\n\r\n<p>If external or downstream systems require the separate values for&nbsp;phone code and phone number as separate fields, they can be added to the response template. These fields are not supported&nbsp;for&nbsp;order import.</p>\r\n\r\n<div class=\"tip\">\r\n<p><strong>Note:</strong></p>\r\n\r\n<p>API to update response template: /order/api/fwcore/responseTemplate/save</p>\r\n\r\n<p>Fields to add: phoneCountryId, phoneWithoutPrefix, customerPhoneCountryId, customerPhoneWithoutPrefix</p>\r\n</div>\r\n\r\n<h3><a name=\"shipping-restrictions\" id=\"shipping-restrictions\"></a>Shipping Restrictions</h3>\r\n\r\n<p>Shipping restrictions can be configured within an organization to let the contact center agents know of existing restrictions within an order. Refer to the <a href=\"http://omni.helpdocsonline.com/order-orchestration-configuration$Shipping Restrictions Config\">order orchestration guide</a>&nbsp;for an overview and configuration steps.Once shipping restrictions are configured, there is&nbsp;<a href=\"https://omni.helpdocsonline.com/call-centerconfiguration$evaluate-shipping-restrictions\">configuration&nbsp;</a>to enable this feature within the contact center configuration. User must enable call shipping restrictions configuration within call center configuration,&nbsp;once enabled these configured&nbsp;restrictions will populate as an error message for the contact center agent to acknowledge any restrictions on the order prior to order confirmation.</p>\r\n\r\n<div class=\"tip\">For restricting shipping to certain countries, please refer to <strong><a href=\"/order-creation$ship-to country restrictions\">Ship-To Country Restrictions</a>&nbsp;</strong>as an alternative to configuring shipping restrictions.</div>\r\n\r\n<p><strong>Customer Service Restrictions Error Screen</strong></p>\r\n\r\n<p>When enabled, shipping restrictions will be called throughout order creation, order edit, and exchange order creation scenarios. When a contact center agent updates ship-to addresses or shipping methods on a&nbsp;ship to address the order line, the contact center application will call the shipping restrictions API and provide the restrictions as an error message.&nbsp;</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: The shipping restrictions call is made after the address verification (AVS) call is complete. If AVS is disabled, then the shipping restrictions call will be made upon clicking \"update\" or \"save\" on the address entity.</div>\r\n\r\n<p>This error screen will populate the shipping restrictions error message per order line by grouping the error messages by item ID. If there is a multi-line order with the same item ID, the error message&nbsp;will show the order lines separately to the contact center agent.&nbsp;This error screen is a soft-check and does not stop the contact center agent from proceeding with the order. The contact center agent can acknowledge the error screen by clicking \"ok\" and provide updates on the order lines' ship to address or shipping method if needed.</p>\r\n\r\n<div class=\"warning\">\r\n<p>• The existing 'Evaluate Shipping Restrictions' option in the Call center config mentioned will soon be depreciated. To evaluate shipping restriction as a warning/ soft check (no change in order line status) or hard check (order line goes on hold if there is a shipping restriction). Refer to&nbsp;<a href=\"https://omni.helpdocsonline.com/shipping-restriction\">Shipping Restrictions</a>.&nbsp;</p>\r\n\r\n<p>• Until the 'Evaluate Shipping Restrictions' option in the Call center config is depreciated. Users will see two pop-ups with the shipping restrictions info if the call center config and Order config shipping restrictions are both turned on at the same time. To avoid seeing 2 pop-ups for the same functionality,&nbsp;uncheck the call center config and use only the Shipping restrictions config to set shipping restrictions.</p>\r\n</div>\r\n\r\n<div class=\"warning\">\r\n<p>• The 'Is Restricted'' flag can be used to add a shipping restriction as a hard check and put the order line on hold if it has a shipping restriction.&nbsp;</p>\r\n\r\n<p>• For exchange orders, when there is a shipping restriction on the exchange item - the shipping restriction pop-up will show up in the exchange order screen. To correct the shipping restriction, the user can 'Proceed to review' and edit the address in the following page or cancel the exchange line in the exchange order and create a new line without shipping restrictions. If the 'is restricted' flag is turned on for sipping restrictions, then even the exchange order lines that have shipping restrictions will automatically go on hold and will be auto resolved when the restrictions are corrected.</p>\r\n</div>\r\n\r\n<p><strong><a id=\"ship-to country restrictions\" name=\"ship-to country restrictions\"></a>Ship-To Country Restrictions</strong></p>\r\n\r\n<p>Retailers can configure&nbsp;the countries that are displayed in the shipping address&nbsp;drop-down list. The country list is defined by the Country Configuration. When the country has the \"Shipping Restricted\" attribute marked as true, the country is not displayed in the drop-down.&nbsp;&nbsp;</p>\r\n\r\n<h3><a name=\"delete-order-line\" id=\"delete-order-line\"></a>Delete Order Line</h3>\r\n\r\n<p>CSRs can delete a line once added, as long as the order is not confirmed or the line is not released.</p>\r\n\r\n<h3><a name=\"configuration\" id=\"configuration\"></a>Configuration</h3>\r\n\r\n<h4><a name=\"cybersource-nbsp-for-credit-card-payments\" id=\"cybersource-nbsp-for-credit-card-payments\"></a><a id=\"how-to-configure-cybersource-for-credit-card-payment\" name=\"how-to-configure-cybersource-for-credit-card-payment\"></a>CyberSource&nbsp;For Credit Card Payments</h4>\r\n\r\n<ul>\r\n\t<li>Confirm Cybersource is configured properly, for payment gateway integration information please see guide <a hqid=\"2617714\" href=\"/payment-gateway-integration$Payment Gateway Configuration\">here</a>.</li>\r\n\t<li>In the payment rule for the given payment type, ensure the gateway is configured as 'Cybersource'\r\n\t<ul>\r\n\t\t<li>Search for 'Payment Rule' in the omnifacade menu search, select a payment rule, click on View, click on 'Payment Rule Gateway' tab and select Cybersource and save</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<h4><a name=\"address-verification-service-avs\" id=\"address-verification-service-avs\"></a><a id=\"how-to-configure-avs\" name=\"how-to-configure-avs\"></a>Address Verification Service (AVS)</h4>\r\n\r\n<p>Address verification service used in the call center application can be configured by the service team.&nbsp;</p>\r\n\r\n<div class=\"tip\">Service team, please note that AVS should be configured for the&nbsp;key&nbsp;<em>avs.CYBERSOURCE</em>&nbsp;under the following location:&nbsp;<em>http://&lt;&lt;kvstorehost&gt;&gt;/../kv/config/com-manh-cp-customerengagementfacade/.&nbsp;</em>AVS can be configured specifically to an organization. An example below shows the first one as common and the second one is specific to an organization.</div>\r\n\r\n<div class=\"computer_code\">#avs gateway configuration<br>\r\navs.CYBERSOURCE={\\<br>\r\n&nbsp;&nbsp;\"endpoint\": \"&lt;&lt;get from address verification service&gt;&gt;\",\\<br>\r\n&nbsp;&nbsp;\"merchantID\":&nbsp;\"&lt;&lt;get from address verification service&gt;&gt;\",\\<br>\r\n&nbsp;&nbsp;\"merchantReferenceCode\":&nbsp;\"&lt;&lt;get from address verification service&gt;&gt;\",\\<br>\r\n&nbsp;&nbsp;\"merchantPassword\":&nbsp;\"&lt;&lt;get from address verification service&gt;&gt;\",\\<br>\r\n\\&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br>\r\n\"org:dummyorg\"&nbsp;{\\<br>\r\n&nbsp;&nbsp;\"endpoint\": \"&lt;&lt;get from address verification service&gt;&gt;\",\\<br>\r\n&nbsp;&nbsp;\"merchantID\":&nbsp;\"&lt;&lt;get from address verification service&gt;&gt;\",\\<br>\r\n&nbsp;&nbsp;\"merchantReferenceCode\":&nbsp;\"&lt;&lt;get from address verification service&gt;&gt;\",\\<br>\r\n&nbsp;&nbsp;\"merchantPassword\":&nbsp;\"&lt;&lt;get from address verification service&gt;&gt;\"\\<br>\r\n} \\<br>\r\n}</div>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Cybersource recommends using a unique value such as an order ID for the <em data-end=\"185\" data-start=\"160\">Merchant Reference Code</em> to support effective tracking and reporting. By default, Base uses a static value from the configuration. If a unique identifier is needed, as per Cybersource's recommendation, the AVS call can be intercepted via the command router to inject a dynamic value into the <em data-end=\"478\" data-start=\"453\">Merchant Reference Code</em>. This could be the order ID or any other unique identifier associated with the specific transaction.</div>\r\n\r\n<h4><a name=\"payment-types-displayed-in-contact-center\" id=\"payment-types-displayed-in-contact-center\"></a><a id=\"how-to-configure-what-payment-type-to-capture-in-call-center\" name=\"how-to-configure-what-payment-type-to-capture-in-call-center\"></a>Payment Types Displayed in Contact Center</h4>\r\n\r\n<p>The&nbsp;'Payment Capture Config' is required to enable the call center application to display a form for a particular payment type to allow the CSR to capture the information.</p>\r\n\r\n<p>Set the flag for 'Assisted Selling' as true for the payment type that needs to be&nbsp;captured in the UI.</p>\r\n\r\n<p>To access 'Payment Capture Config', search for payment capture configuration in omnifacade menu.</p>\r\n\r\n<div class=\"tip\">\r\n<p><strong>Note</strong>:&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>This configuration is to display the form to capture the payment. The payment that has already been bridged in from a host will automatically show up in Use Payments section and needs no extra configuration.</li>\r\n\t<li>Out of the box, Credit Card, Gift Card, E-Check, Pay by link, payment methods have assisted selling as true</li>\r\n\t<li>If enabled for custom payment type, UI shows a standard form, which can be customized to capture more information</li>\r\n\t<li>If disabled for all payment types, payment will not be required to process orders in the call center and payment status will show as not applicable.&nbsp;</li>\r\n</ul>\r\n</div>\r\n\r\n<h3 data-renderer-start-pos=\"1298\"><a name=\"implementation-flavor\" id=\"implementation-flavor\"></a>Implementation Flavor</h3>\r\n\r\n<h4><a name=\"accommodate-different-address-format-in-call-center\" id=\"accommodate-different-address-format-in-call-center\"></a>Accommodate different address format in call center</h4>\r\n\r\n<p>Currently, call center offers certain address format, but some customers may need to add different address format. To do this, perform the following steps:</p>\r\n\r\n<ul data-indent-level=\"1\">\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"2243\">Enable the developer mode.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"2273\">If you want to configure some custom fields like Province, Neighborhood, District, and so on&nbsp;instead of base fields like city, state and zip code;</p>\r\n\r\n\t<ul>\r\n\t\t<li>\r\n\t\t<p data-renderer-start-pos=\"2273\">Check if base component extension exists. If yes, hide the extension.</p>\r\n\t\t</li>\r\n\t\t<li>\r\n\t\t<p data-renderer-start-pos=\"2273\">Check if suitable field based extensions exist. If yes, then configure fields based on your requirement.</p>\r\n\t\t</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p data-renderer-start-pos=\"2273\">Refer&nbsp;<a href=\"https://omni.helpdocsonline.com/proactive/uiextensibility/contactcenter\">Contact Center UI Extensibility</a> for more information on UI extension.</p>\r\n\r\n<h4><a name=\"how-to-invoke-custom-message-when-switching-tabs\" id=\"how-to-invoke-custom-message-when-switching-tabs\"></a>How to invoke custom message when switching tabs</h4>\r\n\r\n<p>Example: To perform validation on switching tabs from shipping to payment&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>Add the sample iframe in the shipping tab and check for the available event MAExtension.EditOrderScreen.events.onPaymentTabSelected(editOrderPsoFunctionOnpaymentTabSelected);</li>\r\n\t<li>Acknowledge the available action MAExtension.EditOrderScreen.actions.ackProceedToPayment and perform validation on switch of tab.</li>\r\n</ul>\r\n\r\n<h4><a name=\"how-does-system-generate-order-numbers\" id=\"how-does-system-generate-order-numbers\"></a>How does system generate order numbers</h4>\r\n\r\n<ul>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"14\">Currently, for Contact Center orders by default, the OrderId will be CC+5 digits (randomly generated number without any logic)</p>\r\n\t</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"100\">After the maximum digit (99999), the order ID will be updated to 6 digits (100000).</p>\r\n\t</li>\r\n</ul>\r\n\r\n<h4 data-renderer-start-pos=\"100\"><a name=\"how-to-search-for-orders-using-custom-search-fields\" id=\"how-to-search-for-orders-using-custom-search-fields\"></a>How to search for orders using custom search fields</h4>\r\n\r\n<p>To search for orders using custom search fields&nbsp;like Postal Code, Street Address, and ItemId present on the order/order line, perfrom the following steps:</p>\r\n\r\n<ol>\r\n\t<li>Implement an iframe for the search field on CS home screen.</li>\r\n\t<li>Invoke the below API at the backend and form the query condition based on user input value.</li>\r\n</ol>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: You should have logic that determines whether the entered value is a postal code, state/country, or address1. Create a query parameter based on that.</div>\r\n\r\n<div class=\"computer_code\">{{url}}/order/api/order/shipToAddress/search</div>\r\n\r\n<div class=\"computer_code\">{<br>\r\n\"Query\": \"Address.State= 'CA'\",<br>\r\n\"Size\": 365<br>\r\n}</div>\r\n\r\n<ol start=\"3\">\r\n\t<li>Display list of orders on the UI based on this API response.</li>\r\n</ol>\r\n\r\n<p data-renderer-start-pos=\"100\">&nbsp;</p>\r\n\r\n<h3 data-renderer-start-pos=\"1298\"><a name=\"related-articles\" id=\"related-articles\"></a>Related Articles</h3>\r\n\r\n<div class=\"info\"></div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 56016,
  "scraped_at": "2025-08-09T21:54:44.197162",
  "content_clean": "Home ››Manhattan Active® Omni››Order Management››Process & Configuration Guides››Customer Service››Item Search ››Order Creation Order Creation Order CreationCreate Order Select Available Delivery OptionsSelect a Shipping MethodTax Exemption in Contact CenterTax Exemption ConfigurationGrants and ConfigurationCapturing PaymentUsing a Saved Payment MethodAlternate Pickup PersonConfigurationsAddress Verification ServicesAddress Verification for imported ordersCapturing NotesNote Type & Note Opt in/Opt out of transactional SMS in the Contact Center UICapturing Phone NumberCapture Phone Number Country CodeCountry Code CaptureSuggested Phone Number Formats by CountryCountry Code EditsIncluding Phone Code and Phone in Outbound MessagesShipping RestrictionsDelete Order LineConfigurationCyberSource For Credit Card PaymentsAddress Verification Service (AVS)Payment Types Displayed in Contact CenterImplementation FlavorAccommodate different address format in call centerHow to invoke custom message when switching tabsHow does system generate order numbersHow to search for orders using custom search fieldsRelated Articles Create Order Another common scenario that a CSR faces is a request to place a new order for a customer over the phone. In this case, the CSR first asks the customer which item(s) they are interested in purchasing. The customer describes the name of the item, and possibly some additional qualifying attributes such as style, color, size, and so on. The CSR uses the item search to search for the item. The CSR uses the Item List page to view the item search results as indicated in the Search Items guide. Refer to UI Resources for the required grants to create an order. Once the CSR has located the item that the customer wishes to purchase, the CSR will ask the customer for the size, color, and quantity of the item to see if the item is available. The CSR may also view any active promotions or discounts on this screen, such as “Buy One Get One Free” or “Buy One Get Another Free”. Typically, CSRs will tell the customer that they qualify for a promotion to let the customer feel that they are getting the best price on their purchase. Additional information about inventory availability, promotions, and discounts is available in the Search Items guide. The CSR should note that the call center screen will pull the lowest price (ProductPrice) and reflect that as the price for the style, but the individual item price will be reflected once the CSR selects that specific item. Select Available Delivery Options Next, the CSR asks the customer the delivery options if they would like to have the item shipped to their home, or if they would prefer to pick it up in a store. Ship To Address -If the customer selects a ship to Home, then the CSR will enter shipping address details later in the process Pick Up at Store - Based on the Delivery Method Sub Type, the selected item is picked up by the customer from the selected/preferred store or it is delivered at the store curbside. Select an appropriate Delivery Method Sub Type from the following options: curbside and in-store If the customer prefers to pick up the item in a store, the CSR uses the Store Locator to find a store close to the customer’s location. The Store Locator screen allows the CSR to view a map of stores within a radius (i.e. 10 miles, 20 miles, etc.) of a city or postal code and also indicates which stores allow for item pickup or for ship to store. The Store Locator lists all store locations (not only those that support pick-ups or shipping), but the Pick Up and Ship To buttons are only enabled for stores that support pick-up in store or ship to store. The Store Locator will also provide the store price saved with the item selected. If the store has a lower price due to markdowns or regional sales, then the CSR will see this price on the locator. This price is shown for visibility for the CSR but cannot be used on the order. Ship to Store - Ship the selected item to a nearby store to be picked up by the customer. Click 'Select' to select the store that has the item in stock. See the topic Store Locator for more information. Select a Shipping Method Finally, the CSR asks the customer for a preferred shipping speed and selects a shipping method.The shipping rates for each item are configured by the system based on different attributes, such as weight, volume, and value of the item. To select the shipping method for the selected item, perform the following steps: On the 'Item Search' page, search and select an item. After a delivery option is selected for the item, the shipping methods are enabled along with the estimated delivery date. Select the necessary shipping method. Shipping methods can be filtered using the country code and postal code fields. The country drop-down is populated from the countries configured in the Country Configuration UI, where \"Shipping Restricted\" is set to false. By entering the country and postal code and clicking the arrow button, the list of eligible shipping methods will be filtered to those that ship to that location. To re-set the shipping methods, the user can click the 'X'. Note: For filtering shipping methods using country code and the postal code, the system uses calculateDeliveryDates API. To enable calculateDeliveryDates API calls, configure \"Promising Configuration Used For Item Delivery Date Calculation\" with the appropriate promising configuration ID. Refer to Display Delivery Dates on Item Details for more information. Once all of these selections have been made, if the customer wishes to add more items to the order, the CSR clicks the Add to Cart button which allows them to remain on the item search screen while they build a shopping cart. If the customer confirms that this is the only item for the order, the CSR clicks Add to Order and Proceed, which advances the user to the next order creation screen. The Search Items guide includes additional details about the Add and Checkout buttons. Once the CSR clicks on Add and Checkout, they are asked if they would like to search for an existing customer to link to this order. If so, they may search for the customer (using name, email, or phone number) or create a new customer in the system. Note: Out of the box, if the CustomerIdGenerationStrategy is based on an emailId, entering an email is mandatory. Otherwise, the system does not mandate customer email. On creation of order it will navigate to order details screen where user can select address for shipping, mode of payment and confirm the changes done. Once the CSR confirms the order by clicking on the 'Place Order' button, the system tries to authorize the payment, and later he is presented with a popup to register the customer. After registering the customer, the user is taken to the customer transaction list page. Now that CSR has built the order with the appropriate items, CSR may ask if the customer wishes to add a gift message, gift wrapping, or any other Value Added Service (VAS) to the line items. Instructions on how to do this can be found in the VAS guide. Next, the CSR asks the customer for the appropriate shipping address. This may be pre-populated with the default shipping address if the CSR has selected a registered customer which includes a saved default address. If the order line is to be picked up in a store, the CSR confirms with the customer that the correct store is selected. Additional detail on shipping destination selection can be found in the Search Items guide. Once a shipping destination has been selected, the CSR may then proceed by clicking the Proceed to Payment button. Note: It is not mandatory for all countries to require a state and/or postal codes in their addresses. Base seed data has configuration in place to confirm if postal code and/or state is mandatory for a specific country. The customer service UI is enhanced to dynamically compute validation of address format depending on the address country. If the configuration is not in place for a certain country, base behavior will assume they are both required. This configuration is in country configuration seed data within the organization component. Tax Exemption in Contact Center Users can view, apply, and modify tax exemptions in the Contact Center UIs. Tax exemption can be applied while creating an order. The tax exemption can be modified while editing an order using the raindrop menu or the E icon available on the order. When a tax exemption is applied to an order, a blue “E” indicator is displayed in the Order Details section of the Order. This indicator also appears in the Order Status and Transactions List UIs in the  Contact center UI's. On editing the order, users can click the blue “E” in the Order Details section to open the pop-up window to edit the Tax Exemption Id and reason code or remove the tax exemption. Whereas on the Order Status and Transaction List UI, users can only view the Tax Exemption details but cannot change the values. In the customer engagement UI, the E icon can be seen and modified in the Order Details section of the Order while creating an order or editing an order. It can also be seen on the Order status page - no edits are allowed on the order status page. If a customer has a saved Tax Exemption Id on the customer record (customer profile), a red “E” indicator is displayed on the Order Details section for the order. Users can click the red “E” to open a pop-up and copy or apply the tax exemption details to the order. Tax calculations are handled by a third-party tax engine, which determines the eligibility of items and orders and calculates the actual tax. If the user edits the Tax Exemption Id that was copied from the customer profile to the order and wishes to retrieve the original Tax Exemption Id on the customer, the ‘Copy from Customer’ button can be used to repopulate the Tax Exemption Id as stored on the customer's profile. Tax exemption can be applied on fulfilled orders. Refer to Tax exemption on fulfilled orders for more information. Tax exemption details are automatically copied to return and exchange orders. There is no ability to modify tax exemption details on the Return and Exchange Contact Center UIs. When a tax exemption is applied, modified, or removed, an entry is created in the Order Timeline UI. Tax Exemption Configuration To enable Tax Exemptions in the Contact Center UI, navigate to Menu > Manage Contact Center Configuration (Call Center) > Contact Center Configuration (Call Center), and then set ApplyTaxExemptions to true. If this feature is not enabled, then the tax exemption indicator, menu entry, and pop-up are not displayed. Grants and Configuration Call center config ApplyTaxExemptions enables users to apply and view tax exemptions in the Contact Center and Customer Engagement UI. If disabled, the tax exemption menu option and indicator are not displayed in the Contact Center UI. Grants Details customerservice::order::tax-exempt To enable the tax exemption menu and apply button in the tax exemption pop-up Note: Validation of tax exemptions is done outside of Order Management in the tax engine. For example, Vertex. This includes jurisdiction-level validation, as exemptions are generally valid only in one state, county, and so on. For example, if an exemption is valid in Kentucky, and the exemption ID is saved on an order with one line shipping to Kentucky and one line shipping to Tennessee, then Vertex is responsible for calculating the applicable tax for each line. No logic exists in Order Management to validate the exemption ID against the destination jurisdictions. This behaviour is supported only if the order is not invoiced. Exemptions can be applied at order level only and not at line level. The tax engine determines if items are non-exemptible. Capturing Payment While on the payment screen, the CSR requests that the customer provide payment for the order. The customer can choose to pay with any combination of credit card, gift card, or E-check. The CSR must enter sufficient payment for the Remaining To Pay amount to equal zero before they are able to proceed to the Summary screen. On the Summary screen, the CSR can see a full view of the order including shipping, payment, VAS, and promotions. The CSR validates this information with the customer before clicking the Place Order button. Finally, the CSR clicks the Home icon to return to the home screen to serve the next customer. Note: If the total order amount has been paid and the Remaining to Pay=0, the Add Card Info will be disabled provided the Prevent adding new credit card if balance due is zero flag is set to true in the Call Center Configuration. Note: Manhattan Active® Omni permits order creation even with expired credit cards. If the payment gateway authorization fails, an exception is triggered, and the system places the order on hold until a valid payment method is provided. Refer to the Capturing Payment guide for more information on tokenization and integration with payment gateways. Using a Saved Payment Method When a saved payment method is used and the card verification value (CVV) is captured in the Contact Center UI, this CVV value is currently not passed to the payment gateway. The CVV is not passed in any API calls, logged in any browser caches, logged in application logs, or saved in the Active Omni database. Alternate Pickup Person The Alternate Pickup Person feature allows Contact Center Agents to assign, edit, or delete an alternate pickup person for BOPIS (Buy Online Pickup in Store) or ship-to-store orders within the contact center UI. To add an alternate pickup person, the Contact Center Agent clicks on the “Add Alternate Pickup Person” button, which opens a form containing fields for the first name, last name, email (optional), and phone number (optional). After entering the necessary information, the Contact Center Agent can save the details, which will be reflected in the order. Upon saving, the first and last name of the alternate pickup person are displayed prominently, while the email and phone number are shown as tooltips when hovering over the person's name. Once an alternate pickup person is added, the Contact Center Agent can edit or delete the information, provided they have the appropriate permissions. Only one alternate pickup person can be designated per store. In addition to the edit order screen, where the agent can add and view the alternate pickup person, the alternate pickup person's details are also displayed on the Transaction List page and Order Status page within the Planned and In-Progress shipment sections. Please refer to the configurations section for configuration of the alternate pickup person in contact center. When a store change is made in the contact center UI: If an alternate pickup person is assigned to the current store, they will be removed before the store change is processed. If the new store already has an alternate pickup person assigned, this person remains unchanged for the items already going to that store. The agent can re-save the alternate pickup person to ensure that items added to the new store also have the same pickup person. If the new store does not have an alternate pickup person, no alternate pickup person will be assigned to the order. It is recommended to add the pickup person to the store only after all items for that store have been added. For example, if a store has two releases, and you first add one release and then add the pickup person, followed by adding a second release, there is a possibility that the pickup person might not be updated for the second release. To avoid this, always add all the items to the store first, and only then add the alternate pickup person. If you add items after assigning the pickup person, and those items belong to a different release, the Contact Center Agent should double-check the alternate pickup person and re-save it to ensure it's correctly associated with the newly added items. Configurations The below-mentioned mod types in the order configuration should be setup. Sl No. Mod Type Config Restrict From Status 1 OrderLine::OrderLinePickupDetail::Add Allows adding an alternate pickup person for a pickup at store order line Order Line status to restrict the modification. If the mod type is not available, the order config has to be synced using the API mentioned below. {{url}}/order/api/order/orderConfig/sync (request body is not required) The Add Pickup Detail mod type will be triggered when a new record is added to orderLinePikckupDetails This mod type can be used to implement any custom logic that is required to be executed when a new record is added to orderLinePikckupDetails Address Verification Services While providing a ship-to address for ship to home orders, Manhattan Active Omni will call the address verification services. The customer service UI uses Cybersource as an out-of-the-box Address Verification Service while capturing the shipping address. The AVS call is supported in the shipping tab of the order capture screen and is not performed in the return/exchange screen flows. Original orders and un-even exchange flows direct the CSR to the shipping tab of the order capture screen call AVS. Refer For more details on UI help for the responses received from AVS, please reference UI help here. Note: For third party AVS integration, the command router on call center or CustomerService:ShippingAddress:UserExit:VerifyAddress user exit can be implemented. In case user exit is implemented, simulator and Cybersouce cannot be used. Note: Verifying Billing Address via third-party AVS integration is not provided out of the box and has to be customized if required. Address Verification for imported orders To ensure accurate shipping information is captured in e-commerce orders, it is advisable to implement the following steps: 1. Implement Mandatory Field Checks: It is highly recommended to incorporate null checks on the e-commerce website for essential fields such as postal code, city, and address line1.This helps in preventing incomplete or inaccurate addresses from being entered into the application. 2. In the event that the address entered by a customer is incorrect, AVS (Address Verification System) will recommend the correct address to the customer to proceed with order placement. If the customer does not choose the recommended address and continues with the incorrect address, order line should be held by following either of the below options. Option 1: Before pushing order save to base queue, add it in a custom queue. Then, invoke the below API https://<<host>>/customerengagementfacade/api/customerengagementfacade/ds/address/verifyAddress Option 2: Alternatively, directly web service call can be made to perform address verification. Based on the response received from the AVS, if the address is not successfully verified, the order line can be placed on hold. Then push this order save to base queue, order lines which are on hold will not be processed further from allocation / release. Capturing Notes CSR can capture instruction or communication notes across the order or order line while creating or editing an order. The text box will expand to display the amount of text inside to allow for better visibility.  Adding or editing order header or order line notes is managed by grants. See the UI Resources page. The order notes can be added or edited across the order header or order line level from various screens, such as: Order Status Order Creation Order Edit Return order creation Return/Exchange order status Refer to the Add Notes section for detailed steps on how to add/edit notes for an order/order line. Note: When a user wants to add a new note to an order that currently has no existing notes, clicking on the notes icon will open the order notes pop-up, providing a blank row for the user to enter the note and select the note type. If the order or order line already has existing notes, clicking the notes icon will allow the user to open and edit any of those notes. In this case, an empty row will not be automatically provided; the user will need to click the \"+\" icon to add a new note to an order or order line with existing notes. Note Type & Note Note types are used to categorize order notes. Each note type can be in one of two categories: Instruction or Customer Communication. Instructions should be used for any notes that capture fulfillment or delivery instructions. Notes of category 'Instruction' are passed on the release outbound sent to fulfillment systems, but cannot be updated after quantities have been released for fulfillment. Customer Communication notes should be used for other types of notes that are informational for CSRs or users who are viewing order history. Note types are configured in the Note Types UI. Notes in the category 'Communication' can be updated after quantities have been released to fulfillment systems. Opt in/Opt out of transactional SMS in the Contact Center UI This feature empowers agents to manage transactional SMS notification preferences for both registered and unregistered customers within the Call Center application, providing flexibility to opt in or out of transactional SMS notifications based on customer preferences. The  \"Opt-In\" section is available under the Preferences tab in the customer profile. Agents can enable or disable SMS notifications for registered customers using a checkbox. This preference automatically applies to all future orders placed by the customer. Additionally, the SMS opt-in/out option is available on the customer details pop-up during order placement for both registered and unregistered customers. For registered customers, the default status reflects the opt-in setting from the customer profile. For unregistered customers, this option is disabled by default but can be enabled during the order process. Unregistered customers can similarly modify their preferences through the register customer pop up while confirming the order. Registered customers can similarly modify their preferences through the update customer pop-up after placing an order. The \"Communications Opt-In\" setting in the Call Center configuration determines the visibility of the SMS opt-in option. When enabled, the SMS opt-in option appears on relevant screens within the Call Center UI. If disabled, the option is hidden from view. Capturing Phone Number When adding item(s) to the cart, the contact center agent has the option to select a registered customer versus a new customer. Upon selecting a registered customer, the saved phone number will populate. When a new customer is created, a phone number can be provided, but it is not required to proceed to order creation. Phone numbers can be required for new customers if a customer ID generation strategy is set to phone. If a phone number is required and the contact center agent does not provide an error, it will populate \"You must enter a value\". Capture Phone Number Country Code For international implementations, contact center agents can select a country code (prefix) for phone numbers in the contact center. In this feature, agents can select a country code from a drop-down when adding or editing phone numbers. This feature can optionally be enabled by following the steps here. If this feature is enabled, the country code field is not required to be captured. Country Code Capture With this feature, phone numbers in the contact center are entered with a country code separate from your phone number. However, phone numbers are always saved in the database in e164 format, which concatenates the country code and phone number into a single field. For example, if an agent enters country code \"1\" and phone \"555-222-4545\" in the contact center UI, the customer's phone is saved as \"+15552224545\" in the database and on all outbound interfaces such as Publish Order, Sales Posting, etc. Once a phone number is saved, the UI displays it in e164 format. The country code (prefix) defaults to the default country configured in Call Center Configuration. Agents can use the pre-populated prefix, select a new prefix, or nullify the prefix. Prefix is not required when this feature is enabled and agents can continue providing a full phone number in the phone number field. Suggested Phone Number Formats by Country If an agent selects a country code, a suggested phone number format is displayed. If the phone number provided does not follow the suggested format (it has fewer or more characters than the international prefix standard), a warning is displayed. This error is not a hard-stop and agents can continue with the number as-is. There are 20 country phone number formats that are provided out of the box. To add new country formats or modify the existing formats, update the country configuration entity. API: api/organization/countryConfiguration/save Country Code Edits When this feature is enabled and a phone number is edited, the application displays the phone number in edit mode in the UI with the country code separate from phone number. Because the phone number is saved in e164 format in the database, the Get Order API has logic to separate the concatenated phone number into two values: country code and phone number. The logic to separate the customer phone value on the order header into country code and phone number is as follows: If the phone code for the country of the order header ship-to address matches the first digit(s) of the phone value, then the first digit(s) are separated into the country code field in the response. If there is no address or the code for that country does not match the first digits in the phone number, then the system uses the country from the organization's address (address type: headquarters). If the country phone code for this country matches the first digit(s) of the phone value, then the first digit(s) are separated into the country code field in the response. If there is no match based on the above logic, the country code is null and the phone number remains as-is. Agents can edit the phone number and provide a country code if necessary. For example: An order from an organization with their headquarters in London has header ship-to address country 'France' and the customer phone is +33912434543, the system separates out into country code +33 (French phone code) and phone number 9 12 43 45 43 values because the first digit(s) matched the order header ship-to address country. An order from an organization with their headquarters in London has header ship-to address the country 'France' and the phone is +449124345433, the system separates out into country code +44 (UK phone code) and phone number 91 2434 5433. This is because there was no match with the header address, but the first digit(s) matched the organization's address (address type: headquarters). An order in an organization with their headquarters in London has header ship-to address the country 'France' and the phone is +15559099898, the system does not separate the values and country code is null and phone number stays as  is: +15559099898. This is because there was no match with the header address or with the organization's address (address type: headquarters). The logic for separating the ship-to and bill-to phone numbers into country codes and phone numbers is as follows: If the phone code for the country of the ship-to/bill-to address being edited matches the first digit(s) of the phone value, then the first digit(s) is separated into the country code field in the response. If the order header has no address or the code for that country does not match the first digits in the phone number provided, then the system uses the country from the organization's address (address type: headquarters). If the country phone code for this country matches the first digit(s) of the phone value, then the first digit(s)'s separated into the country code field in the response. If there is no match based on the above logic, the country code is null and phone number remains as-is. Agents can edit the phone number and provide a country code if necessary. Including Phone Code and Phone in Outbound Messages If external or downstream systems require the separate values for phone code and phone number as separate fields, they can be added to the response template. These fields are not supported for order import. Note: API to update response template: /order/api/fwcore/responseTemplate/save Fields to add: phoneCountryId, phoneWithoutPrefix, customerPhoneCountryId, customerPhoneWithoutPrefix Shipping Restrictions Shipping restrictions can be configured within an organization to let the contact center agents know of existing restrictions within an order. Refer to the order orchestration guide for an overview and configuration steps.Once shipping restrictions are configured, there is configuration to enable this feature within the contact center configuration. User must enable call shipping restrictions configuration within call center configuration, once enabled these configured restrictions will populate as an error message for the contact center agent to acknowledge any restrictions on the order prior to order confirmation. For restricting shipping to certain countries, please refer to Ship-To Country Restrictions as an alternative to configuring shipping restrictions. Customer Service Restrictions Error Screen When enabled, shipping restrictions will be called throughout order creation, order edit, and exchange order creation scenarios. When a contact center agent updates ship-to addresses or shipping methods on a ship to address the order line, the contact center application will call the shipping restrictions API and provide the restrictions as an error message. Note: The shipping restrictions call is made after the address verification (AVS) call is complete. If AVS is disabled, then the shipping restrictions call will be made upon clicking \"update\" or \"save\" on the address entity. This error screen will populate the shipping restrictions error message per order line by grouping the error messages by item ID. If there is a multi-line order with the same item ID, the error message will show the order lines separately to the contact center agent. This error screen is a soft-check and does not stop the contact center agent from proceeding with the order. The contact center agent can acknowledge the error screen by clicking \"ok\" and provide updates on the order lines' ship to address or shipping method if needed. • The existing 'Evaluate Shipping Restrictions' option in the Call center config mentioned will soon be depreciated. To evaluate shipping restriction as a warning/ soft check (no change in order line status) or hard check (order line goes on hold if there is a shipping restriction). Refer to Shipping Restrictions. • Until the 'Evaluate Shipping Restrictions' option in the Call center config is depreciated. Users will see two pop-ups with the shipping restrictions info if the call center config and Order config shipping restrictions are both turned on at the same time. To avoid seeing 2 pop-ups for the same functionality, uncheck the call center config and use only the Shipping restrictions config to set shipping restrictions. • The 'Is Restricted'' flag can be used to add a shipping restriction as a hard check and put the order line on hold if it has a shipping restriction. • For exchange orders, when there is a shipping restriction on the exchange item - the shipping restriction pop-up will show up in the exchange order screen. To correct the shipping restriction, the user can 'Proceed to review' and edit the address in the following page or cancel the exchange line in the exchange order and create a new line without shipping restrictions. If the 'is restricted' flag is turned on for sipping restrictions, then even the exchange order lines that have shipping restrictions will automatically go on hold and will be auto resolved when the restrictions are corrected. Ship-To Country Restrictions Retailers can configure the countries that are displayed in the shipping address drop-down list. The country list is defined by the Country Configuration. When the country has the \"Shipping Restricted\" attribute marked as true, the country is not displayed in the drop-down. Delete Order Line CSRs can delete a line once added, as long as the order is not confirmed or the line is not released. Configuration CyberSource For Credit Card Payments Confirm Cybersource is configured properly, for payment gateway integration information please see guide here. In the payment rule for the given payment type, ensure the gateway is configured as 'Cybersource' Search for 'Payment Rule' in the omnifacade menu search, select a payment rule, click on View, click on 'Payment Rule Gateway' tab and select Cybersource and save Address Verification Service (AVS) Address verification service used in the call center application can be configured by the service team. Service team, please note that AVS should be configured for the key avs.CYBERSOURCE under the following location: http://<<kvstorehost>>/../kv/config/com-manh-cp-customerengagementfacade/. AVS can be configured specifically to an organization. An example below shows the first one as common and the second one is specific to an organization. #avs gateway configuration avs.CYBERSOURCE={\\ \"endpoint\": \"<<get from address verification service>>\",\\ \"merchantID\": \"<<get from address verification service>>\",\\ \"merchantReferenceCode\": \"<<get from address verification service>>\",\\ \"merchantPassword\": \"<<get from address verification service>>\",\\ \\ \"org:dummyorg\" {\\ \"endpoint\": \"<<get from address verification service>>\",\\ \"merchantID\": \"<<get from address verification service>>\",\\ \"merchantReferenceCode\": \"<<get from address verification service>>\",\\ \"merchantPassword\": \"<<get from address verification service>>\"\\ } \\ } Note: Cybersource recommends using a unique value such as an order ID for the Merchant Reference Code to support effective tracking and reporting. By default, Base uses a static value from the configuration. If a unique identifier is needed, as per Cybersource's recommendation, the AVS call can be intercepted via the command router to inject a dynamic value into the Merchant Reference Code. This could be the order ID or any other unique identifier associated with the specific transaction. Payment Types Displayed in Contact Center The 'Payment Capture Config' is required to enable the call center application to display a form for a particular payment type to allow the CSR to capture the information. Set the flag for 'Assisted Selling' as true for the payment type that needs to be captured in the UI. To access 'Payment Capture Config', search for payment capture configuration in omnifacade menu. Note: This configuration is to display the form to capture the payment. The payment that has already been bridged in from a host will automatically show up in Use Payments section and needs no extra configuration. Out of the box, Credit Card, Gift Card, E-Check, Pay by link, payment methods have assisted selling as true If enabled for custom payment type, UI shows a standard form, which can be customized to capture more information If disabled for all payment types, payment will not be required to process orders in the call center and payment status will show as not applicable. Implementation Flavor Accommodate different address format in call center Currently, call center offers certain address format, but some customers may need to add different address format. To do this, perform the following steps: Enable the developer mode. If you want to configure some custom fields like Province, Neighborhood, District, and so on instead of base fields like city, state and zip code; Check if base component extension exists. If yes, hide the extension. Check if suitable field based extensions exist. If yes, then configure fields based on your requirement. Refer Contact Center UI Extensibility for more information on UI extension. How to invoke custom message when switching tabs Example: To perform validation on switching tabs from shipping to payment Add the sample iframe in the shipping tab and check for the available event MAExtension.EditOrderScreen.events.onPaymentTabSelected(editOrderPsoFunctionOnpaymentTabSelected); Acknowledge the available action MAExtension.EditOrderScreen.actions.ackProceedToPayment and perform validation on switch of tab. How does system generate order numbers Currently, for Contact Center orders by default, the OrderId will be CC+5 digits (randomly generated number without any logic) After the maximum digit (99999), the order ID will be updated to 6 digits (100000). How to search for orders using custom search fields To search for orders using custom search fields like Postal Code, Street Address, and ItemId present on the order/order line, perfrom the following steps: Implement an iframe for the search field on CS home screen. Invoke the below API at the backend and form the query condition based on user input value. Note: You should have logic that determines whether the entered value is a postal code, state/country, or address1. Create a query parameter based on that. {{url}}/order/api/order/shipToAddress/search { \"Query\": \"Address.State= 'CA'\", \"Size\": 365 } Display list of orders on the UI based on this API response. Related Articles"
}