{
  "id": "2617707",
  "permalink": "payment-types",
  "title": "Payment Types",
  "type": "topic",
  "level": 5,
  "path": "Manhattan Active® Omni/Order Management/Process & Configuration Guides/Order Selling/Payment/Payment Types",
  "raw_item": {
    "id": "2617707",
    "text": "Payment Types",
    "title": "Payment Types",
    "permalink": "payment-types",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "129592",
    "parent": "f;129592",
    "created_date": "1597860884",
    "modified_date": "1754299653",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "3"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2163646\" href=\"/order-selling-2\" class=\"breadcrumb-links\">Order Selling</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2163647\" href=\"/payment-2\" class=\"breadcrumb-links\">Payment</a></li><li> <span>››</span>Payment Types</li></ul>  \t\r\n\t\t<h2>Payment Types</h2>\r\n\r\n<p></p>\r\n\r\n<a href=\"/capturing-payment\" hqid=\"2617706\">Previous</a>&nbsp;I&nbsp;<a href=\"/how-payment-processing-works\" hqid=\"2617708\">Next</a>\r\n<p>&nbsp;</p>\r\n\r\n<p>The default payment types include cash, check,&nbsp;credit card, debit, e-check, gift card, PayPal, store credit, and traveler's check. Additional payment types such as loyalty points, manufacturer's coupon, and so on, can be configured as required. This guide explains the differences in behavior between different payment types and how to configure custom payment types.</p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/payment-types$out-of-the-box-payment-types\">Out of the Box Payment Types</a><ul><li><a href=\"/payment-types$cash\">Cash</a></li><li><a href=\"/payment-types$check\">Check</a></li><li><a href=\"/payment-types$credit-card\">Credit Card</a><ul><li><a href=\"/payment-types$securing-credit-card-data\">Securing Credit Card Data</a></li><li><a href=\"/payment-types$card-types\">Card Types</a></li></ul></li><li><a href=\"/payment-types$debit-card\">Debit Card</a></li><li><a href=\"/payment-types$e-check\">E-Check</a><ul><li><a href=\"/payment-types$e-check-processing\">E-Check Processing</a></li></ul></li><li><a href=\"/payment-types$gift-card\">Gift Card</a></li><li><a href=\"/payment-types$paypal\">PayPal</a><ul><li><a href=\"/payment-types$honor-validity-period-examples\">Honor & Validity Period Examples</a></li><li><a href=\"/payment-types$paypal-re-authorization\">PayPal Re-Authorization</a></li><li><a href=\"/payment-types$paypal-settlements\">PayPal Settlements</a></li><li><a href=\"/payment-types$e-checks-in-paypal\">E-Checks in PayPal</a></li><li><a href=\"/payment-types$additional-paypal-information\">Additional PayPal Information</a></li></ul></li><li><a href=\"/payment-types$store-credit\">Store Credit</a></li><li><a href=\"/payment-types$traveler-s-check\">Traveler's Check</a></li></ul></li><li><a href=\"/payment-types$payment-type-configuration\">Payment Type Configuration</a></li><li><a href=\"/payment-types$adding-custom-nbsp-payment-types\">Adding Custom&nbsp;Payment Types</a></li><li><a href=\"/payment-types$pre-paid-payment-types-nbsp\">Pre-Paid Payment Types&nbsp;</a></li><li><a href=\"/payment-types$related-articles\">Related Articles</a></li></ul></div>\r\n\r\n<h3><a name=\"out-of-the-box-payment-types\" id=\"out-of-the-box-payment-types\"></a>Out of the Box Payment Types</h3>\r\n\r\n<p>The below payment types are provided out of the box. Additional payment types can be added as required.</p>\r\n\r\n<h4 id=\"PaymentProcessing-Cash\"><a name=\"cash\" id=\"cash\"></a>Cash</h4>\r\n\r\n<p>Cash payments can be saved with only a payment method; no payment transactions are required. Since cash is configured as a pre-paid payment type, a closed, successful settlement transaction is automatically created upon saving a cash payment method. For cash payments, data including&nbsp;change amount, alternate currency code, alternate currency amount, and conversion rate can be optionally captured. In call center or online scenarios, refunding cash is not permitted; different payment types are used to refund the customer.</p>\r\n\r\n<h4 id=\"PaymentProcessing-Check\"><a name=\"check\" id=\"check\"></a>Check</h4>\r\n\r\n<p>Checks, also known as personal checks or paper checks, are generally accepted only&nbsp;when a customer is present. For online purchases or other scenarios where customers are not physically present, e-checks can be used to process a paper check as an e-check. The Payment component has two modes of processing check settlements</p>\r\n\r\n<ul>\r\n\t<li><strong>Pre-Approved Mode</strong>:&nbsp;When a check is saved, it is assumed to be verified in an external system and is considered settled. To enable this mode of check processing, the check payment type is configured with the&nbsp;isPrepaid&nbsp;flag set to true. When a check payment method is saved and check is configured as prepaid, then a closed, successful settlement is immediately created, and the credit amount is incremented in the payment summary. No action is required by a user for these payments.&nbsp;</li>\r\n\t<li><strong>Manual Approval Mode</strong>:&nbsp;When a check is saved, it is assumed to be unverified and needs to be manually approved.&nbsp;To enable this mode of check processing, the check payment type is configured with the&nbsp;isPrepaid&nbsp;flag set to false.&nbsp;When a payment method with payment type 'Check' is used, the order is imported with an open settlement transaction.&nbsp;After the check is verified, a user manually updates the settlement transaction with success or failure, based on the outcome of the check deposit. This update is done on the Payment Transactions UI.</li>\r\n</ul>\r\n\r\n<p data-renderer-start-pos=\"3242\">Checks and bank accounts are encrypted and saved within Manhattan Active® Omni. There are specific fields available to store the relevant information in the Payment Method:</p>\r\n\r\n<ul>\r\n\t<li data-renderer-start-pos=\"3429\">accountNumber</li>\r\n\t<li data-renderer-start-pos=\"3446\">routingNumber</li>\r\n\t<li data-renderer-start-pos=\"3463\">checkNumber</li>\r\n\t<li data-renderer-start-pos=\"3478\">driversLicenseNumber</li>\r\n\t<li data-renderer-start-pos=\"3502\">driversLicenseState</li>\r\n\t<li data-renderer-start-pos=\"3525\">driversLicenseCountry</li>\r\n\t<li data-renderer-start-pos=\"3550\">businessName</li>\r\n\t<li data-renderer-start-pos=\"3566\">businessTaxId</li>\r\n</ul>\r\n\r\n<h4 id=\"PaymentProcessing-CreditCard\"><a name=\"credit-card\" id=\"credit-card\"></a>Credit Card</h4>\r\n\r\n<p>Credit card payments can be saved with or without payment transactions. If transactions are created and processed by an external system such as e-commerce, then a credit card payment method can be imported with an authorization and/or settlement. If transactions are created and processed by the Payment component, then&nbsp;a payment method should be imported without any payment transactions.&nbsp;Any contactless/mobile payments which leverage NFC or MST to use customer's saved credit&nbsp;card data can be imported as credit cards.</p>\r\n\r\n<h5><a name=\"securing-credit-card-data\" id=\"securing-credit-card-data\"></a>Securing Credit Card Data</h5>\r\n\r\n<p data-renderer-start-pos=\"1003\">For credit card payments, the Card Number must be stored in a vault, while the&nbsp;corresponding irreversible token is stored within Manhattan Active® Omni. This process is commonly referred to as Tokenization. A tokenization service is offered by most of the payment gateways. In the event that the payment gateway does not offer a tokenization service, a tokenization service needs to be purchased from a third party. Manhattan recommends to use Tokenization for Private Label Cards as well. See the&nbsp;<a hqid=\"2617706\" href=\"/capturing-payment$Tokenization\">Capturing Payment</a>&nbsp;guide for more information on tokenization.</p>\r\n\r\n<p data-renderer-start-pos=\"1808\">The irreversible token should be saved in the accountNumber field of the PaymentMethod entity within the Order. Manhattan Active® Omni will pass this token to the payment gateway for further actions like Authorization, Settlement, Refund, and so on. The accountNumber field is also encrypted at the application level and stored in the database.</p>\r\n\r\n<p data-renderer-start-pos=\"2129\">The Credit Card number is never shown within Manhattan Active® Omni, including the Manhattan&nbsp;Contact Center UIs. In order to show the last four digits of Credit Card within Contact Center, the field accountDisplayNumber can be mapped. When a new payment is captured within the&nbsp;Contact Center, the accountDisplayNumber is auto populated with the last four digits.</p>\r\n\r\n<h5><a name=\"card-types\" id=\"card-types\"></a>Card Types</h5>\r\n\r\n<p>Payment types such as credit card and debit can be further categorized into card types, such as Visa, Mastercard, Discover,&nbsp;American Express, Diner's Club, or Japan Credit Bureau (JCB). This list of card types is displayed in the Customer Service UI and can be modified via the Card Type UI. Card types can be added, edited, or removed, based on the list of card types which should be displayed to customer service.</p>\r\n\r\n<h4 id=\"PaymentProcessing-Debit\"><a name=\"debit-card\" id=\"debit-card\"></a>Debit Card</h4>\r\n\r\n<p>A debit card is a payment card which, when used, immediately transfers money from the cardholder's account. Customers generally pay with debit cards in card-present situations, because card swipe and PIN entry are often required. Because debit cards do not support authorization, the&nbsp;Authorization Required flag is set to false, and a settlement is created for any orders paid using the debit card.</p>\r\n\r\n<p>Some debit cards are eligible for PIN-less entry, in which case the customer can choose to process the debit card as a credit card. PIN-less entry enables customers to use debit cards to pay for product in card-not-present situations such as online purchases. When a customer swipes a debit card in store and chooses to process as a credit card, then the payment type is credit card. The payment is processed using the credit card flow, which means that an authorization is secured on order capture, and&nbsp;settlement is attempted upon shipment.</p>\r\n\r\n<h4><a name=\"e-check\" id=\"e-check\"></a><a id=\"E-Check Payment Concept Guide\" name=\"E-Check Payment Concept Guide\"></a>E-Check</h4>\r\n\r\n<p>An e-check (electronic check) performs the same function as a paper check, only e-checks are processed electronically and can be used for&nbsp;scenarios like online purchases, where the customer is not physically present. To process e-check payments, processors require data including driver's license number, driver's license state, bill-to address, account number, account type, and routing number.</p>\r\n\r\n<h5><a name=\"e-check-processing\" id=\"e-check-processing\"></a>E-Check Processing</h5>\r\n\r\n<p>E-check authentication is a service which validates customer information such as name, address, and date of birth and provides basic consumer fraud information. An authentication is modeled as an authorization payment transaction in the Payment component, although this service only performs basic validation of the customer's information and does not validate existence of the account or hold funds on the account. E-check authorizations never expire, since it is not a true authorization but rather a basic data authentication.</p>\r\n\r\n<p>Depending on the payment processor, authentication may or may not be required or supported. The&nbsp;Authorization Required&nbsp;flag in the payment configuration is&nbsp;used to indicate if authentication is required.&nbsp;If authorization is required, then authentication is performed using an authorization transaction with processed amount equal to the input e-check amount. If authorization is not required, then no authentication is performed but a dummy authorization transaction is created with processed amount equal to the input e-check amount.</p>\r\n\r\n<p>If authentication is enabled, then the settlement request references the authentication id. Otherwise the complete e-check payment method information is included in the settlement request. Both follow-on and standalone refunds can be issued, depending on the timing of the refund relative to the original settlement.</p>\r\n\r\n<p>E-check payments are processed asynchronously, since it takes the e-check payment processor up to three days to process a settlement. To track this, the payment transaction status \"In Progress\"&nbsp;is received as part of the settlement response, instead of the normal \"Closed\" status which would be returned for synchronous payment such as credit card. For these payments, the following workflow is used.</p>\r\n\r\n<p><img src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/Async%20e-check%20payment%20processing(2).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL0FzeW5jJTIwZS1jaGVjayUyMHBheW1lbnQlMjBwcm9jZXNzaW5nKDIpLnBuZyIsIkNvbmRpdGlvbiI6eyJEYXRlTGVzc1RoYW4iOnsiQVdTOkVwb2NoVGltZSI6MTc1NDc1MTgxOH19fV19&Signature=nkua~8QTkFvf2GA4pEltbaPx7GFdOZqA0P0D7XPMdGrfjkWw4JppA9kk6ZZHh~j2nKbZ5CWO7PVApp9uA-nJIXeP-7v9fuwArpStROxTMSGXmP3L~cFrXMFYmlwVSnC~ptQnpotrdLYTq2GQOOu842eulwP1MtLbjvwKlvPZkSgr9IM716juXm8HgNJZ91qC15Xm9zeSNRpg1bjxtx76uyExY-x~VpC42vKtKZRJfiwn434OehbpNjBgmUXPphJqrkibnlFk5N4iw4GT5lvqnW9H57-hBNnTu4OwG5cU64NVpN4FjCNJdOQP6DyjLAlrF9oTjuGIaUwc196BuOWfFg__&Key-Pair-Id=K2TK3EG287XSFC\"></p>\r\n\r\n<p>When an e-check settlement is submitted to the payment gateway and the transaction is successfully received, then the transaction is updated with responseStatus = Success and transactionStatus = In Progress. Although the response status indicates success, the transaction is still in progress and is reflected in the payment method, payment summary, and payment status as an open settlement would be. Once the payment transaction has been processed&nbsp;by the payment gateway, then the transactionStatus is updated to \"Closed\". If the transaction succeeded, then the responseStatus is updated to \"Success\". If the transaction failed, then the responseStatus is updated to \"Failure\".</p>\r\n\r\n<h4><a name=\"gift-card\" id=\"gift-card\"></a>Gift Card</h4>\r\n\r\n<p>Gift card payments can be processed in&nbsp;two ways with an authorization and a settlement, or with only a settlement. If a gift card processor supports authorizations, then the&nbsp;Authorization Required flag in the payment configuration is set to true. Otherwise, the flag is set to false. Balance check transactions can be used to get the current balance of a&nbsp;gift card.&nbsp;See <a hqid=\"2617712\" href=\"/other-transaction-types$Balance Check Payment Concept Guide\">balance check transactions</a> for details.</p>\r\n\r\n<p data-renderer-start-pos=\"2477\">In addition to the Order and Customer entities, Gift Card numbers are stored in the FulfillmentDetail entity on the order to support Gift Card fulfillment use case. See the gcNumber and gcPin fields in FulfillmentDetail.</p>\r\n\r\n<p data-renderer-start-pos=\"2679\">The Gift Card number and associated PIN are encrypted at the application layer and stored within Manhattan Active® Omni. In case of asynchronous messages using queues (like Publish Order Status, Sales Posting, and so on), <strong data-renderer-mark=\"true\">it is important to remove the Gift Card numbers from the payload</strong>. This&nbsp;can be done by changing the corresponding response templates. If any external system needs this information, it can be retrieved by making a secure API call to Manhattan Active® Omni which provides the unencrypted card number transmitted via secured HTTPS layer.</p>\r\n\r\n<p data-renderer-start-pos=\"2679\">It is important to note that gift cards are not considered a pre-paid payment type in Manhattan Active Omni. See <a href=\"https://omni.helpdocsonline.com/payment-types$pre-paid-payment-types-nbsp\">Prepaid payment types</a> for more information.&nbsp;</p>\r\n\r\n<h4 id=\"PaymentProcessing-PayPal\"><a name=\"paypal\" id=\"paypal\"></a>PayPal</h4>\r\n\r\n<p>PayPal is supported&nbsp;if the authorization is captured in an external system such as e-commerce. When an order is imported with a PayPal authorization, then the Payment component&nbsp;can settle against the authorization.&nbsp;The Contact Center and Point of Sale order capture systems do not currently support capture of PayPal payment methods in base. PayPal payments must be captured in external order capture systems and imported.</p>\r\n\r\n<p>While other payment methods have simple authorization expiration periods, PayPal has the concept of an Honor Period and a Validity Period for each authorization. The Honor Period is the length of time for which the authorization is held (approximately 3 days). The Validity Period is the length of time in which a settlement can be made against an authorization (approximately 29 days).&nbsp;If a re-authorization or settlement is performed within the Honor Period, PayPal guarantees success. However, if a re-authorization or settlement is performed outside of Honor Period but within the Validity Period, then the Payment component&nbsp;must secure a new authorization before settling. Since the Validity Period and Honor Period are not known to the Payment component, the Payment component&nbsp;determines whether a new authorization is required by reading the response code returned from the gateway in the settlement response.</p>\r\n\r\n<p>Multiple settlements can be performed against a PayPal authorization, so an advance authorization is not created for partial settlements. When the Payment component sends a settlement request to PayPal, a parameter is populated to indicate if the settlement is the final settlement for this authorization. When each open settlement is created, the Payment component&nbsp;determines if it is the final settlement and includes the&nbsp;isComplete&nbsp;flag in the PayPal request. When PayPal receives a settlement request for a complete settlement, then any&nbsp;remaining amount of the original authorized transaction is&nbsp;voided, and all remaining open authorizations are voided.</p>\r\n\r\n<h5><a name=\"honor-validity-period-examples\" id=\"honor-validity-period-examples\"></a>Honor & Validity Period Examples</h5>\r\n\r\n<p><strong>Scenario 1</strong>: An order ships within the Honor Period. A settlement request is sent to the payment gateway when the order ships. The settlement response contains a response code indicating that settlement has succeeded.</p>\r\n\r\n<p><img height=\"440\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/image(5).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1L2ltYWdlKDUpLnBuZyIsIkNvbmRpdGlvbiI6eyJEYXRlTGVzc1RoYW4iOnsiQVdTOkVwb2NoVGltZSI6MTc1NDc1MTgxOH19fV19&Signature=ljMT9b1NMJEu4wGqSnksB-CSZD1Fss7BnurtNki0DLoiFxOSmwJuZxlOuQGdk1RO9NjGd9IxH9~dQuDCGdo~5x~vXfrIT9~1M6OxS8nHD9KkRl2TaIuQQFG7rnuMpmWpTNZEehY2rfktLxbQ8di-3RdmLYaKoi45LqQdCQ0rAPxSwOnZc6Xx3qJXFQ5gXlaeKFRDrYeGHh3tkQLAZ-6bC~XSTQQ5EssopSdHOK-E~gfGzskYQlzRdmmBNRde-tOk6SpHh8RPPWKLq446NxZiFnorfoX0Vst2H~gxeeKc8GDQ-736x~zR9zVrWtOGZjpHMj8s5uFi~SbYu1lH~sXogA__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 830px; height: 237px;\" width=\"1540\"></p>\r\n\r\n<p><strong>Scenario 2</strong>: An order ships outside the Honor Period, but within the Validity Period. A settlement request is sent to the payment gateway when the order ships. The settlement response contains a response code indicating that a new authorization must be secured before settling.</p>\r\n\r\n<p><img height=\"440\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/image(4).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1L2ltYWdlKDQpLnBuZyIsIkNvbmRpdGlvbiI6eyJEYXRlTGVzc1RoYW4iOnsiQVdTOkVwb2NoVGltZSI6MTc1NDc1MTgxOH19fV19&Signature=pozR~Rz9wvQ3hb6bVsMYcmRNJy~Dhm0hRMOj53eLn7Jlzyc3BO77PEnjY4VAaIW94ng1VbLS4ABvbp9Xt1B5PLYpWacvmB5TPTfuGVOKO0g4ZozfR3jWgnrhwYiIQDRgtIxUAndcOgsjW2xOXfLD7drM6uRh14lehGoi52Yb0Da74xJBX5UHnwkww0cAKhyiRXovHKayHoAUzNVH0hDy4FtfwXsERXfzHaqfgYlzvLq3DFo~BOsZsL3dHHd1TxJh0gD2thfpAAG9hWNAewCQnAvJJ8uh3~HtStF0UVpqJvDrJbUmgBhxG8xb1hwjklRbKSopbrObY7awx9v25R5GsQ__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 850px; height: 242px;\" width=\"1546\"></p>\r\n\r\n<p><strong>Scenario 3</strong>: An order ships outside the Validity Period. A settlement request is sent to the payment gateway when the order ships. The settlement response contains a response code indicating that settlement has failed. The original authorization token cannot be used for settlement, so the customer should be contacted and asked to provide a new payment method.</p>\r\n\r\n<p><img height=\"418\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/image(3).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1L2ltYWdlKDMpLnBuZyIsIkNvbmRpdGlvbiI6eyJEYXRlTGVzc1RoYW4iOnsiQVdTOkVwb2NoVGltZSI6MTc1NDc1MTgxOH19fV19&Signature=Qnib1tm3ERUzgtclkXtflyvj7zJywuTJbt5ikqR3topYocsmgZXBIYTTz-ZyN9UqQKs4W81NGtgypjdo7i8i8-29bo1WHvJkHnvpoJzSemXGR5zVdQbzkvKongmxLbLkzk0NU7ljFwpQnBGIOyc-B5X-wj-0t~cS-qEyf2~yIlHN-SAaP3B-UTXvs1CuRmNtAUoBttIvDECuHOvRJ~wnmp6eY5kjQuAVQEvN1uDoplSAs7hIomN7rdIaJufWD-oBuRSsOf5nqsolsj4QcraheNuRrK05l9qEUQ6yhtKzr19ygZg3-3yVoduHHffMK-YDWHIjB5l9b6Xg3p9YgWdDKg__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 827px; height: 225px;\" width=\"1538\"></p>\r\n\r\n<h5><a name=\"paypal-re-authorization\" id=\"paypal-re-authorization\"></a>PayPal Re-Authorization</h5>\r\n\r\n<p>While PayPal authorizations expire, they are not&nbsp;re-authorized based on a scheduled interval like credit cards.&nbsp;Since&nbsp;re-authorization is required for any shipments which occur outside the 3-day Honor Period, no re-authorizations are performed until settlement. The way that this works is illustrated in the below example.&nbsp;</p>\r\n\r\n<p>For example, if two items are purchased and one item ships on day 2, then settlement succeeds. If the second item ships on day 6, then settlement may fail with the error code 10601. The configuration defined in the gateway response mapping entity in the payment gateway component includes:</p>\r\n\r\n<pre><code>{\r\n&nbsp; &nbsp; \"PaymentTypeId\": \"PayPal\",\r\n&nbsp; &nbsp; \"GatewayId\": \"PayPal\",\r\n&nbsp; &nbsp; \"ResponseDecisionId\": \"Failure\",\r\n&nbsp; &nbsp; \"ExternalResponseCode\": \"10601\",\r\n&nbsp; &nbsp; \"ExternalResponseDescription\": \"Authorization has expired.\",\r\n&nbsp; &nbsp; \"InternalResponseCode\": \"308\",\r\n&nbsp; &nbsp; \"InternalResponseDescription\": \"Authorization has expired.\",\r\n&nbsp; &nbsp; \"ReAuthOnSettlementFailure\": true\r\n}</code>\r\n</pre>\r\n\r\n<p>If settlement fails because the authorization expired, then the reAuthOnSettlementFailure flag triggers re-authorization. If a gateway response is received from PayPal and&nbsp;the gateway response mapping&nbsp;reAuthOnSettlementFailure&nbsp;attribute is true, then the corresponding flag on the settlement transaction is set to true. When this flag is true, a new, open authorization is created and executed immediately for a&nbsp;requested amount equal to the open authorization amount. If this authorization is successful, then a new, open settlement is created and executed for the settlement amount attempted previously. If the authorization fails, then no new settlement is created.</p>\r\n\r\n<p>To exclude PayPal payments from the re-authorization scheduler, the PayPal authExpiryDays should remain&nbsp;null in the payment configuration.</p>\r\n\r\n<p>Note: If a custom payment gateway is used, then a mapping in this custom component from gateway response code to indicate if re-auth on settlement failure is required. For instance, PayPal response code XYZ should have reAuthOnSettlementFailure = true in the custom gateway, so that when a PayPal response with XYZ is received, the gateway component sets&nbsp;reAuthOnSettlementFailure = true on the payment transaction.</p>\r\n\r\n<h5><a name=\"paypal-settlements\" id=\"paypal-settlements\"></a>PayPal Settlements</h5>\r\n\r\n<p>PayPal uses the field IsCompleteFollowOnRequest&nbsp;to determine if a settlement is the final one for an order, in which case they can release any remaining authorizations. The following logic is used to populate this field in the PayPal request:</p>\r\n\r\n<ol>\r\n\t<li>If the associated authorization transaction is null, then set IsCompleteFollowOnRequest = true, as this is a standalone settlement.</li>\r\n\t<li>Else calculate the total auth reversal amount and total settled amount for the authorization transaction. If the (reqAuthAmount - authReversalAmount - settledAmount - currentSettlementRequestAmount) = 0, then set&nbsp;IsCompleteFollowOnRequest = true,&nbsp;else 'NotComplete'.</li>\r\n</ol>\r\n\r\n<h5><a name=\"e-checks-in-paypal\" id=\"e-checks-in-paypal\"></a>E-Checks in PayPal</h5>\r\n\r\n<p>If an e-check is used for a PayPal payment, then the response is asynchronous. There is no data within the payment method that indicates a PayPal payment method is an e-check; the only indicator is the In Progress status received&nbsp;as part of the settlement response.&nbsp;See the E-Check section for details.</p>\r\n\r\n<h5><a name=\"additional-paypal-information\" id=\"additional-paypal-information\"></a>Additional PayPal Information</h5>\r\n\r\n<p>For details on configuring PayPal Signature and Certificate modes, see the <a hqid=\"2617714\" href=\"/payment-gateway-integration$Payment Gateway Configuration\">Payment Gateway Integration </a>guide.</p>\r\n\r\n<h4 id=\"PaymentProcessing-StoreCredit\"><a name=\"store-credit\" id=\"store-credit\"></a>Store Credit</h4>\r\n\r\n<p>Store credit is a tender commonly used to issue refunds. Store credit&nbsp;payments can be processed in&nbsp;two ways with an authorization and a settlement, or with only a settlement. If a store credit processor supports authorizations, then the&nbsp;Authorization Required flag in the payment configuration is set to true. Otherwise, the flag is set to false. Balance check transactions can be used to get the current balance of a&nbsp;store credit account.&nbsp;See <a href=\"https://omni.helpdocsonline.com/other-transaction-types$balance-check\">balance check transactions</a> for details.</p>\r\n\r\n<h4 id=\"PaymentProcessing-Traveler'sCheck\"><a name=\"traveler-s-check\" id=\"traveler-s-check\"></a>Traveler's Check</h4>\r\n\r\n<p>Traveler's checks&nbsp;are generally accepted only&nbsp;when a customer is present. Traveler's checks are&nbsp;configured with the&nbsp;isPrepaid&nbsp;flag set to true. When a traveler's check payment method is saved, then a closed, successful settlement is immediately created, and the credit amount is incremented in the payment summary. The number of checks and franking details can optionally be captured for informational purposes.</p>\r\n\r\n<h3><a name=\"payment-type-configuration\" id=\"payment-type-configuration\"></a>Payment Type Configuration</h3>\r\n\r\n<p>The Payment Type Configuration UI holds&nbsp;a unique set of parameters which define how each payment type is&nbsp;processed. For example, it's used to indicate whether a payment method supports refund, requires authorization, and the number of days after which an authorization should expire. A single payment configuration can be shared across payment rules. For instance, if the Visa configurations are common across in store orders and e-commerce orders, then a single Visa configuration is used in the store order payment rule and the e-commerce order payment rule.</p>\r\n\r\n<p>The Payment Type Configuration UI includes configurations pertaining to authorization, refund, sequencing, etc. See the relevant Authorization, Settlement, Refund, and other payment guides for more details on specific parameters.&nbsp;To configure these settings, navigate to the <a href=\"https://omni.helpdocsonline.com/payment-configuration-2\">Payment Type Config UI</a>.</p>\r\n\r\n<h3 id=\"PaymentProcessing-ExtendedPaymentTypes\"><a name=\"adding-custom-nbsp-payment-types\" id=\"adding-custom-nbsp-payment-types\"></a>Adding Custom&nbsp;Payment Types</h3>\r\n\r\n<p>In addition to the built-in payment types, Manhattan Active® Omni can be extended to add custom payment types (for example,&nbsp;accounts receivable, loyalty points, or manufacturer's coupon). In such cases, careful analysis must be performed to identify the sensitive fields and save them in relevant fields. Such sensitive&nbsp;fields must be removed from the response templates to ensure the payload sent through queue mechanisms do not have any unencrypted data.</p>\r\n\r\n<p data-renderer-start-pos=\"4030\">For mapping the sensitive fields for custom payment types, there are two types of placeholders within PaymentMethod entity.</p>\r\n\r\n<ol>\r\n\t<li data-renderer-start-pos=\"4158\"><strong>Base fields</strong>: The existing base fields can be repurposed to store the required custom information. For example, accountNumber can be used to store the account number in case of Accounts Receivable.</li>\r\n\t<li data-renderer-start-pos=\"4359\"><strong>Encrypted Key-Value pairs</strong>: The PaymentMethod entity contains child key/value table PaymentMethodEncrAttribute which can be used to encrypt any arbitrary values and store within Manhattan Active® Omni.</li>\r\n</ol>\r\n\r\n<p>The payment configuration is used to indicate how the payment type should be processed. To add a custom payment type:</p>\r\n\r\n<ol>\r\n\t<li>Add a&nbsp;new payment type via the Payment Type UI.</li>\r\n\t<li>Review the payment&nbsp;configurations in the Payment&nbsp;Configuration UI and determine if an existing configuration can be used for this new payment type. For example, gift card and store credit share many common payment processing rules, so a single configuration can often be shared across both payment types. If a new payment type configuration is required, then add a new configuration. If an existing configuration can be used, then skip to the next step.</li>\r\n\t<li>Add a payment rule for the new payment type, and link it to the configuration from step 2. If required, create multiple payment rules for this payment type, by specifying&nbsp;card type and/or order type.</li>\r\n\t<li>If a third party payment gateway is required, then review the list of gateways in the <a hqid=\"1827458\" href=\"/payment-configuration-2$Payment_config_UI\">Payment Gateway UI</a> and determine if an existing gateway can be used for this new payment type. Add a new gateway if required, and select the gateway in the payment rule. If an existing gateway can be used, then select the existing gateway in the payment rule. If no gateway is required, as is the case for cash and traveler's check, then do not add any gateway to the payment rule.</li>\r\n</ol>\r\n\r\n<h3><a name=\"pre-paid-payment-types-nbsp\" id=\"pre-paid-payment-types-nbsp\"></a>Pre-Paid Payment Types&nbsp;</h3>\r\n\r\n<p>For each payment type, the Is Pre-Paid attribute indicates whether the payment type is considered pre-paid when saved. If a payment type is pre-paid, then a successful, closed settlement is created when a payment method is saved. For example, cash is configured as pre-paid. When a $60 cash payment is saved, a closed, successful $60 settlement is created against the payment method. This settlement is used by the Payment<em>&nbsp;</em>component to reflect the amount collected. If a payment type is not pre-paid, then&nbsp;no payment transactions are created upon save, but rather they are created when the calculate service determines what transaction type to create by using the payment summary. For example, credit cards are not configured as pre-paid. When a $60 credit card payment is saved, no payment transactions are created. When the calculate service is called, it determines whether the credit card needs to be authorized, settled, or refunded.&nbsp;</p>\r\n\r\n<p>When a pre-paid payment method is saved with a negative amount, then a successful, closed refund is created. For example, when a -$60 cash payment is saved, a closed, successful $60 refund is created against the payment method. This refund&nbsp;is used by the Payment<em>&nbsp;</em>component to reflect the amount issued to the customer.</p>\r\n\r\n<p>Out of the box seed data marks prepaid as true for cash, checks, traveler's checks and refund checks. Unless specifically required by the project, no other out of the box payment type should be set as prepaid.&nbsp;</p>\r\n\r\n<h3><a name=\"related-articles\" id=\"related-articles\"></a>Related Articles</h3>\r\n\r\n<div class=\"info\"><ul class=\"related-articles\"><li><a href=\"/paymentoverview\" hqid=\"2688302\">Payment Overview</a></li><li><a href=\"/payment-gateway-integration\" hqid=\"2617714\">Payment Gateway Integration</a></li><li><a href=\"/capturing-payment\" hqid=\"2617706\">Capturing Payment</a></li><li><a href=\"/other-transaction-types\" hqid=\"2617712\">Other Transaction Types</a></li><li><a href=\"/payment-rest-apis-and-user-exits\" hqid=\"2617717\">Rest APIs and User Exits</a></li><li><a href=\"/refunds\" hqid=\"2617711\">Refunds</a></li><li><a href=\"/paymentfailures\" hqid=\"2660553\">Payment Failures</a></li><li><a href=\"/payment-troubleshooting\" hqid=\"2617718\">Testing & Troubleshooting Payment</a></li><li><a href=\"/settlement\" hqid=\"2617710\">Settlement</a></li><li><a href=\"/einvoice\" hqid=\"3061519\">eInvoice </a></li><li><a href=\"/payment-health-dashboard\" hqid=\"3127204\">Payment Health Dashboard</a></li><li><a href=\"/invoicing-sales-posting\" hqid=\"2617713\">Invoicing and Sales Posting</a></li><li><a href=\"/how-payment-processing-works\" hqid=\"2617708\">How Payment Processing Works</a></li><li><a href=\"/authorization\" hqid=\"2617709\">Authorization</a></li><li><a href=\"/payment-fraud\" hqid=\"2617716\">Fraud</a></li><li><a href=\"/payment-schedulers\" hqid=\"2617715\">Payment Schedulers & Batch Processing</a></li></ul></div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 33820,
  "scraped_at": "2025-08-09T21:58:38.836230",
  "content_clean": "Home ››Manhattan Active® Omni››Order Management››Process & Configuration Guides››Order Selling››Payment ››Payment Types Payment Types Previous I Next The default payment types include cash, check, credit card, debit, e-check, gift card, PayPal, store credit, and traveler's check. Additional payment types such as loyalty points, manufacturer's coupon, and so on, can be configured as required. This guide explains the differences in behavior between different payment types and how to configure custom payment types. Out of the Box Payment TypesCashCheckCredit CardSecuring Credit Card DataCard TypesDebit CardE-CheckE-Check ProcessingGift CardPayPalHonor & Validity Period ExamplesPayPal Re-AuthorizationPayPal SettlementsE-Checks in PayPalAdditional PayPal InformationStore CreditTraveler's CheckPayment Type ConfigurationAdding Custom Payment TypesPre-Paid Payment Types Related Articles Out of the Box Payment Types The below payment types are provided out of the box. Additional payment types can be added as required. Cash Cash payments can be saved with only a payment method; no payment transactions are required. Since cash is configured as a pre-paid payment type, a closed, successful settlement transaction is automatically created upon saving a cash payment method. For cash payments, data including change amount, alternate currency code, alternate currency amount, and conversion rate can be optionally captured. In call center or online scenarios, refunding cash is not permitted; different payment types are used to refund the customer. Check Checks, also known as personal checks or paper checks, are generally accepted only when a customer is present. For online purchases or other scenarios where customers are not physically present, e-checks can be used to process a paper check as an e-check. The Payment component has two modes of processing check settlements Pre-Approved Mode: When a check is saved, it is assumed to be verified in an external system and is considered settled. To enable this mode of check processing, the check payment type is configured with the isPrepaid flag set to true. When a check payment method is saved and check is configured as prepaid, then a closed, successful settlement is immediately created, and the credit amount is incremented in the payment summary. No action is required by a user for these payments. Manual Approval Mode: When a check is saved, it is assumed to be unverified and needs to be manually approved. To enable this mode of check processing, the check payment type is configured with the isPrepaid flag set to false. When a payment method with payment type 'Check' is used, the order is imported with an open settlement transaction. After the check is verified, a user manually updates the settlement transaction with success or failure, based on the outcome of the check deposit. This update is done on the Payment Transactions UI. Checks and bank accounts are encrypted and saved within Manhattan Active® Omni. There are specific fields available to store the relevant information in the Payment Method: accountNumber routingNumber checkNumber driversLicenseNumber driversLicenseState driversLicenseCountry businessName businessTaxId Credit Card Credit card payments can be saved with or without payment transactions. If transactions are created and processed by an external system such as e-commerce, then a credit card payment method can be imported with an authorization and/or settlement. If transactions are created and processed by the Payment component, then a payment method should be imported without any payment transactions. Any contactless/mobile payments which leverage NFC or MST to use customer's saved credit card data can be imported as credit cards. Securing Credit Card Data For credit card payments, the Card Number must be stored in a vault, while the corresponding irreversible token is stored within Manhattan Active® Omni. This process is commonly referred to as Tokenization. A tokenization service is offered by most of the payment gateways. In the event that the payment gateway does not offer a tokenization service, a tokenization service needs to be purchased from a third party. Manhattan recommends to use Tokenization for Private Label Cards as well. See the Capturing Payment guide for more information on tokenization. The irreversible token should be saved in the accountNumber field of the PaymentMethod entity within the Order. Manhattan Active® Omni will pass this token to the payment gateway for further actions like Authorization, Settlement, Refund, and so on. The accountNumber field is also encrypted at the application level and stored in the database. The Credit Card number is never shown within Manhattan Active® Omni, including the Manhattan Contact Center UIs. In order to show the last four digits of Credit Card within Contact Center, the field accountDisplayNumber can be mapped. When a new payment is captured within the Contact Center, the accountDisplayNumber is auto populated with the last four digits. Card Types Payment types such as credit card and debit can be further categorized into card types, such as Visa, Mastercard, Discover, American Express, Diner's Club, or Japan Credit Bureau (JCB). This list of card types is displayed in the Customer Service UI and can be modified via the Card Type UI. Card types can be added, edited, or removed, based on the list of card types which should be displayed to customer service. Debit Card A debit card is a payment card which, when used, immediately transfers money from the cardholder's account. Customers generally pay with debit cards in card-present situations, because card swipe and PIN entry are often required. Because debit cards do not support authorization, the Authorization Required flag is set to false, and a settlement is created for any orders paid using the debit card. Some debit cards are eligible for PIN-less entry, in which case the customer can choose to process the debit card as a credit card. PIN-less entry enables customers to use debit cards to pay for product in card-not-present situations such as online purchases. When a customer swipes a debit card in store and chooses to process as a credit card, then the payment type is credit card. The payment is processed using the credit card flow, which means that an authorization is secured on order capture, and settlement is attempted upon shipment. E-Check An e-check (electronic check) performs the same function as a paper check, only e-checks are processed electronically and can be used for scenarios like online purchases, where the customer is not physically present. To process e-check payments, processors require data including driver's license number, driver's license state, bill-to address, account number, account type, and routing number. E-Check Processing E-check authentication is a service which validates customer information such as name, address, and date of birth and provides basic consumer fraud information. An authentication is modeled as an authorization payment transaction in the Payment component, although this service only performs basic validation of the customer's information and does not validate existence of the account or hold funds on the account. E-check authorizations never expire, since it is not a true authorization but rather a basic data authentication. Depending on the payment processor, authentication may or may not be required or supported. The Authorization Required flag in the payment configuration is used to indicate if authentication is required. If authorization is required, then authentication is performed using an authorization transaction with processed amount equal to the input e-check amount. If authorization is not required, then no authentication is performed but a dummy authorization transaction is created with processed amount equal to the input e-check amount. If authentication is enabled, then the settlement request references the authentication id. Otherwise the complete e-check payment method information is included in the settlement request. Both follow-on and standalone refunds can be issued, depending on the timing of the refund relative to the original settlement. E-check payments are processed asynchronously, since it takes the e-check payment processor up to three days to process a settlement. To track this, the payment transaction status \"In Progress\" is received as part of the settlement response, instead of the normal \"Closed\" status which would be returned for synchronous payment such as credit card. For these payments, the following workflow is used. When an e-check settlement is submitted to the payment gateway and the transaction is successfully received, then the transaction is updated with responseStatus = Success and transactionStatus = In Progress. Although the response status indicates success, the transaction is still in progress and is reflected in the payment method, payment summary, and payment status as an open settlement would be. Once the payment transaction has been processed by the payment gateway, then the transactionStatus is updated to \"Closed\". If the transaction succeeded, then the responseStatus is updated to \"Success\". If the transaction failed, then the responseStatus is updated to \"Failure\". Gift Card Gift card payments can be processed in two ways with an authorization and a settlement, or with only a settlement. If a gift card processor supports authorizations, then the Authorization Required flag in the payment configuration is set to true. Otherwise, the flag is set to false. Balance check transactions can be used to get the current balance of a gift card. See balance check transactions for details. In addition to the Order and Customer entities, Gift Card numbers are stored in the FulfillmentDetail entity on the order to support Gift Card fulfillment use case. See the gcNumber and gcPin fields in FulfillmentDetail. The Gift Card number and associated PIN are encrypted at the application layer and stored within Manhattan Active® Omni. In case of asynchronous messages using queues (like Publish Order Status, Sales Posting, and so on), it is important to remove the Gift Card numbers from the payload. This can be done by changing the corresponding response templates. If any external system needs this information, it can be retrieved by making a secure API call to Manhattan Active® Omni which provides the unencrypted card number transmitted via secured HTTPS layer. It is important to note that gift cards are not considered a pre-paid payment type in Manhattan Active Omni. See Prepaid payment types for more information. PayPal PayPal is supported if the authorization is captured in an external system such as e-commerce. When an order is imported with a PayPal authorization, then the Payment component can settle against the authorization. The Contact Center and Point of Sale order capture systems do not currently support capture of PayPal payment methods in base. PayPal payments must be captured in external order capture systems and imported. While other payment methods have simple authorization expiration periods, PayPal has the concept of an Honor Period and a Validity Period for each authorization. The Honor Period is the length of time for which the authorization is held (approximately 3 days). The Validity Period is the length of time in which a settlement can be made against an authorization (approximately 29 days). If a re-authorization or settlement is performed within the Honor Period, PayPal guarantees success. However, if a re-authorization or settlement is performed outside of Honor Period but within the Validity Period, then the Payment component must secure a new authorization before settling. Since the Validity Period and Honor Period are not known to the Payment component, the Payment component determines whether a new authorization is required by reading the response code returned from the gateway in the settlement response. Multiple settlements can be performed against a PayPal authorization, so an advance authorization is not created for partial settlements. When the Payment component sends a settlement request to PayPal, a parameter is populated to indicate if the settlement is the final settlement for this authorization. When each open settlement is created, the Payment component determines if it is the final settlement and includes the isComplete flag in the PayPal request. When PayPal receives a settlement request for a complete settlement, then any remaining amount of the original authorized transaction is voided, and all remaining open authorizations are voided. Honor & Validity Period Examples Scenario 1: An order ships within the Honor Period. A settlement request is sent to the payment gateway when the order ships. The settlement response contains a response code indicating that settlement has succeeded. Scenario 2: An order ships outside the Honor Period, but within the Validity Period. A settlement request is sent to the payment gateway when the order ships. The settlement response contains a response code indicating that a new authorization must be secured before settling. Scenario 3: An order ships outside the Validity Period. A settlement request is sent to the payment gateway when the order ships. The settlement response contains a response code indicating that settlement has failed. The original authorization token cannot be used for settlement, so the customer should be contacted and asked to provide a new payment method. PayPal Re-Authorization While PayPal authorizations expire, they are not re-authorized based on a scheduled interval like credit cards. Since re-authorization is required for any shipments which occur outside the 3-day Honor Period, no re-authorizations are performed until settlement. The way that this works is illustrated in the below example. For example, if two items are purchased and one item ships on day 2, then settlement succeeds. If the second item ships on day 6, then settlement may fail with the error code 10601. The configuration defined in the gateway response mapping entity in the payment gateway component includes: { \"PaymentTypeId\": \"PayPal\", \"GatewayId\": \"PayPal\", \"ResponseDecisionId\": \"Failure\", \"ExternalResponseCode\": \"10601\", \"ExternalResponseDescription\": \"Authorization has expired.\", \"InternalResponseCode\": \"308\", \"InternalResponseDescription\": \"Authorization has expired.\", \"ReAuthOnSettlementFailure\": true } If settlement fails because the authorization expired, then the reAuthOnSettlementFailure flag triggers re-authorization. If a gateway response is received from PayPal and the gateway response mapping reAuthOnSettlementFailure attribute is true, then the corresponding flag on the settlement transaction is set to true. When this flag is true, a new, open authorization is created and executed immediately for a requested amount equal to the open authorization amount. If this authorization is successful, then a new, open settlement is created and executed for the settlement amount attempted previously. If the authorization fails, then no new settlement is created. To exclude PayPal payments from the re-authorization scheduler, the PayPal authExpiryDays should remain null in the payment configuration. Note: If a custom payment gateway is used, then a mapping in this custom component from gateway response code to indicate if re-auth on settlement failure is required. For instance, PayPal response code XYZ should have reAuthOnSettlementFailure = true in the custom gateway, so that when a PayPal response with XYZ is received, the gateway component sets reAuthOnSettlementFailure = true on the payment transaction. PayPal Settlements PayPal uses the field IsCompleteFollowOnRequest to determine if a settlement is the final one for an order, in which case they can release any remaining authorizations. The following logic is used to populate this field in the PayPal request: If the associated authorization transaction is null, then set IsCompleteFollowOnRequest = true, as this is a standalone settlement. Else calculate the total auth reversal amount and total settled amount for the authorization transaction. If the (reqAuthAmount - authReversalAmount - settledAmount - currentSettlementRequestAmount) = 0, then set IsCompleteFollowOnRequest = true, else 'NotComplete'. E-Checks in PayPal If an e-check is used for a PayPal payment, then the response is asynchronous. There is no data within the payment method that indicates a PayPal payment method is an e-check; the only indicator is the In Progress status received as part of the settlement response. See the E-Check section for details. Additional PayPal Information For details on configuring PayPal Signature and Certificate modes, see the Payment Gateway Integration guide. Store Credit Store credit is a tender commonly used to issue refunds. Store credit payments can be processed in two ways with an authorization and a settlement, or with only a settlement. If a store credit processor supports authorizations, then the Authorization Required flag in the payment configuration is set to true. Otherwise, the flag is set to false. Balance check transactions can be used to get the current balance of a store credit account. See balance check transactions for details. Traveler's Check Traveler's checks are generally accepted only when a customer is present. Traveler's checks are configured with the isPrepaid flag set to true. When a traveler's check payment method is saved, then a closed, successful settlement is immediately created, and the credit amount is incremented in the payment summary. The number of checks and franking details can optionally be captured for informational purposes. Payment Type Configuration The Payment Type Configuration UI holds a unique set of parameters which define how each payment type is processed. For example, it's used to indicate whether a payment method supports refund, requires authorization, and the number of days after which an authorization should expire. A single payment configuration can be shared across payment rules. For instance, if the Visa configurations are common across in store orders and e-commerce orders, then a single Visa configuration is used in the store order payment rule and the e-commerce order payment rule. The Payment Type Configuration UI includes configurations pertaining to authorization, refund, sequencing, etc. See the relevant Authorization, Settlement, Refund, and other payment guides for more details on specific parameters. To configure these settings, navigate to the Payment Type Config UI. Adding Custom Payment Types In addition to the built-in payment types, Manhattan Active® Omni can be extended to add custom payment types (for example, accounts receivable, loyalty points, or manufacturer's coupon). In such cases, careful analysis must be performed to identify the sensitive fields and save them in relevant fields. Such sensitive fields must be removed from the response templates to ensure the payload sent through queue mechanisms do not have any unencrypted data. For mapping the sensitive fields for custom payment types, there are two types of placeholders within PaymentMethod entity. Base fields: The existing base fields can be repurposed to store the required custom information. For example, accountNumber can be used to store the account number in case of Accounts Receivable. Encrypted Key-Value pairs: The PaymentMethod entity contains child key/value table PaymentMethodEncrAttribute which can be used to encrypt any arbitrary values and store within Manhattan Active® Omni. The payment configuration is used to indicate how the payment type should be processed. To add a custom payment type: Add a new payment type via the Payment Type UI. Review the payment configurations in the Payment Configuration UI and determine if an existing configuration can be used for this new payment type. For example, gift card and store credit share many common payment processing rules, so a single configuration can often be shared across both payment types. If a new payment type configuration is required, then add a new configuration. If an existing configuration can be used, then skip to the next step. Add a payment rule for the new payment type, and link it to the configuration from step 2. If required, create multiple payment rules for this payment type, by specifying card type and/or order type. If a third party payment gateway is required, then review the list of gateways in the Payment Gateway UI and determine if an existing gateway can be used for this new payment type. Add a new gateway if required, and select the gateway in the payment rule. If an existing gateway can be used, then select the existing gateway in the payment rule. If no gateway is required, as is the case for cash and traveler's check, then do not add any gateway to the payment rule. Pre-Paid Payment Types For each payment type, the Is Pre-Paid attribute indicates whether the payment type is considered pre-paid when saved. If a payment type is pre-paid, then a successful, closed settlement is created when a payment method is saved. For example, cash is configured as pre-paid. When a $60 cash payment is saved, a closed, successful $60 settlement is created against the payment method. This settlement is used by the Payment component to reflect the amount collected. If a payment type is not pre-paid, then no payment transactions are created upon save, but rather they are created when the calculate service determines what transaction type to create by using the payment summary. For example, credit cards are not configured as pre-paid. When a $60 credit card payment is saved, no payment transactions are created. When the calculate service is called, it determines whether the credit card needs to be authorized, settled, or refunded. When a pre-paid payment method is saved with a negative amount, then a successful, closed refund is created. For example, when a -$60 cash payment is saved, a closed, successful $60 refund is created against the payment method. This refund is used by the Payment component to reflect the amount issued to the customer. Out of the box seed data marks prepaid as true for cash, checks, traveler's checks and refund checks. Unless specifically required by the project, no other out of the box payment type should be set as prepaid. Related Articles Payment OverviewPayment Gateway IntegrationCapturing PaymentOther Transaction TypesRest APIs and User ExitsRefundsPayment FailuresTesting & Troubleshooting PaymentSettlementeInvoice Payment Health DashboardInvoicing and Sales PostingHow Payment Processing WorksAuthorizationFraudPayment Schedulers & Batch Processing"
}