{
  "success": true,
  "permalink": "payment-resolution",
  "title": "Payment Resolution",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158714\" href=\"/digital-self-service-3\" class=\"breadcrumb-links\">Digital Self-Service</a></li><li> <span>››</span>Payment Resolution</li></ul>  \t\r\n\t\t<h2>Payment Resolution</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/payment-resolution$overview\">Overview</a></li><li><a href=\"/payment-resolution$payment-resolution-in-digital-self-service\">Payment Resolution in Digital Self-Service</a><ul><li><a href=\"/payment-resolution$digital-self-service-authentication\">Digital Self-Service Authentication</a></li><li><a href=\"/payment-resolution$customizing-for-your-brand\">Customizing for your Brand</a></li><li><a href=\"/payment-resolution$digital-self-service-localization\">Digital Self-Service Localization</a></li></ul></li><li><a href=\"/payment-resolution$configuration\">Configuration</a><ul><li><a href=\"/payment-resolution$order-configuration\">Order Configuration</a></li><li><a href=\"/payment-resolution$digital-self-service-configuration\">Digital Self-Service Configuration</a></li></ul></li><li><a href=\"/payment-resolution$feature-scope\">Feature Scope</a></li></ul></div>\r\n\r\n<h3><a name=\"overview\" id=\"overview\"></a>Overview</h3>\r\n\r\n<p>Payment failures often require a substantial manual effort to try to recover, whether by cold-calling customers or writing off failed payments. Manhattan&nbsp;Active&reg; Omni payment resolution includes two features to increase settlement conversion rates and reduce the manual effort spent trying to recover failed settlement transactions. The first is to automatically retry a settlement transaction and the second is to send an email to the customer prompting the customer to add a new credit card in Digital Self-Service (DSS).</p>\r\n\r\n<p>These two features can be implemented independently or together, depending on business needs. Here&#39;s how it works:</p>\r\n\r\n<ul>\r\n\t<li>A customer places an order online or in a Contact Center and the order has a valid authorization transaction.</li>\r\n\t<li>When&nbsp;settlement is attempted, the settlement transaction fails.</li>\r\n\t<li>If the automatic retry mechanism is configured, the payment component attempts the settlement transaction up to the number of times configured in the payment configuration parameter.\r\n\t<ul>\r\n\t\t<li>If the transaction is successful, the order processing continues.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>If the automatic retries fail, and the email and Digital Self-Service feature is permitted, an email is sent to the customer prompting to update their payment with a new credit card.\r\n\t<ul>\r\n\t\t<li>If the Digital Self Service feature is not permitted, retailers can pursue existing procedures to claim the funds.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>The customer clicks the DSS link from the email.</li>\r\n\t<li>In DSS, the customer adds new payment&nbsp;information.</li>\r\n</ul>\r\n\r\n<p>This guide gives an overview of the settlement resolution flow in&nbsp;Manhattan&nbsp;Active&reg; Omni&#39;s Order Management and&nbsp;Digital Self-Service&nbsp;applications.&nbsp; Note that Manhattan&#39;s Digital Self-Service application currently only integrates with Cybersource and Adyen Payment Gateways. See the<a hqid=\"2497831\" href=\"/curbsidepickup$dss implementation variations\"> Implementation Variations&nbsp;section</a> below for details.</p>\r\n\r\n<h3><a name=\"payment-resolution-in-digital-self-service\" id=\"payment-resolution-in-digital-self-service\"></a>Payment Resolution in Digital Self-Service</h3>\r\n\r\n<p>In the Digital Self-Service&nbsp;Payment Resolution page, the order total and balance due are displayed&nbsp;along with the items being ordered and order totals. For example, if a customer added a gift card and a credit card on the order and then navigated to the payment resolution page, then the customer would see the gift card applied on the Digital Self-Service&nbsp;page. Payment methods which are suspended are not displayed.</p>\r\n\r\n<p>The payment resolution page allows users to select from different payment methods, if configured. When the customer selects a new payment method&nbsp;and clicks on the &#39;Update Payment&#39; button on the Digital Self-Service page, the browser redirects to the third-party payment page. The customer&#39;s shipping address is used to pre-populate the billing address, which the customer can optionally edit. The shipping address is picked from the first order line, so if the first line is buy-online and pick-up in store or does not have an address, then the customer needs to enter their billing address.&nbsp;</p>\r\n\r\n<p>Currently, the customer cannot edit the amount to be charged. The full balance due is attempted for authorization.</p>\r\n\r\n<div class=\"tip\"><strong>Note : </strong>Instructions to enable different payment methods on the Payment Resolution page and configuring a payment gateway for each of them can be found&nbsp;in the&nbsp;<a href=\"https://omni.helpdocsonline.com/paybylink$multiple-payment-gateways-configuration\">Multiple Payment Gateways Configuration</a>&nbsp;section.</div>\r\n\r\n<h5>Digital Self-Service Integration with Payment Providers</h5>\r\n\r\n<p>Out of the box integration with CyberSource and Adyen is provided. CyberSource provides some UI themed capabilities, like changing the logo and background color. Refer to the CyberSource&nbsp;Secure Acceptance documentation for details.&nbsp;</p>\r\n\r\n<p>If the contact center is already using a secure hosted checkout with a different payment provider,&nbsp;then the integration may be similar to contact center, but separate effort is required to integrate the Digital Self-Service Payment Resolution&nbsp;page with the third party&nbsp;hosted checkout. The contact center integration cannot be reused as-is.&nbsp;</p>\r\n\r\n<p>There are a few key differences between the Digital Self-Service Payment Resolution hosted checkout and the contact center hosted checkout:</p>\r\n\r\n<ul>\r\n\t<li>In Digital Self-Service, the customer needs to add their billing address in the third party payment page. In the contact center, this is done on the contact center page before launching the third party page, so only the credit card details are captured in the third party page.</li>\r\n\t<li>Digital Self-Service redirects to the hosted checkout page, and then back to Digital Self-Service in the same browser window, so there is no popup window. In contact center, there is a popup window.</li>\r\n</ul>\r\n\r\n<h4><a name=\"digital-self-service-authentication\" id=\"digital-self-service-authentication\"></a>Digital Self-Service Authentication</h4>\r\n\r\n<p>See the <a hqid=\"2465749\" href=\"/overview-authentication$Accessing DSS and Authentication\">Overview & Authentication Guide </a>for information on accessing Digital Self-Service and for steps to configure authentication.</p>\r\n\r\n<h4><a name=\"customizing-for-your-brand\" id=\"customizing-for-your-brand\"></a>Customizing for your Brand</h4>\r\n\r\n<p>Digital Self-Service can be customized to reflect the look and feel of an individual brand. See the <a hqid=\"2465753\" href=\"/ui-theming-customization\">UI Theming & Customization Guide</a> for information on how the logo, fonts, colors, and labels can be customized.</p>\r\n\r\n<h4><a name=\"digital-self-service-localization\" id=\"digital-self-service-localization\"></a>Digital Self-Service Localization</h4>\r\n\r\n<p>Digital Self-Service can be translated into languages which are currently supported in Manhattan&nbsp;Active&reg; Omni. See the <a hqid=\"2465753\" href=\"/ui-theming-customization$DSS Localization\">UI Theming & Customization Guide </a>for information on localization.</p>\r\n\r\n<h3><a name=\"configuration\" id=\"configuration\"></a>Configuration</h3>\r\n\r\n<p>Below is a&nbsp;checklist of all configuration or interface mapping changes required to settlement payment resolution.</p>\r\n\r\n<p>*Indicates that help is required by Manhattan services to complete this configuration. Otherwise, configuration can be done within the application or on external, customer-owned systems.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 900px;\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"row\" style=\"width: 107px;\">Order & Email</th>\r\n\t\t\t<td style=\"width: 626px;\">\r\n\t\t\t<ul>\r\n\t\t\t\t<li>Populate the self-service host name, so the outbound order messages can form the full DSS URL*</li>\r\n\t\t\t\t<li>Enable the outbound Email Message or Publish Order messages for generating emails/texts</li>\r\n\t\t\t\t<li>Add the Settlement Recovery URL to existing Publish Order templates, to use in emails or texts</li>\r\n\t\t\t\t<li>Map the URL to existing emails or text messages to include a link to the Digital Self-Service settlement recovery</li>\r\n\t\t\t\t<li>Configure required component properties for component-email and component-message if using email/texts</li>\r\n\t\t\t\t<li>Set the &#39;Number of Attempts&#39; in the Payment Configuration UI as&nbsp;the number of attempts to try the settlement transaction automatically. This needs to be set for each Payment Type for which transactions will be automatically retried.&nbsp;</li>\r\n\t\t\t\t<li>Enable &#39;Retry Failure&#39; parameter in the Payment Configuration UI. This needs to be enabled for each Payment Type for which transactions will be automatically retried.&nbsp;\r\n\t\t\t\t<ul>\r\n\t\t\t\t</ul>\r\n\t\t\t\t</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t\t<td>See <a hqid=\"2497831\" href=\"/curbsidepickup$Order config\">detailed configuration steps here</a>.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"row\" style=\"width: 107px;\">Digital Self-Service</th>\r\n\t\t\t<td style=\"width: 626px;\">\r\n\t\t\t<ul>\r\n\t\t\t\t<li>Enable required&nbsp;feature flags*</li>\r\n\t\t\t\t<li>Modify CSS fonts, colors, and logo&nbsp;to match your brand*</li>\r\n\t\t\t\t<li>Link the header logo to your e-commerce site or other URL (optional)</li>\r\n\t\t\t\t<li>Configure a user to be used by the Digital Self-Service UI for authenticating with backend APIs*</li>\r\n\t\t\t\t<li>If localization is required, verify, and update&nbsp;localized labels for supported locales. *</li>\r\n\t\t\t\t<li>If localization is required, ensure the orderLocale is populated with imported orders.</li>\r\n\t\t\t\t<li>Review the <a hqid=\"2465753\" href=\"/ui-theming-customization\">UI labels and error messages</a>, and customize as needed to fit your branding.</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t\t<td>See <a hqid=\"2497831\" href=\"/curbsidepickup$DSS Config\">detailed configuration steps here</a>.</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h4>&nbsp;</h4>\r\n\r\n<h4><a name=\"order-configuration\" id=\"order-configuration\"></a><a id=\"Order config\" name=\"Order config\"></a>Order Configuration</h4>\r\n\r\n<h5>Include&nbsp;DSS Link in Outbound Messages for Emails or Texts</h5>\r\n\r\n<p>For customers to access the self-service payment resolution page, a new email template must be added and a link to the DSS page must be provided in the email.&nbsp;This is typically triggered when payment failure is detected and the maximum number of attempts has been made for that transaction.</p>\r\n\r\n<p style=\"text-align: justify;\">With the help of services, populate the component property order.selfServiceHostName with the host information for Digital-Self Service in Order Component (path: CONFIG/COM-MANH-CP-ORDER,OM-SIDE/&nbsp;). This ensures that the DSS URL is ready to be included in emails or text messages. In the order component consul server config, add a value such as &quot;https://abc.manh.com&quot; for the selfServiceHostName property. Be sure to configure this with &quot;https:&quot; not &quot;http:&quot;.</p>\r\n\r\n<h4>&nbsp;</h4>\r\n\r\n<h4><a name=\"digital-self-service-configuration\" id=\"digital-self-service-configuration\"></a><a id=\"DSS Config\" name=\"DSS Config\"></a>Digital Self-Service Configuration</h4>\r\n\r\n<p>For the above list of required configurations in Digital Self-Service, below are some additional details.</p>\r\n\r\n<h5>Configure a User for the Digital Self-Service UI to authenticate with backend APIs*</h5>\r\n\r\n<p>See the <a hqid=\"2465749\" href=\"/overview-authentication$Accessing DSS and Authentication\">Overview & Authentication Guide </a>for&nbsp;steps to configure authentication.</p>\r\n\r\n<h5>Configuration to Customize for your Brand</h5>\r\n\r\n<p>For instructions to modify CSS fonts, colors, and logo to match your brand, see the <a hqid=\"2465753\" href=\"/ui-theming-customization\">UI Theming & Customization Guide</a>. To apply the updated CSS styling, work with services to update your environment.</p>\r\n\r\n<h5>Update Localized Labels</h5>\r\n\r\n<p>If multiple locales are required, view the Digital Self-Service UI in different locales by replacing the &quot;locale&quot; variable in the URL. For instance, to view the UI in French, replace &quot;locale=EN&quot; in the URL with &quot;locale=FR&quot;. After testing the UI in all required locales (typically the same list as e-comm supports), work with services to make any required updates to the localized values by following steps in&nbsp;the <a hqid=\"2465753\" href=\"/ui-theming-customization$DSS Localization\">UI Theming & Customization Guide</a>.</p>\r\n\r\n<h3><a name=\"feature-scope\" id=\"feature-scope\"></a>Feature Scope</h3>\r\n\r\n<p>The following features are not&nbsp;supported in the Payment Resolution&nbsp;feature:</p>\r\n\r\n<ul>\r\n\t<li>Integration with payment gateways other than Cybersource and Adyen.</li>\r\n\t<li>Keeping the payment transaction attempt &#39;open&#39;. The transaction is calculated and executed immediately in the UI.</li>\r\n\t<li>Push notifications in the contact center, to let the Customer Service Representative (CSR) know that payment has been added.</li>\r\n\t<li>Email notification that payment has been added.</li>\r\n\t<li>Adding custom buttons, links, text, panels to&nbsp;the Digital Self-Service&nbsp;UI (only the logo, font, colors, etc. can be customized per the styling guide).</li>\r\n\t<li>Populating the customer&#39;s country code phone prefix&nbsp;for customers created in the contact center.</li>\r\n</ul>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 14488,
  "scraped_at": "2025-08-09T22:33:49.338989"
}