{
  "id": "3574728",
  "permalink": "product-requests",
  "title": "Inventory Runner - Product Requests",
  "type": "topic",
  "level": 5,
  "path": "Manhattan Active® Omni/Store/Process & Configuration Guides/Store Inventory & Fulfillment/Store Inventory Management/Inventory Runner - Product Requests",
  "raw_item": {
    "id": "3574728",
    "text": "Inventory Runner - Product Requests",
    "title": "Inventory Runner - Product Requests",
    "permalink": "product-requests",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "134022",
    "parent": "f;134022",
    "created_date": "1742109246",
    "modified_date": "1746553207",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "4"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158410\" href=\"/store\" class=\"breadcrumb-links\">Store Inventory & Fulfillment</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2166732\" href=\"/store-inventory\" class=\"breadcrumb-links\">Store Inventory Management</a></li><li> <span>››</span>Inventory Runner - Product Requests</li></ul>  \t\r\n\t\t<h2>Inventory Runner - Product Requests</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/product-requests$overview\">Overview</a></li><li><a href=\"/product-requests$process\">Process</a></li><li><a href=\"/product-requests$product-requests\">Product Requests</a></li><li><a href=\"/product-requests$product-“request-details”\">Product “Request Details”</a><ul><li><a href=\"/product-requests$updates\">Updates</a></li></ul></li><li><a href=\"/product-requests$configuration\">Configuration</a><ul><li><a href=\"/product-requests$assign-permissions\">Assign Permissions</a></li><li><a href=\"/product-requests$enable-push-notifications\">Enable Push Notifications</a><ul><li><a href=\"/product-requests$copy-required-profile-purposes\">Copy required profile purposes</a></li><li><a href=\"/product-requests$make-the-push-notification-persistent\">Make the push notification persistent</a></li><li><a href=\"/product-requests$define-custom-sound-for-the-push-notification\">Define custom sound for the push notification</a></li></ul></li><li><a href=\"/product-requests$configure-store-product-request-locations\">Configure Store Product Request Locations</a><ul><li><a href=\"/product-requests$sync-your-provisioning-profile\">Sync your provisioning profile</a></li><li><a href=\"/product-requests$log-out-and-log-back-into-omni-facade\">Log out and log back into Omni Facade</a></li><li><a href=\"/product-requests$add-nbsp-store-product-request-locations\">Add&nbsp;Store Product Request Locations</a></li></ul></li><li><a href=\"/product-requests$enable-locate-item\">Enable Locate Item</a><ul><li><a href=\"/product-requests$copy-the-required-profile-purpose\">Copy the required profile purpose</a></li><li><a href=\"/product-requests$enable-the-rfid-locate-item-configuration\">Enable the RFID Locate Item configuration</a></li><li><a href=\"/product-requests$assign-the-required-permissions\">Assign the required permissions</a></li></ul></li><li><a href=\"/product-requests$enable-view-on-map\">Enable View on Map</a><ul><li><a href=\"/product-requests$enable-the-required-overhead-rfid-configuration\">Enable the required overhead RFID configuration</a></li><li><a href=\"/product-requests$assign-the-required-permissions\">Assign the required permissions</a></li></ul></li></ul></li><li><a href=\"/product-requests$troubleshooting\">Troubleshooting</a></li><li><a href=\"/product-requests$services\">Services</a></li></ul></div>\r\n\r\n<h4><a name=\"overview\" id=\"overview\"></a>Overview</h4>\r\n\r\n<p>For situations where a customer requests&nbsp;an item which is not available in the storefront but is available in the backroom and the store associate wants to keep the customer engaged while the required item is moved from the backroom to the storefront, the associate attending to the customer can request fellow associates (also known as runners) to fetch the required item for them. This not only helps the retailers deliver exceptional service to their customers but also helps them increase their overall engagement with them.</p>\r\n\r\n<h4><a name=\"process\" id=\"process\"></a>Process</h4>\r\n\r\n<p>The following is a typical process flow of how product requests work:</p>\r\n\r\n<ol>\r\n\t<li>A customer walks into a store and happens to like an item. They, however, are unable to find the required item in their preferred size or color.&nbsp;</li>\r\n\t<li>They approach a store associate and ask them to check if their preferred size or color is available in the store.</li>\r\n\t<li>The store associate checks into one of the following two UIs in the Manhattan Active® Omni Store app.\r\n\t<ol>\r\n\t\t<li>Manhattan Active® Omni Store Inventory Management’s View Inventory</li>\r\n\t\t<li>Manhattan Active® Omni Iris Point of Sale’s Catalog Product Details&nbsp;</li>\r\n\t</ol>\r\n\t</li>\r\n\t<li>They determine that their store does have the required item available in the customer's preferred size / color. They reckon that if the item is not available in the storefront, it is most likely stocked in the backroom.</li>\r\n\t<li>From their current UI itself, they place a product request for the required item. While placing their request, they also specify their current location.</li>\r\n\t<li>As soon as a product request is created, a push notification is triggered to the rest of the store associates in the store.</li>\r\n\t<li>Any store associate who is available and has the required permissions assigned to them can take the request up for execution.</li>\r\n\t<li>Any store associate can straightaway reject the request if they already know that the requested item is either unavailable or is not in a sale-worthy&nbsp;condition.</li>\r\n\t<li>Alternatively, any available store associate can accept the request, go to the backroom, and start searching for the requested item. This is when the store associate assumes the role of a product runner for the purpose of this request.</li>\r\n\t<li>While the runner is searching for the item, the requestor can monitor the status of their request in real time.</li>\r\n\t<li>Once the runner finds the item, they hand it over to the requestor at their specified location and mark the request as complete.</li>\r\n\t<li>Any store associate who has the required permissions can cancel or reject a product request in close coordination with the runner / requestor, at any time, before or after the acceptance of the request. A request can be canceled for any reason. For example, the requesting customer doesn’t want to wait, or they decide to buy some other item.&nbsp;</li>\r\n</ol>\r\n\r\n<div class=\"tip\"><b>Note: </b>The “Product Request” functionality is available on the Iris POS Catalog Product Details Page only. It is not added to the Classic POS.</div>\r\n\r\n<div class=\"tip\"><b>Note:</b> For more details on how to create product requests via the MA Omni Store Inventory Management’s View Inventory UI, refer to <a href=\"https://omni.helpdocsonline.com/store-inventory-process$inventory-runner-product-requests\">this</a> page.&nbsp;</div>\r\n\r\n<div class=\"tip\"><b>Note: </b>For more details on how to create product requests using the MA Omni Iris Point of Sale’s Catalog product details page, refer to <a href=\"https://omni.helpdocsonline.com/product_catalog_process-2$inventory-runner-product-requests\">this</a> documentation.&nbsp;</div>\r\n\r\n<h4><a name=\"product-requests\" id=\"product-requests\"></a>Product Requests</h4>\r\n\r\n<p>As soon as a product request is created, a “New Product Request” push notification is displayed to all the users (barring the requestor themselves) in the respective store. Any available store associate can tap on the “View” button provided as part of the push notification to start working on the request. When a store associate taps on the “View” button, they are led to the “Product Requests” UI.</p>\r\n\r\n<p>The “New Product Request” push notification can be configured to be persistent which needs to be explicitly dismissed, using the “Dismiss” button, provided as part of the push notification, by store associates who are busy. When such persistent push notifications are dismissed, they are added to the bell icon notifications panel from where a store associate&nbsp;can take up requests for execution once they have some spare time. Owing to their time sensitivity, the count of “open unacknowledged” product requests is displayed as the top most item in the notifications panel along with the “View” and “Dismiss” buttons. Available store associates can tap on the “View” button to view the list of “Open” Product Requests. An “Open” request is a request which is yet to be accepted by a store associate for execution. Alternatively, busy store associates may straightaway “Dismiss” the product requests from the notifications panel.</p>\r\n\r\n<p>In addition to the “View” buttons in the push notification and the bell icon notifications panel, store associates can access the product requests by directly tapping on the “Product Requests” menu in the “Inventory” section of the MA Store app. Irrespective of how the store associate lands on the Product Requests UI, it always displays the “Open” product requests by default in the ascending order of their created date time. A store associate needs to have the required <a href=\"https://omni.helpdocsonline.com/ID2765417$product_requests_menu\">permission</a> assigned to at least one of their roles to be able to view the Product Requests UI. A badge count, denoting the count of “Open” product requests for the user’s logged-in location, is also displayed as part of the menu.</p>\r\n\r\n<p>The Product Requests list UI has the following filters that store associates&nbsp;can leverage:</p>\r\n\r\n<ol>\r\n\t<li><b>Open</b> (<i>Default</i>): Lists those requests which are still in the “Open” status for the logged-in store, i.e., requests which are yet to be accepted by a store associate for execution</li>\r\n\t<li><b>In Progress:&nbsp;</b>Lists the requests which are work in progress at the logged-in location, i.e., requests which have been accepted by a user but are yet to be closed</li>\r\n\t<li><b>Open and In Progress:&nbsp;</b>Predominantly meant for store managers to enable them to monitor the progress of product requests in their respective store; displays the list of ”Open” and “In Progress” requests for the logged-in store</li>\r\n\t<li><b>Created by me:&nbsp;</b>Primarily built for the requestors to help them monitor the status of their requests; displays all the requests created by the logged-in user.</li>\r\n\t<li><b>Closed:&nbsp;</b>Enlists the requests which have reached their logical conclusion. More specifically, the requests which are in the following status at the logged-in store:\r\n\t<ol>\r\n\t\t<li><i>Completed</i> - A request is expected to be marked as “Completed” after the runner has handed over the requested item to the requestor</li>\r\n\t\t<li><i>Rejected</i> - A request is expected to be “Rejected” if the requested item is either not available or is not in a sale-worthy&nbsp;condition</li>\r\n\t\t<li><i>Cancelled</i> - A request can be “Cancelled” for any reason. For example, the customer may decide to not to wait anymore, or they may decide to buy any other item.</li>\r\n\t</ol>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Regardless of the filter selected by the store associate, the product requests are always displayed in the ascending order of their created date and time, i.e., new to old. The “Results” count in the top right corner always displays the total number of requests which are filtered as a result of the selected filter. However, the product requests list is paginated and a maximum of 20 records are displayed on screen load. If the store associate goes to the bottom of the page and scrolls down further below, the next 20 records (maximum) are displayed and so on and so forth.&nbsp;</p>\r\n\r\n<div class=\"tip\"><b>Note: </b>Product Requests are retained for 30 days from their created date and time and purged thereafter. If a retailer wishes to alter the purge duration, they are required to reach out to Manhattan support.</div>\r\n\r\n<p>For each of the requests, the Product Requests UI displays the following:</p>\r\n\r\n<ol>\r\n\t<li>The requestor’s name. If the user's name is not configured, then their user ID is displayed.</li>\r\n\t<li>The location that the requestor specifies when they place the product request. It can either be a configurable <a href=\"https://omni.helpdocsonline.com/product-requests$configure-store-product-request-locations\">Store Product Request Location</a> or the requestor’s name itself (<em>default</em>).</li>\r\n\t<li>An indication of when the request was placed.</li>\r\n\t<li>Requested item details, more specifically, the item image, item’s short description, its style, color, size, and UPC.</li>\r\n\t<li>Status of the request - Open / In Progress / Completed / Rejected / Cancelled</li>\r\n\t<li>Assignee / Completed By / Rejected By / Cancelled By for In Progress / Completed / Rejected / Cancelled status respectively - Name of the store associate who accepted / completed / rejected / canceled the request along with an indication of the time when the respective operation was carried out</li>\r\n</ol>\r\n\r\n<p>Any store associate who has the required <a href=\"https://omni.helpdocsonline.com/ID2765417$Product_Requests\">permissions</a> can leverage the Product Requests UI to execute the following actions:</p>\r\n\r\n<ol>\r\n\t<li>For an “Open” request, they can tap on the “Accept” button, which moves the request to the “In Progress” status and indicates that they have accepted and started working on the request.</li>\r\n\t<li>For an “In Progress” request, they can tap on the “Complete” button which marks the request as “Completed” and implies that they have delivered the requested item to the requestor.</li>\r\n\t<li>For any request, they can tap on the “View Details” button to head on to the Request Details UI to view more details about the request and then decide on what to do next.</li>\r\n\t<li>They can tap on the refresh icon provided in the top right corner of the UI to refresh the product requests within the selected filter.</li>\r\n\t<li>For an “Open” or “In Progress” request, they can tap on the “Reject” button, available in the more menu, in the event that the requested item’s inventory is either not available or not in a salable&nbsp;condition. This moves the corresponding request to “Rejected” status.</li>\r\n\t<li>For an “Open” or “In Progress” request, they can tap on the “Cancel” button, present in the more menu, in the event that the requested item is not required anymore. This marks the request as “Cancelled”.</li>\r\n\t<li>In the case of handheld RFID integrations, if a store associate needs help locating an item, they can tap on the “Locate Item” button in the more menu to initiate the RFID gun’s locate functionality, which gives audio and visual cues to the store associate, thereby assisting them in finding the nearest unit of the requested item from their current location. This functionality is protected by a <a href=\"https://omni.helpdocsonline.com/product-requests$enable-locate-item\">business configuration</a> in addition to a user action <a href=\"https://omni.helpdocsonline.com/ID2765417$product_requests_locate_item\">permission</a>.</li>\r\n\t<li>In the case of overhead RFID integrations, if a store associate needs help locating an item, they can tap on the “View on Map” button in the more menu. This opens up an Inventory Map which uses the overhead RFID feeds to plot the requested items’ location(s) on the logged-in store’s map, thus aiding the store associate in finding the requested item. This functionality is protected by a <a href=\"https://omni.helpdocsonline.com/product-requests$enable-view-on-map\">business configuration</a> in addition to a user action <a href=\"https://omni.helpdocsonline.com/ID2765417$product_requests_view_on_map\">permission</a>.</li>\r\n</ol>\r\n\r\n<div class=\"tip\"><b>Note: </b>For more details on how the “Locate Item” functionality works, refer to <a href=\"https://omni.helpdocsonline.com/storerfid$inventory-runner-product-requests-nbsp-locate-item\">this</a> link.</div>\r\n\r\n<div class=\"tip\"><b>Note: </b>For more information on how the MA Store app integrates with overhead RFID readers, refer to its <a href=\"https://omni.helpdocsonline.com/storerfid$overhead\">documentation</a>. For more details on what the “View on Map” functionality specifically does, refer to <a href=\"https://omni.helpdocsonline.com/storerfid$view-on-map\">this</a> link.</div>\r\n\r\n<h4><a name=\"product-“request-details”\" id=\"product-“request-details”\"></a>Product “Request Details”</h4>\r\n\r\n<p>The Product “Request Details” UI is displayed when a store associate either selects a request in the list UI and then taps on the “View Details” button or they “Accept” a request using the list UI.</p>\r\n\r\n<p>The Request Details UI displays the following additional details on top of those already displayed in the List UI.</p>\r\n\r\n<ol>\r\n\t<li>All the media images configured in the Items master for the requested item. A smaller preview is displayed in the form of thumbnails which the store associates can tap on to view larger images.</li>\r\n\t<li>SKU or Item ID of the requested Item</li>\r\n\t<li>Department of the requested Item</li>\r\n</ol>\r\n\r\n<p>As is the case with the list UI, a store associate can utilize the details UI to:</p>\r\n\r\n<ol>\r\n\t<li>“Accept” on Open request</li>\r\n\t<li>“Complete” an In Progress request</li>\r\n\t<li>“Reject” an&nbsp;“Open” or “In Progress” request which can't be fulfilled due to inventory unavailability</li>\r\n\t<li>“Cancel” an unwanted “Open” or “In Progress” request</li>\r\n\t<li>“Locate” the requested “Item” with the help of a handheld RFID gun</li>\r\n\t<li>“View” the requested item “on <i>a</i> Map” in the case of an integration with overhead RFID readers</li>\r\n</ol>\r\n\r\n<p>Moreover, a store associate can tap on the “Back to List” button on the details UI to go back to the list UI.</p>\r\n\r\n<p>Similar to the list UI, the “Accept”, “Complete”, “Reject”, and “Cancel” buttons are protected by user <a href=\"https://omni.helpdocsonline.com/ID2765417$product_request_details_accept\">permissions</a> in the details UI as well. This is true for the “Back to List” button as well. The “Locate Item” and “View on Map” actions require <a href=\"https://omni.helpdocsonline.com/product-requests$enable-locate-item\">business configurations</a> to be enabled in addition to user&nbsp;<a href=\"https://omni.helpdocsonline.com/ID2765417$product_request_details_locate_item\">permissions</a>.</p>\r\n\r\n<h5><a name=\"updates\" id=\"updates\"></a>Updates</h5>\r\n\r\n<p>Whenever a product request is accepted, completed, rejected, or canceled, the status of the product request which is created in open status is updated to In Progress, Completed, Rejected, and Cancelled respectively. Furthermore, the name&nbsp;and user ID of the store associate and the time at which the operation is carried out are recorded.</p>\r\n\r\n<h4><a name=\"configuration\" id=\"configuration\"></a><a id=\"configuration\" name=\"configuration\"></a>Configuration</h4>\r\n\r\n<p>Enable the following configuration to implement the \"Product Requests\" feature.</p>\r\n\r\n<ol>\r\n\t<li>\r\n\t<h5><a name=\"assign-permissions\" id=\"assign-permissions\"></a><b>Assign Permissions</b></h5>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Product Requests functionality&nbsp;is primarily protected by user action permissions. To enable this functionality, assign these <a href=\"https://omni.helpdocsonline.com/ID2765417$Product_Requests\">permissions</a> to at least one of the roles of the required users.</p>\r\n\r\n<ol start=\"2\">\r\n\t<li>\r\n\t<h5><a name=\"enable-push-notifications\" id=\"enable-push-notifications\"></a><b>Enable Push Notifications</b></h5>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Execute the following steps to enable push notifications for product requests.&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>\r\n\t<h6><a name=\"copy-required-profile-purposes\" id=\"copy-required-profile-purposes\"></a><u><strong>Copy required profile purposes</strong></u></h6>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Copy the following base profile purposes to your&nbsp;custom profile: <strong>ful::notificationConfig, </strong>and<strong> ful::fulfillmentConfig</strong></p>\r\n\r\n<ol start=\"2\">\r\n\t<li>\r\n\t<h6><a name=\"make-the-push-notification-persistent\" id=\"make-the-push-notification-persistent\"></a><u><strong>Make the push notification persistent</strong></u></h6>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Considering the time sensitivity of the product requests, <strong>Manhattan Associates recommends that “New product request” push notifications are made persistent.</strong> This can be achieved by a generic push notification business configuration which affects all push notifications except “New pickup order”. This configuration resides in the “<b>Push Notification</b>” tab of the <b>Store Fulfillment Parameters</b>. Turning it on will not only make the “New product request” push notification persistent, but it will also start displaying the requestor’s name as part of the push notification. It is disabled by default.&nbsp;</p>\r\n\r\n<div class=\"computer_code\"><strong>Configuration Name:</strong> Enable \"DISMISS\" button for all push notifications</div>\r\n\r\n<ol start=\"3\">\r\n\t<li>\r\n\t<h6><a name=\"define-custom-sound-for-the-push-notification\" id=\"define-custom-sound-for-the-push-notification\"></a><u><strong>Define custom sound for the push notification</strong></u></h6>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Bearing the time sensitivity of the product requests in mind, retailers may want to assign a custom sound to the “New product request” push notification to enable the store associates to differentiate it from others. Custom sounds can be configured using the “<b>Push Notification Sound</b>” tab of the <b>Store Fulfillment Parameters</b>. For more details on push notification sounds, refer to <a href=\"https://omni.helpdocsonline.com/push-notification$push-notification-sounds\">this</a> documentation. A default sound is already configured out of the box if the ful::fulfillmentConfig profile purpose is copied over from the base to your custom profile.</p>\r\n\r\n<div class=\"computer_code\"><strong>Push Notification Type</strong>: New Product Request</div>\r\n\r\n<ol start=\"3\">\r\n\t<li>\r\n\t<h5><a name=\"configure-store-product-request-locations\" id=\"configure-store-product-request-locations\"></a><b>Configure Store Product Request Locations</b></h5>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Out of the box, the delivery location drop-down list in the Request Product popup in the MA Store Inventory Management’s View Inventory UI and the MA Iris Point of Sale’s Catalog Product Details Page are non-editable and are only populated with the requestor’s name / user ID. However, a retailer may optionally configure frequently used delivery locations. If configured, these are also populated in the delivery location drop-down list in addition to the requestor’s name / user ID. Execute the following steps to configure Store Product Request Locations.</p>\r\n\r\n<ol>\r\n\t<li>\r\n\t<h6><a name=\"sync-your-provisioning-profile\" id=\"sync-your-provisioning-profile\"></a><strong><u>Sync your provisioning profile</u></strong></h6>\r\n\t</li>\r\n</ol>\r\n\r\n<p>A new profile purpose has been added as part of the Store Product Request Locations configuration. This requires you to sync your organization’s active provisioning profile.</p>\r\n\r\n<ol start=\"2\">\r\n\t<li>\r\n\t<h6><a name=\"log-out-and-log-back-into-omni-facade\" id=\"log-out-and-log-back-into-omni-facade\"></a><strong><u>Log out and log back into Omni Facade</u></strong></h6>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Once the sync is done, log out and log back into Omni Facade. When this is done, ensure that the <strong>sim::productReqConfig</strong> profile purpose starts appearing in your organization’s active provisioning profile details.</p>\r\n\r\n<ol start=\"3\">\r\n\t<li>\r\n\t<h6><a name=\"add-nbsp-store-product-request-locations\" id=\"add-nbsp-store-product-request-locations\"></a><strong><u>Add&nbsp;Store Product Request Locations</u></strong></h6>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Configure the most frequently used delivery locations. No locations are configured out of the box. “Delivery Location Name” is used to define the localizable name which is localized based on the logged-in user’s locale. If no “Delivery Location Name” is configured, then “Delivery Location ID” is displayed as configured in the “Request Product” popup. “Sequence” is used to define the sequence in which the delivery locations are displayed in the drop-down list. If no sequence is defined, then the delivery locations are displayed in the ascending order of their created date time.</p>\r\n\r\n<div class=\"computer_code\"><strong>Configuration Name</strong>: Store Product Request Locations</div>\r\n\r\n<ol start=\"4\">\r\n\t<li>\r\n\t<h5><a name=\"enable-locate-item\" id=\"enable-locate-item\"></a><strong>Enable Locate Item</strong></h5>\r\n\t</li>\r\n</ol>\r\n\r\n<p>In the case of handheld RFID integrations, execute the following steps to enable the \"Locate Item\" capability as part of the \"Product Requests\" functionality.</p>\r\n\r\n<ol>\r\n\t<li>\r\n\t<h6><a name=\"copy-the-required-profile-purpose\" id=\"copy-the-required-profile-purpose\"></a><strong><u>Copy the required profile purpose</u></strong></h6>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Copy the base profile purpose, <strong>sto::storeConfig</strong>, mentioned as part of the <a href=\"https://omni.helpdocsonline.com/storerfid$configuration\">Store RFID configuration</a>, to your custom profile.</p>\r\n\r\n<ol start=\"2\">\r\n\t<li>\r\n\t<h6><a name=\"enable-the-rfid-locate-item-configuration\" id=\"enable-the-rfid-locate-item-configuration\"></a><u><strong>Enable the RFID Locate Item configuration</strong></u></h6>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Enable the RFID Locate Item configuration documented <a href=\"https://omni.helpdocsonline.com/ID2195072$rfid_locate_item_product_requests\">here</a>.&nbsp;</p>\r\n\r\n<ol start=\"3\">\r\n\t<li>\r\n\t<h6><a name=\"assign-the-required-permissions\" id=\"assign-the-required-permissions\"></a><strong><u>Assign the required permissions</u></strong></h6>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Assign the required permissions - <a href=\"https://omni.helpdocsonline.com/ID2765417$product_requests_locate_item\">Product Requests List</a>, and <a href=\"https://omni.helpdocsonline.com/ID2765417$product_request_details_locate_item\">Product Requests Details</a>.</p>\r\n\r\n<ol start=\"5\">\r\n\t<li>\r\n\t<h5><a name=\"enable-view-on-map\" id=\"enable-view-on-map\"></a><strong>Enable View on Map</strong></h5>\r\n\t</li>\r\n</ol>\r\n\r\n<p>In the case of overhead RFID integrations, enable the following configurations to enable the \"View on Map\" capability as part of the \"Product Requests\" functionality.</p>\r\n\r\n<ol>\r\n\t<li>\r\n\t<h6><a name=\"enable-the-required-overhead-rfid-configuration\" id=\"enable-the-required-overhead-rfid-configuration\"></a><strong><u>Enable the required overhead RFID configuration</u></strong></h6>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Refer to <a href=\"https://omni.helpdocsonline.com/storerfid$overhead-configuration\">this</a> documentation to enable the configurations needed to integrate the MA Store app with overhead RFID readers.</p>\r\n\r\n<ol start=\"2\">\r\n\t<li>\r\n\t<h6><a name=\"assign-the-required-permissions\" id=\"assign-the-required-permissions\"></a><strong><u>Assign the required permissions</u></strong></h6>\r\n\t</li>\r\n</ol>\r\n\r\n<p>Assign the required permissions - <a href=\"https://omni.helpdocsonline.com/ID2765417$product_requests_view_on_map\">Product Requests List</a>, and <a href=\"https://omni.helpdocsonline.com/ID2765417$product_request_details_view_on_map\">Product Requests Details</a>.</p>\r\n\r\n<h4><a name=\"troubleshooting\" id=\"troubleshooting\"></a>Troubleshooting</h4>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\">Issue</th>\r\n\t\t\t<th scope=\"col\">Troubleshooting Tip</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p>Unable to see the \"Request\" action in the MA Store Inventory Management's View Inventory UI or MA Iris Point of Sale's Product Details Page or unable to carry out one or more actions as part of the \"Product Requests\" functionality.</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Ensure that the user has the required <a href=\"https://omni.helpdocsonline.com/ID2765417$Product_Requests\">permissions</a> assigned</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Store associates do not get a push notification when a product request is created.</td>\r\n\t\t\t<td>Ensure that the&nbsp;<strong>ful::notificationConfig&nbsp;</strong>base profile purpose is copied to your custom profile</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\"New product request\" push notifications are not persistent</td>\r\n\t\t\t<td>Ensure that the required <a href=\"https://omni.helpdocsonline.com/product-requests$make-the-push-notification-persistent\">configuration</a> is turned on.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>\"New product request\" push notifications are not accompanied by any sound.</td>\r\n\t\t\t<td>Ensure that the required <a href=\"http://omni.helpdocsonline.com/push-notification$push-notification-sounds\">configuration</a> is enabled.</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Getting the \"ProfilePurpose not found for the ProfilePurposeId sim::productReqConfig, hence not authorized to create/updated/delete the data corresponding to the profile JUNK_PROFILE (fwp::61023)\" while trying to create a Store Product Request Location</td>\r\n\t\t\t<td>Ensure that your organization's active provisioning profile is sync'd. Log out and then log back into Omni Facade. Ensure that the&nbsp;<strong>sim::productReqConfig&nbsp;</strong>profile purpose shows up in your organization's active provisioning details and then try creating a Store Product Request Location again.</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h4><a name=\"services\" id=\"services\"></a>Services</h4>\r\n\r\n<p>The following APIs have been developed as part of this functionality.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 973px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\" style=\"width: 170px;\">Service</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 182px;\">Component</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 198px;\">Group</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 416px;\">Service Endpoint</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 156px;\">\r\n\t\t\t<p>List Product Requests</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 168px;\">\r\n\t\t\t<p>SIM</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 184px;\">\r\n\t\t\t<p>Product Request Controller</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 402px;\">\r\n\t\t\t<p>/sim/api/sim/productRequest/list</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 156px;\">\r\n\t\t\t<p>Save Product Requests</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 168px;\">\r\n\t\t\t<p>SIM</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 184px;\">\r\n\t\t\t<p>Product Request Controller</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"width: 402px;\">\r\n\t\t\t<p>/sim/api/sim/productRequest/save</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 30505,
  "scraped_at": "2025-08-09T22:04:59.966009",
  "content_clean": "Home ››Manhattan Active® Omni››Store››Process & Configuration Guides››Store Inventory & Fulfillment››Store Inventory Management ››Inventory Runner - Product Requests Inventory Runner - Product Requests OverviewProcessProduct RequestsProduct “Request Details”UpdatesConfigurationAssign PermissionsEnable Push NotificationsCopy required profile purposesMake the push notification persistentDefine custom sound for the push notificationConfigure Store Product Request LocationsSync your provisioning profileLog out and log back into Omni FacadeAdd Store Product Request LocationsEnable Locate ItemCopy the required profile purposeEnable the RFID Locate Item configurationAssign the required permissionsEnable View on MapEnable the required overhead RFID configurationAssign the required permissionsTroubleshootingServices Overview For situations where a customer requests an item which is not available in the storefront but is available in the backroom and the store associate wants to keep the customer engaged while the required item is moved from the backroom to the storefront, the associate attending to the customer can request fellow associates (also known as runners) to fetch the required item for them. This not only helps the retailers deliver exceptional service to their customers but also helps them increase their overall engagement with them. Process The following is a typical process flow of how product requests work: A customer walks into a store and happens to like an item. They, however, are unable to find the required item in their preferred size or color. They approach a store associate and ask them to check if their preferred size or color is available in the store. The store associate checks into one of the following two UIs in the Manhattan Active® Omni Store app. Manhattan Active® Omni Store Inventory Management’s View Inventory Manhattan Active® Omni Iris Point of Sale’s Catalog Product Details They determine that their store does have the required item available in the customer's preferred size / color. They reckon that if the item is not available in the storefront, it is most likely stocked in the backroom. From their current UI itself, they place a product request for the required item. While placing their request, they also specify their current location. As soon as a product request is created, a push notification is triggered to the rest of the store associates in the store. Any store associate who is available and has the required permissions assigned to them can take the request up for execution. Any store associate can straightaway reject the request if they already know that the requested item is either unavailable or is not in a sale-worthy condition. Alternatively, any available store associate can accept the request, go to the backroom, and start searching for the requested item. This is when the store associate assumes the role of a product runner for the purpose of this request. While the runner is searching for the item, the requestor can monitor the status of their request in real time. Once the runner finds the item, they hand it over to the requestor at their specified location and mark the request as complete. Any store associate who has the required permissions can cancel or reject a product request in close coordination with the runner / requestor, at any time, before or after the acceptance of the request. A request can be canceled for any reason. For example, the requesting customer doesn’t want to wait, or they decide to buy some other item. Note: The “Product Request” functionality is available on the Iris POS Catalog Product Details Page only. It is not added to the Classic POS. Note: For more details on how to create product requests via the MA Omni Store Inventory Management’s View Inventory UI, refer to this page. Note: For more details on how to create product requests using the MA Omni Iris Point of Sale’s Catalog product details page, refer to this documentation. Product Requests As soon as a product request is created, a “New Product Request” push notification is displayed to all the users (barring the requestor themselves) in the respective store. Any available store associate can tap on the “View” button provided as part of the push notification to start working on the request. When a store associate taps on the “View” button, they are led to the “Product Requests” UI. The “New Product Request” push notification can be configured to be persistent which needs to be explicitly dismissed, using the “Dismiss” button, provided as part of the push notification, by store associates who are busy. When such persistent push notifications are dismissed, they are added to the bell icon notifications panel from where a store associate can take up requests for execution once they have some spare time. Owing to their time sensitivity, the count of “open unacknowledged” product requests is displayed as the top most item in the notifications panel along with the “View” and “Dismiss” buttons. Available store associates can tap on the “View” button to view the list of “Open” Product Requests. An “Open” request is a request which is yet to be accepted by a store associate for execution. Alternatively, busy store associates may straightaway “Dismiss” the product requests from the notifications panel. In addition to the “View” buttons in the push notification and the bell icon notifications panel, store associates can access the product requests by directly tapping on the “Product Requests” menu in the “Inventory” section of the MA Store app. Irrespective of how the store associate lands on the Product Requests UI, it always displays the “Open” product requests by default in the ascending order of their created date time. A store associate needs to have the required permission assigned to at least one of their roles to be able to view the Product Requests UI. A badge count, denoting the count of “Open” product requests for the user’s logged-in location, is also displayed as part of the menu. The Product Requests list UI has the following filters that store associates can leverage: Open (Default): Lists those requests which are still in the “Open” status for the logged-in store, i.e., requests which are yet to be accepted by a store associate for execution In Progress: Lists the requests which are work in progress at the logged-in location, i.e., requests which have been accepted by a user but are yet to be closed Open and In Progress: Predominantly meant for store managers to enable them to monitor the progress of product requests in their respective store; displays the list of ”Open” and “In Progress” requests for the logged-in store Created by me: Primarily built for the requestors to help them monitor the status of their requests; displays all the requests created by the logged-in user. Closed: Enlists the requests which have reached their logical conclusion. More specifically, the requests which are in the following status at the logged-in store: Completed - A request is expected to be marked as “Completed” after the runner has handed over the requested item to the requestor Rejected - A request is expected to be “Rejected” if the requested item is either not available or is not in a sale-worthy condition Cancelled - A request can be “Cancelled” for any reason. For example, the customer may decide to not to wait anymore, or they may decide to buy any other item. Regardless of the filter selected by the store associate, the product requests are always displayed in the ascending order of their created date and time, i.e., new to old. The “Results” count in the top right corner always displays the total number of requests which are filtered as a result of the selected filter. However, the product requests list is paginated and a maximum of 20 records are displayed on screen load. If the store associate goes to the bottom of the page and scrolls down further below, the next 20 records (maximum) are displayed and so on and so forth. Note: Product Requests are retained for 30 days from their created date and time and purged thereafter. If a retailer wishes to alter the purge duration, they are required to reach out to Manhattan support. For each of the requests, the Product Requests UI displays the following: The requestor’s name. If the user's name is not configured, then their user ID is displayed. The location that the requestor specifies when they place the product request. It can either be a configurable Store Product Request Location or the requestor’s name itself (default). An indication of when the request was placed. Requested item details, more specifically, the item image, item’s short description, its style, color, size, and UPC. Status of the request - Open / In Progress / Completed / Rejected / Cancelled Assignee / Completed By / Rejected By / Cancelled By for In Progress / Completed / Rejected / Cancelled status respectively - Name of the store associate who accepted / completed / rejected / canceled the request along with an indication of the time when the respective operation was carried out Any store associate who has the required permissions can leverage the Product Requests UI to execute the following actions: For an “Open” request, they can tap on the “Accept” button, which moves the request to the “In Progress” status and indicates that they have accepted and started working on the request. For an “In Progress” request, they can tap on the “Complete” button which marks the request as “Completed” and implies that they have delivered the requested item to the requestor. For any request, they can tap on the “View Details” button to head on to the Request Details UI to view more details about the request and then decide on what to do next. They can tap on the refresh icon provided in the top right corner of the UI to refresh the product requests within the selected filter. For an “Open” or “In Progress” request, they can tap on the “Reject” button, available in the more menu, in the event that the requested item’s inventory is either not available or not in a salable condition. This moves the corresponding request to “Rejected” status. For an “Open” or “In Progress” request, they can tap on the “Cancel” button, present in the more menu, in the event that the requested item is not required anymore. This marks the request as “Cancelled”. In the case of handheld RFID integrations, if a store associate needs help locating an item, they can tap on the “Locate Item” button in the more menu to initiate the RFID gun’s locate functionality, which gives audio and visual cues to the store associate, thereby assisting them in finding the nearest unit of the requested item from their current location. This functionality is protected by a business configuration in addition to a user action permission. In the case of overhead RFID integrations, if a store associate needs help locating an item, they can tap on the “View on Map” button in the more menu. This opens up an Inventory Map which uses the overhead RFID feeds to plot the requested items’ location(s) on the logged-in store’s map, thus aiding the store associate in finding the requested item. This functionality is protected by a business configuration in addition to a user action permission. Note: For more details on how the “Locate Item” functionality works, refer to this link. Note: For more information on how the MA Store app integrates with overhead RFID readers, refer to its documentation. For more details on what the “View on Map” functionality specifically does, refer to this link. Product “Request Details” The Product “Request Details” UI is displayed when a store associate either selects a request in the list UI and then taps on the “View Details” button or they “Accept” a request using the list UI. The Request Details UI displays the following additional details on top of those already displayed in the List UI. All the media images configured in the Items master for the requested item. A smaller preview is displayed in the form of thumbnails which the store associates can tap on to view larger images. SKU or Item ID of the requested Item Department of the requested Item As is the case with the list UI, a store associate can utilize the details UI to: “Accept” on Open request “Complete” an In Progress request “Reject” an “Open” or “In Progress” request which can't be fulfilled due to inventory unavailability “Cancel” an unwanted “Open” or “In Progress” request “Locate” the requested “Item” with the help of a handheld RFID gun “View” the requested item “on a Map” in the case of an integration with overhead RFID readers Moreover, a store associate can tap on the “Back to List” button on the details UI to go back to the list UI. Similar to the list UI, the “Accept”, “Complete”, “Reject”, and “Cancel” buttons are protected by user permissions in the details UI as well. This is true for the “Back to List” button as well. The “Locate Item” and “View on Map” actions require business configurations to be enabled in addition to user permissions. Updates Whenever a product request is accepted, completed, rejected, or canceled, the status of the product request which is created in open status is updated to In Progress, Completed, Rejected, and Cancelled respectively. Furthermore, the name and user ID of the store associate and the time at which the operation is carried out are recorded. Configuration Enable the following configuration to implement the \"Product Requests\" feature. Assign Permissions Product Requests functionality is primarily protected by user action permissions. To enable this functionality, assign these permissions to at least one of the roles of the required users. Enable Push Notifications Execute the following steps to enable push notifications for product requests. Copy required profile purposes Copy the following base profile purposes to your custom profile: ful::notificationConfig, and ful::fulfillmentConfig Make the push notification persistent Considering the time sensitivity of the product requests, Manhattan Associates recommends that “New product request” push notifications are made persistent. This can be achieved by a generic push notification business configuration which affects all push notifications except “New pickup order”. This configuration resides in the “Push Notification” tab of the Store Fulfillment Parameters. Turning it on will not only make the “New product request” push notification persistent, but it will also start displaying the requestor’s name as part of the push notification. It is disabled by default. Configuration Name: Enable \"DISMISS\" button for all push notifications Define custom sound for the push notification Bearing the time sensitivity of the product requests in mind, retailers may want to assign a custom sound to the “New product request” push notification to enable the store associates to differentiate it from others. Custom sounds can be configured using the “Push Notification Sound” tab of the Store Fulfillment Parameters. For more details on push notification sounds, refer to this documentation. A default sound is already configured out of the box if the ful::fulfillmentConfig profile purpose is copied over from the base to your custom profile. Push Notification Type: New Product Request Configure Store Product Request Locations Out of the box, the delivery location drop-down list in the Request Product popup in the MA Store Inventory Management’s View Inventory UI and the MA Iris Point of Sale’s Catalog Product Details Page are non-editable and are only populated with the requestor’s name / user ID. However, a retailer may optionally configure frequently used delivery locations. If configured, these are also populated in the delivery location drop-down list in addition to the requestor’s name / user ID. Execute the following steps to configure Store Product Request Locations. Sync your provisioning profile A new profile purpose has been added as part of the Store Product Request Locations configuration. This requires you to sync your organization’s active provisioning profile. Log out and log back into Omni Facade Once the sync is done, log out and log back into Omni Facade. When this is done, ensure that the sim::productReqConfig profile purpose starts appearing in your organization’s active provisioning profile details. Add Store Product Request Locations Configure the most frequently used delivery locations. No locations are configured out of the box. “Delivery Location Name” is used to define the localizable name which is localized based on the logged-in user’s locale. If no “Delivery Location Name” is configured, then “Delivery Location ID” is displayed as configured in the “Request Product” popup. “Sequence” is used to define the sequence in which the delivery locations are displayed in the drop-down list. If no sequence is defined, then the delivery locations are displayed in the ascending order of their created date time. Configuration Name: Store Product Request Locations Enable Locate Item In the case of handheld RFID integrations, execute the following steps to enable the \"Locate Item\" capability as part of the \"Product Requests\" functionality. Copy the required profile purpose Copy the base profile purpose, sto::storeConfig, mentioned as part of the Store RFID configuration, to your custom profile. Enable the RFID Locate Item configuration Enable the RFID Locate Item configuration documented here. Assign the required permissions Assign the required permissions - Product Requests List, and Product Requests Details. Enable View on Map In the case of overhead RFID integrations, enable the following configurations to enable the \"View on Map\" capability as part of the \"Product Requests\" functionality. Enable the required overhead RFID configuration Refer to this documentation to enable the configurations needed to integrate the MA Store app with overhead RFID readers. Assign the required permissions Assign the required permissions - Product Requests List, and Product Requests Details. Troubleshooting Issue Troubleshooting Tip Unable to see the \"Request\" action in the MA Store Inventory Management's View Inventory UI or MA Iris Point of Sale's Product Details Page or unable to carry out one or more actions as part of the \"Product Requests\" functionality. Ensure that the user has the required permissions assigned Store associates do not get a push notification when a product request is created. Ensure that the ful::notificationConfig base profile purpose is copied to your custom profile \"New product request\" push notifications are not persistent Ensure that the required configuration is turned on. \"New product request\" push notifications are not accompanied by any sound. Ensure that the required configuration is enabled. Getting the \"ProfilePurpose not found for the ProfilePurposeId sim::productReqConfig, hence not authorized to create/updated/delete the data corresponding to the profile JUNK_PROFILE (fwp::61023)\" while trying to create a Store Product Request Location Ensure that your organization's active provisioning profile is sync'd. Log out and then log back into Omni Facade. Ensure that the sim::productReqConfig profile purpose shows up in your organization's active provisioning details and then try creating a Store Product Request Location again. Services The following APIs have been developed as part of this functionality. Service Component Group Service Endpoint List Product Requests SIM Product Request Controller /sim/api/sim/productRequest/list Save Product Requests SIM Product Request Controller /sim/api/sim/productRequest/save"
}