{
  "id": "2053967",
  "permalink": "pullbacks-transfers-process",
  "title": "Pullbacks & Transfers Process",
  "type": "topic",
  "level": 6,
  "path": "Manhattan Active® Omni/Store/Process & Configuration Guides/Store Inventory & Fulfillment/Store Inventory Management/Pullbacks & Transfers/Process",
  "raw_item": {
    "id": "2053967",
    "text": "Process",
    "title": "Process",
    "permalink": "pullbacks-transfers-process",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "186936",
    "parent": "f;186936",
    "created_date": "1534342077",
    "modified_date": "1751055701",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "1"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158410\" href=\"/store\" class=\"breadcrumb-links\">Store Inventory & Fulfillment</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2166732\" href=\"/store-inventory\" class=\"breadcrumb-links\">Store Inventory Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158743\" href=\"/pullbacks-transfers\" class=\"breadcrumb-links\">Pullbacks & Transfers</a></li><li> <span>››</span>Pullbacks & Transfers Process</li></ul>  \t\r\n\t\t<h2><a name=\"pullbacks-and-nbsp-transfers-process\" id=\"pullbacks-and-nbsp-transfers-process\"></a>Pullbacks and&nbsp;Transfers Process</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/pullbacks-transfers-process$pullbacks-and-nbsp-transfers-process\">Pullbacks and&nbsp;Transfers Process</a><ul><li><a href=\"/pullbacks-transfers-process$pullbacks-and-transfers\">Pullbacks and Transfers</a></li><li><a href=\"/pullbacks-transfers-process$pullback-and-transfer-order-creation\">Pullback and Transfer Order Creation</a></li><li><a href=\"/pullbacks-transfers-process$pullback-nbsp-and-transfer-nbsp-orders-list\">Pullback&nbsp;and Transfer&nbsp;Orders List</a></li><li><a href=\"/pullbacks-transfers-process$print-order\">Print Order</a></li><li><a href=\"/pullbacks-transfers-process$pack\">Pack</a></li><li><a href=\"/pullbacks-transfers-process$print-remaining\">Print Remaining</a></li><li><a href=\"/pullbacks-transfers-process$exceptions\">Exceptions</a><ul><li><a href=\"/pullbacks-transfers-process$cancel-packing\">Cancel Packing</a></li></ul></li><li><a href=\"/pullbacks-transfers-process$pause-and-resume-packing\">Pause and Resume Packing</a></li><li><a href=\"/pullbacks-transfers-process$reassign\">Reassign</a></li><li><a href=\"/pullbacks-transfers-process$rfid\">RFID</a><ul><li><a href=\"/pullbacks-transfers-process$pack-tagged-and-non-tagged-units\">Pack tagged and non-tagged units</a></li><li><a href=\"/pullbacks-transfers-process$locate-item-in-pullbacks-transfers\">Locate Item in Pullbacks & Transfers</a></li><li><a href=\"/pullbacks-transfers-process$exceptions\">Exceptions</a></li><li><a href=\"/pullbacks-transfers-process$updates\">Updates</a></li><li><a href=\"/pullbacks-transfers-process$cross-organization\">Cross-Organization</a></li></ul></li><li><a href=\"/pullbacks-transfers-process$non-parcel\">Non-parcel</a></li><li><a href=\"/pullbacks-transfers-process$inventory-update\">Inventory Update</a></li><li><a href=\"/pullbacks-transfers-process$external-oms-integration-with-active-sim\">External OMS Integration with Active SIM</a></li><li><a href=\"/pullbacks-transfers-process$services\">Services</a></li><li><a href=\"/pullbacks-transfers-process$maximum-recommended-limit\">Maximum Recommended Limit</a></li></ul></li></ul></div>\r\n\r\n<h4 style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; padding: 0px;\"><a name=\"pullbacks-and-transfers\" id=\"pullbacks-and-transfers\"></a>Pullbacks and Transfers</h4>\r\n\r\n<p>Using Manhattan Active Omni Store, associates can process pullback and transfer orders.&nbsp;Pullbacks are large orders intended to move a large amount of inventory out of the store.&nbsp;Pullbacks are often used for end-of-season inventory reductions to make room for new-season inventory.&nbsp;Transfers are often small orders sent from one store location to another store location to replenish the receiving store's inventory, or to rebalance inventory across store locations. Both pullback and transfer orders are processed using a similar workflow.</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong>&nbsp;In this document, the term 'transfer' refers to corporate-initiated transfers. For store-initiated&nbsp;transfers, refer to the&nbsp;<a hqid=\"2263416\" href=\"/store-initiated-transfers-process\">Store-Initiated Transfers process flow</a>.</div>\r\n\r\n<div class=\"tip\">To know more on the&nbsp; pullbacks & transfers&nbsp;activity during offline mode, please refer to the&nbsp;<a hqid=\"3324298\" href=\"/store-inventory-and-fulfillment-offline-support\">Store Offline Support</a>&nbsp;page.</div>\r\n\r\n<h4><a name=\"pullback-and-transfer-order-creation\" id=\"pullback-and-transfer-order-creation\"></a>Pullback and Transfer Order Creation</h4>\r\n\r\n<div>\r\n<p>The Order component creates pullback and transfer orders with the Doc Type set to \"RetailOrder\" and Delivery Method set to&nbsp;\"Ship to Address\". However, within SIF, the&nbsp;delivery method for these fulfillments is created as&nbsp;\"Ship to Location\" due to internal processing reasons. This conversion only occurs within SIF. All outbound messages convert the delivery method back to the original “Ship To Address” for communication&nbsp;outside of SIF.</p>\r\n</div>\r\n\r\n<h4><a name=\"pullback-nbsp-and-transfer-nbsp-orders-list\" id=\"pullback-nbsp-and-transfer-nbsp-orders-list\"></a>Pullback&nbsp;and Transfer&nbsp;Orders List</h4>\r\n\r\n<p>The list of pullbacks and transfers includes the following information:</p>\r\n\r\n<ul>\r\n\t<li>The order type (Pullback or Transfer)</li>\r\n\t<li>The Ship-to location</li>\r\n\t<li>The due date&nbsp;</li>\r\n\t<li>The current status</li>\r\n\t<li>The number of packed units and total units</li>\r\n</ul>\r\n\r\n<p>The list is sorted by due date to show&nbsp;the nearest due date first.</p>\r\n\r\n<div>\r\n<p>Retailers have the ability to define&nbsp;their own list of multiple order types for pullbacks and transfers. The order types are visible&nbsp;to the store associates, which can be used to&nbsp;determine the&nbsp;orders to pick up next.&nbsp;For example, a retailer can define&nbsp;a pullback order type&nbsp;that represents returning defective/damaged items.</p>\r\n</div>\r\n\r\n<p>Only one associate can pack an order at a&nbsp;time, but multiple associates may pack an order over time. An error message is displayed if a second user attempts to pack an order while it is already being packed.</p>\r\n\r\n<p>The list of pullback and transfer orders can be retrieved using the <span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">List Pullback and Transfer</span> service.&nbsp;</p>\r\n\r\n<h4><a name=\"print-order\" id=\"print-order\"></a><a id=\"confirm-items-nbsp\" name=\"confirm-items-nbsp\" style=\"cursor: pointer;\"></a>Print Order</h4>\r\n\r\n<div>Print the pullback or transfer order to perform offline picking. Sorting the items in the pick list is controlled by a configuration setting.</div>\r\n\r\n<div>&nbsp;</div>\r\n\r\n<h4><a name=\"pack\" id=\"pack\"></a><a id=\"confirm-items-nbsp\" name=\"confirm-items-nbsp\" style=\"cursor: pointer;\"></a>Pack</h4>\r\n\r\n<p>Since completion of pullbacks can take several hours, or days&nbsp;(that is, it likely involves multiple users), the Pullbacks and Transfers workflow is designed to allow an associate to handoff packing an order to another associate without performing any special actions. Once an associate exits from an order, the&nbsp;order is automatically available for packing to other associates until it is eventually closed. A single task group is used to complete the work across all the users for the order.</p>\r\n\r\n<p>An associate can pack one pullback order at one time. Items to pack are displayed in the ascending order of Fulfillment Line Id.&nbsp; If the associate has started packing an order and the package is not closed, the system will not allow the associate to pack any other pullback order. Only once the package is closed, the system allows the&nbsp;associate to work on any other pullback order. Package has delivery type as Store Inventory.</p>\r\n\r\n<p><a id=\"LessThanExpectedWarn\" name=\"LessThanExpectedWarn\"></a></p>\r\n\r\n<p>If an associate attempts to close a package while there are units yet to be packed for the order, a&nbsp;warning pop-up is displayed to the user. See the <a hqid=\"2069271\" href=\"/pullbacks-transfers-configuration\">Configuration guide</a> for more details.</p>\r\n\r\n<p><strong>Note</strong>: By default, the receipt type of the pullback and transfer order packages is a package. A user exit has been given to set the other receipt types (Item or Load). The delivery type of the package is store inventory.</p>\r\n\r\n<h4><a name=\"print-remaining\" id=\"print-remaining\"></a><a id=\"print-remaining\" name=\"print-remaining\"></a>Print Remaining</h4>\r\n\r\n<p>Using the 'Print Remaining' action, an associate can print items in a pullback/transfer order that are yet to be packed. Packed items and rejected items are excluded from the report.</p>\r\n\r\n<p>This action is controlled by permission.</p>\r\n\r\n<div class=\"tip\">Note: When an item&nbsp;on the pullback/transfer order is rejected, it may take some time to update the server; therefore, the remaining items report may contain rejected items. It is recommended that after rejecting item(s), wait a few seconds before printing the remaining items.</div>\r\n\r\n<h4><a name=\"exceptions\" id=\"exceptions\"></a>Exceptions</h4>\r\n\r\n<p>While packing the pullback order, the associate can reject the remaining items by specifying an appropriate reason code. If overage is allowed for an order, the associate may pack more than the ordered units for the items. An error is displayed if overage is not allowed for the pullback order.&nbsp;If the associate wishes to cancel packing, the system allows the associate to cancel packing for the pullback order.</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> When an associate cancels&nbsp;the packing process, the&nbsp;system cancels only those packages that&nbsp;are not yet shipped from the store. The system does not cancel the shipped packages. Once the packing process is canceled,&nbsp;the&nbsp;system&nbsp;also cancels the task group of the order.</div>\r\n\r\n<div class=\"tip\"><strong>Note: </strong>A pullback/transfer order cannot be canceled by the Store. The store associates can only reject all the units and finish order to cancel the pullback order.</div>\r\n\r\n<p>An&nbsp;associate with the appropriate permission can modify shipping options during the packing process. Please refer to the \"Update Package\" section mentioned in the&nbsp;<a hqid=\"1808795\" href=\"/shipping-process\">Shipping Process</a>&nbsp;guide. The update package functionality can only be used with&nbsp;parcel shipping.</p>\r\n\r\n<p>The update package for non-parcel is not supported from the base. And it's only supported for PCL-related carriers. However, we are seeing the update package button enabled for non-parcel-related packages. If we change the carrier and service level to PCL type, it only updates the package carrier and service level on the entity, and UI doesn’t call the getTrackingNumber API due to<strong data-renderer-mark=\"true\"> IsNonParcel = true</strong> on the fulfillment header.</p>\r\n\r\n<p data-renderer-start-pos=\"1\">The <strong data-renderer-mark=\"true\"> IsNonParcel </strong>attribute on the fulfillment header is only set during the fulfillment creation. During fulfillment creation, a base call is made to the parcel component based on the carrier code to find the carrier type LTL or PCL. Based on API response fulfillment stamps, true or false for IsNonParcel.</p>\r\n\r\n<h5><a name=\"cancel-packing\" id=\"cancel-packing\"></a>Cancel Packing</h5>\r\n\r\n<p>During packing, a store associate can perform the cancel packing to cancel all the packages which are in the built state. The system does&nbsp;not cancel any package which is in the shipped state or in the received state. Once cancel packing is performed, the store associate can re-pack&nbsp;the remaining items which are not yet shipped.&nbsp;</p>\r\n\r\n<h4><a name=\"pause-and-resume-packing\" id=\"pause-and-resume-packing\"></a>Pause and Resume Packing</h4>\r\n\r\n<p>For pullback and transfer, every package is linked with one pack activity. During packing, a store associate can pause the pullback pack activity if the package is not submitted. A store associate can resume the pack activity on the same device or on another device. The device should be connected with the store's Wi-Fi when a store associate is resuming the pack activity.&nbsp;</p>\r\n\r\n<h4><a name=\"reassign\" id=\"reassign\"></a><a id=\"updates\" name=\"updates\" style=\"cursor: pointer;\"></a>Reassign</h4>\r\n\r\n<div style=\"margin: 0px; padding: 0px;\">\r\n<p>Pullback/transfer&nbsp;tasks can be reassigned to another user in the event that the original&nbsp;associate is unable to complete the task, or must&nbsp;take up higher priority customer work. Since at one point in time an associate can only be assigned&nbsp;one pullback/transfer&nbsp;task, during reassign only associates with no in progress pullback/transfer&nbsp;tasks are eligible to take the task. Associates are still eligible for reassignment if they have an in progress customer order pack task or a store-initiated&nbsp;pack task.</p>\r\n\r\n<h4><a name=\"rfid\" id=\"rfid\"></a>RFID</h4>\r\n\r\n<p>Store associates can pack&nbsp;pullback/transfer&nbsp;orders using Radio Frequency Identification (RFID). When the RFID pullback/transfers&nbsp;business configuration is enabled, store associates can use a handheld RFID reader to read the Item's unit-level RFID tags rather than scanning the item's barcode for packing. The Store application decodes the GTIN-14 from the unit-level tag to validate that the correct item(s) is being packed.&nbsp;Refer to the&nbsp;<a hqid=\"2195072\" href=\"/storerfid\">Store RFID guide</a>&nbsp;for additional information.&nbsp;</p>\r\n\r\n<p>The base default reader range for pullbacks and transfers is set to \"Short\" so that the reader will not read additional RFID tags that are not meant for order.</p>\r\n\r\n<h5><a name=\"pack-tagged-and-non-tagged-units\" id=\"pack-tagged-and-non-tagged-units\"></a>Pack tagged and non-tagged units</h5>\r\n\r\n<p>Store associates can pack both tagged and untagged item units into a package. For tagged units, they can use a handheld reader, while for non-tagged units, they can scan the item barcode. Associates can navigate to the item details UI to view additional details of the item and adjust any inadvertently scanned non-RFID-tagged units of the item. This UI doesn't support RFID mode.&nbsp;</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>:&nbsp;Support for packing pullback and corporate transfer packages having a mix of RFID-tagged and untagged items is now available and is planned to be automatically enabled as part of the 25.4 market release. If you would like to opt in early, contact your Manhattan representative.</div>\r\n\r\n<h5><a name=\"locate-item-in-pullbacks-transfers\" id=\"locate-item-in-pullbacks-transfers\"></a>Locate Item in Pullbacks & Transfers</h5>\r\n\r\n<p>This functionality enables users to search for items associated with Pullbacks & Transfers operations during the packing process. It is accessible via the slide-out option on the remaining units UI. By allowing store associates to quickly locate relevant items, this feature streamlines the packing workflow and improves operational efficiency.</p>\r\n\r\n<p>This functionality is governed&nbsp;by permission to store inventory resources. Please refer to this <a href=\"https://omni.helpdocsonline.com/store-inventory-ui-resources\">page</a>.</p>\r\n\r\n<h5><a name=\"exceptions\" id=\"exceptions\"></a>Exceptions</h5>\r\n\r\n<p>In the case of packages having only RFID-tagged items, store associates cannot modify the packages to remove units from the package, and they also cannot manually increase or decrease the item's quantity from the item details. However, if a package contains both RFID-tagged and untagged units of an item, associates can use the Modify Package and Item Details to update only the untagged units. Both these UIs do not support RFID mode.&nbsp;</p>\r\n\r\n<p>If a store associate cancels the packing of a pullback/transfer order, the status of any already packed units reverts from \"Reserved\" back to \"Available\". See the Updates section below for further details.</p>\r\n\r\n<p>If a store associate&nbsp;is unable to read the unit-level tag and an EPC or SGTIN barcode is present, they can scan that barcode to perform packing.</p>\r\n\r\n<p>The Store application does not validate the status of the&nbsp;unit (EPC) before packing. For example, if a tag that is read happens to be in the reserved or departed status, the packing will be performed without showing an error to the store associate.</p>\r\n\r\n<h5><a name=\"updates\" id=\"updates\"></a>Updates</h5>\r\n\r\n<p>When the store associate submits the package, the status of the unit inventory record(s) is&nbsp;updated from \"Available\" to \"Reserved\". When packages are shipped, the unit inventory status is updated from \"Reserved\" to \"Inbound\" if the destination location is a store, and from \"Reserved\" to \"Departed\" if the destination location is Distribution Center or Supplier.</p>\r\n\r\n<p>In the case of a package having a mix of RFID-tagged and untagged items, no unit inventory records are created for the untagged items;&nbsp;however, inventory supply updates are sent for both RFID-tagged and untagged items.&nbsp;</p>\r\n\r\n<h5><a name=\"cross-organization\" id=\"cross-organization\"></a>Cross-Organization</h5>\r\n\r\n<p>Retailers can pack and ship&nbsp;pullback/transfer orders from one organization's store to another organization's store or DC or supplier. When an item's unit inventory has been shipped from one organization's store to another organization's location (store, DC or supplier), the item's unit inventory status is updated to \"Departed,\" and a new unit inventory record is created as \"Inbound\" at the receiving location.</p>\r\n\r\n<p>Refer&nbsp;to the&nbsp;<a href=\"https://omni.helpdocsonline.com/cross-org-fulfillment-process\">process guide</a>&nbsp;for additional information about cross-organization feature.</p>\r\n\r\n<h4><a name=\"non-parcel\" id=\"non-parcel\"></a>Non-parcel</h4>\r\n\r\n<p>To support shipping pullback/transfer orders using a non-parcel carrier, the retailer must configure&nbsp;a job scheduler to move&nbsp;the non-parcel packages to shipped status.</p>\r\n\r\n<h4><a name=\"inventory-update\" id=\"inventory-update\"></a>Inventory Update</h4>\r\n\r\n<p>The following information is sent&nbsp;to the Inventory Management for audit purposes when inventory is updated by ASNCreate supply event, based on \"Create in-transit records for shipping inventory from a store to another location\" is true:</p>\r\n\r\n<ul>\r\n\t<li>Inventory Transaction Type - If the override store transaction type is configured for the store transaction type \"Ship Corporate Transfer\", the inventory transaction type is populated with the override value. If no override is configured, the base&nbsp;value&nbsp;is sent.</li>\r\n\t<li>Inventory Transaction ID&nbsp;-&nbsp; Order Id, Fulfillment Id & Package Id are sent to identify the pullback/transfer&nbsp;transaction.</li>\r\n</ul>\r\n\r\n<h4><a name=\"external-oms-integration-with-active-sim\" id=\"external-oms-integration-with-active-sim\"></a>External OMS Integration with Active SIM</h4>\r\n\r\n<p><span style=\"font-family:Arial,Helvetica,sans-serif;\">When Manhattan Active Store Inventory Management is&nbsp;integrated with an external Order Management System (OMS), SIF can be configured to directly send supply updates to the Inventory component since Manhattan Active Order Management is not present to send the inventory update.&nbsp;This applies to Pickup at Store (including Curbside pickups), Ship to Store and Same Day Delivery orders that are&nbsp;fulfilled by the&nbsp;store. This functionality should be enabled only when Active Store Inventory Management is deployed with an external OMS.</span></p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 784px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 226px;\">Order</th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 93px;\">Supply Transaction Type</th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 121px;\">Supply Update</th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 70px;\">Inventory Transaction Type</th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 277px;\">Inventory Transaction Value (mapped to the Inventory Transaction ID of the Supply Event)</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 223px;\">\r\n\t\t\t<p>Pullback or Transfer</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"margin: 0px; width: 79px;\">\r\n\t\t\t<p>Adjustment</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"margin: 0px; width: 107px;\">\r\n\t\t\t<p>Reduce On-Hand Supply</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"margin: 0px; width: 56px;\">\r\n\t\t\t<p>Order Ship</p>\r\n\t\t\t</td>\r\n\t\t\t<td style=\"margin: 0px; width: 262px;\">\r\n\t\t\t<p>OrderId:FulfillmentId</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>The “Ship Corporate Transfer” <a href=\"https://omni.helpdocsonline.com/inventory-audit-configuration$store-transaction-type\">Store Transaction Type</a> and its <a href=\"https://omni.helpdocsonline.com/inventory-audit-configuration$store-inventory-transaction-type-override\">override</a> do not come into effect for the above supply update when this feature is enabled.</p>\r\n\r\n<p>Additionally, the following relay attributes are sent as part of the supply event for Inventory Audit purposes:</p>\r\n\r\n<ol>\r\n\t<li>Order Id</li>\r\n\t<li>Order Line Id</li>\r\n\t<li>Fulfillment Id</li>\r\n\t<li>Fulfillment Line Id</li>\r\n</ol>\r\n\r\n<p>This functionality can be enabled for all fulfillment types via a configuration (refer to&nbsp;the <a hqid=\"ID2239205\" href=\"https://omni.helpdocsonline.com/confirm-pickup-configuration\">configuration</a>&nbsp;guide), or for specific fulfillment types.&nbsp;<span style=\"font-family:Arial,Helvetica,sans-serif;\">For example, SIF can be configured to send inventory updates only for Pullback & Transfer orders. If the functionality should only be enabled for certain fulfillment types, pass the</span><span style=\"font-family:Arial,Helvetica,sans-serif;\">&nbsp;'</span>isExternalOrder' property in the Fulfillment as true and leave the configuration set to false. For a given fulfillment, the logic of whether to use the&nbsp;Fulfillment property or the configuration is described below:</p>\r\n\r\n<ol data-indent-level=\"2\" start=\"1\">\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"1458\">If the Fulfillment&nbsp;isExternalOrder flag is true, it overrides whatever value is set in the configuration.</p>\r\n\t</li>\r\n\t<li>\r\n\t<p data-renderer-start-pos=\"1458\">If the Fulfillment isExternalOrder flag is false, the configuration is checked to determine the behavior.</p>\r\n\t</li>\r\n</ol>\r\n\r\n<p data-renderer-start-pos=\"1458\">&nbsp;</p>\r\n</div>\r\n\r\n<h4 style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; padding: 0px;\"><a name=\"services\" id=\"services\"></a><a id=\"services\" name=\"services\" style=\"cursor: pointer;\"></a>Services</h4>\r\n\r\n<p>The&nbsp;APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 1000px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 226px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service</font></th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 1080px;\">Component</th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 1080px;\">Group</th>\r\n\t\t\t<th scope=\"col\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; font-weight: normal; width: 1080px;\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service Endpoint</font></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 223px;\"><span style=\"color: rgb(51, 51, 51); font-family: Arial, sans-serif;\">List Pullback & Transfer</span></td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">Fulfillment</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">fulfillment-list-controller</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">\r\n\t\t\t<p>/fulfillment/api/storefacade/fulfillment/listPullbackAndTransfer</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 223px;\"><span style=\"color: rgb(51, 51, 51); font-family: Arial, sans-serif;\">Get Pullback & Transfer Orders Count</span></td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">Fulfillment</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">fulfillment-list-controller</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">/fulfillment/api/storefacade/fulfillment/pullbackAndTransferOrdersCount</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 223px;\">Create pullback pick list report</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">Fulfillment</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">fulfillment-pullback-transfer-controller</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">/fulfillment/api/fulfillment/pullbackortransfer/pullBackTransferPickListReport/fulfillmentId/{fulfillmentId}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 223px;\">Get fulfillment (for packing)</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">Fulfillment</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\"><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">f</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">u</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">lfi</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">llment-pullback-transfer-controller</span></td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">/fulfillment/api/fulfillment/pullbackortransfer/pack/fulfillmentId/{fulfillmentId}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 223px;\">Resume pullback packing</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">Fulfillment</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\"><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">f</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ulfill</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">m</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ent</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">-pullb</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ack-transfer-c</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">ontroller</span></td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">/fulfillment/api/fulfillment/pullbackortransfer/resumePack/location/{location}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 223px;\">Close Pullback Order</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">Fulfillment</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\"><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif; background-color: rgb(230, 230, 230);\">f</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif; background-color: rgb(230, 230, 230);\">u</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif; background-color: rgb(230, 230, 230);\">lfi</span><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif; background-color: rgb(230, 230, 230);\">llment-pullback-transfer-controller</span></td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">\r\n\t\t\t<p>/fulfillment/api/fulfillment/pullbackortransfer/closeOrder</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"margin: 0px; width: 223px;\">RFID - Pack</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">Fulfillment</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">Packages Services</td>\r\n\t\t\t<td style=\"margin: 0px; width: 1077px;\">/fulfillment/api/fulfillment/packages/pack</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"maximum-recommended-limit\" id=\"maximum-recommended-limit\"></a>Maximum Recommended Limit</h4>\r\n\r\n<p>Max recommended limit for both shipping and receiving across all the order types and transfer types:</p>\r\n\r\n<ul>\r\n\t<li>Fulfillment lines – 2500</li>\r\n\t<li>No. of packages in a single fulfillment – 1000</li>\r\n\t<li>No.&nbsp;of lines in a single package – 250</li>\r\n</ul>\r\n\r\n<h4>&nbsp;</h4>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n</div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 28624,
  "scraped_at": "2025-08-09T22:05:01.662342",
  "content_clean": "Home ››Manhattan Active® Omni››Store››Process & Configuration Guides››Store Inventory & Fulfillment››Store Inventory Management››Pullbacks & Transfers ››Pullbacks & Transfers Process Pullbacks and Transfers Process Pullbacks and Transfers ProcessPullbacks and TransfersPullback and Transfer Order CreationPullback and Transfer Orders ListPrint OrderPackPrint RemainingExceptionsCancel PackingPause and Resume PackingReassignRFIDPack tagged and non-tagged unitsLocate Item in Pullbacks & TransfersExceptionsUpdatesCross-OrganizationNon-parcelInventory UpdateExternal OMS Integration with Active SIMServicesMaximum Recommended Limit Pullbacks and Transfers Using Manhattan Active Omni Store, associates can process pullback and transfer orders. Pullbacks are large orders intended to move a large amount of inventory out of the store. Pullbacks are often used for end-of-season inventory reductions to make room for new-season inventory. Transfers are often small orders sent from one store location to another store location to replenish the receiving store's inventory, or to rebalance inventory across store locations. Both pullback and transfer orders are processed using a similar workflow. Note: In this document, the term 'transfer' refers to corporate-initiated transfers. For store-initiated transfers, refer to the Store-Initiated Transfers process flow. To know more on the  pullbacks & transfers activity during offline mode, please refer to the Store Offline Support page. Pullback and Transfer Order Creation The Order component creates pullback and transfer orders with the Doc Type set to \"RetailOrder\" and Delivery Method set to \"Ship to Address\". However, within SIF, the delivery method for these fulfillments is created as \"Ship to Location\" due to internal processing reasons. This conversion only occurs within SIF. All outbound messages convert the delivery method back to the original “Ship To Address” for communication outside of SIF. Pullback and Transfer Orders List The list of pullbacks and transfers includes the following information: The order type (Pullback or Transfer) The Ship-to location The due date The current status The number of packed units and total units The list is sorted by due date to show the nearest due date first. Retailers have the ability to define their own list of multiple order types for pullbacks and transfers. The order types are visible to the store associates, which can be used to determine the orders to pick up next. For example, a retailer can define a pullback order type that represents returning defective/damaged items. Only one associate can pack an order at a time, but multiple associates may pack an order over time. An error message is displayed if a second user attempts to pack an order while it is already being packed. The list of pullback and transfer orders can be retrieved using the List Pullback and Transfer service. Print Order Print the pullback or transfer order to perform offline picking. Sorting the items in the pick list is controlled by a configuration setting. Pack Since completion of pullbacks can take several hours, or days (that is, it likely involves multiple users), the Pullbacks and Transfers workflow is designed to allow an associate to handoff packing an order to another associate without performing any special actions. Once an associate exits from an order, the order is automatically available for packing to other associates until it is eventually closed. A single task group is used to complete the work across all the users for the order. An associate can pack one pullback order at one time. Items to pack are displayed in the ascending order of Fulfillment Line Id.  If the associate has started packing an order and the package is not closed, the system will not allow the associate to pack any other pullback order. Only once the package is closed, the system allows the associate to work on any other pullback order. Package has delivery type as Store Inventory. If an associate attempts to close a package while there are units yet to be packed for the order, a warning pop-up is displayed to the user. See the Configuration guide for more details. Note: By default, the receipt type of the pullback and transfer order packages is a package. A user exit has been given to set the other receipt types (Item or Load). The delivery type of the package is store inventory. Print Remaining Using the 'Print Remaining' action, an associate can print items in a pullback/transfer order that are yet to be packed. Packed items and rejected items are excluded from the report. This action is controlled by permission. Note: When an item on the pullback/transfer order is rejected, it may take some time to update the server; therefore, the remaining items report may contain rejected items. It is recommended that after rejecting item(s), wait a few seconds before printing the remaining items. Exceptions While packing the pullback order, the associate can reject the remaining items by specifying an appropriate reason code. If overage is allowed for an order, the associate may pack more than the ordered units for the items. An error is displayed if overage is not allowed for the pullback order. If the associate wishes to cancel packing, the system allows the associate to cancel packing for the pullback order. Note: When an associate cancels the packing process, the system cancels only those packages that are not yet shipped from the store. The system does not cancel the shipped packages. Once the packing process is canceled, the system also cancels the task group of the order. Note: A pullback/transfer order cannot be canceled by the Store. The store associates can only reject all the units and finish order to cancel the pullback order. An associate with the appropriate permission can modify shipping options during the packing process. Please refer to the \"Update Package\" section mentioned in the Shipping Process guide. The update package functionality can only be used with parcel shipping. The update package for non-parcel is not supported from the base. And it's only supported for PCL-related carriers. However, we are seeing the update package button enabled for non-parcel-related packages. If we change the carrier and service level to PCL type, it only updates the package carrier and service level on the entity, and UI doesn’t call the getTrackingNumber API due to IsNonParcel = true on the fulfillment header. The IsNonParcel attribute on the fulfillment header is only set during the fulfillment creation. During fulfillment creation, a base call is made to the parcel component based on the carrier code to find the carrier type LTL or PCL. Based on API response fulfillment stamps, true or false for IsNonParcel. Cancel Packing During packing, a store associate can perform the cancel packing to cancel all the packages which are in the built state. The system does not cancel any package which is in the shipped state or in the received state. Once cancel packing is performed, the store associate can re-pack the remaining items which are not yet shipped. Pause and Resume Packing For pullback and transfer, every package is linked with one pack activity. During packing, a store associate can pause the pullback pack activity if the package is not submitted. A store associate can resume the pack activity on the same device or on another device. The device should be connected with the store's Wi-Fi when a store associate is resuming the pack activity. Reassign Pullback/transfer tasks can be reassigned to another user in the event that the original associate is unable to complete the task, or must take up higher priority customer work. Since at one point in time an associate can only be assigned one pullback/transfer task, during reassign only associates with no in progress pullback/transfer tasks are eligible to take the task. Associates are still eligible for reassignment if they have an in progress customer order pack task or a store-initiated pack task. RFID Store associates can pack pullback/transfer orders using Radio Frequency Identification (RFID). When the RFID pullback/transfers business configuration is enabled, store associates can use a handheld RFID reader to read the Item's unit-level RFID tags rather than scanning the item's barcode for packing. The Store application decodes the GTIN-14 from the unit-level tag to validate that the correct item(s) is being packed. Refer to the Store RFID guide for additional information. The base default reader range for pullbacks and transfers is set to \"Short\" so that the reader will not read additional RFID tags that are not meant for order. Pack tagged and non-tagged units Store associates can pack both tagged and untagged item units into a package. For tagged units, they can use a handheld reader, while for non-tagged units, they can scan the item barcode. Associates can navigate to the item details UI to view additional details of the item and adjust any inadvertently scanned non-RFID-tagged units of the item. This UI doesn't support RFID mode. Note: Support for packing pullback and corporate transfer packages having a mix of RFID-tagged and untagged items is now available and is planned to be automatically enabled as part of the 25.4 market release. If you would like to opt in early, contact your Manhattan representative. Locate Item in Pullbacks & Transfers This functionality enables users to search for items associated with Pullbacks & Transfers operations during the packing process. It is accessible via the slide-out option on the remaining units UI. By allowing store associates to quickly locate relevant items, this feature streamlines the packing workflow and improves operational efficiency. This functionality is governed by permission to store inventory resources. Please refer to this page. Exceptions In the case of packages having only RFID-tagged items, store associates cannot modify the packages to remove units from the package, and they also cannot manually increase or decrease the item's quantity from the item details. However, if a package contains both RFID-tagged and untagged units of an item, associates can use the Modify Package and Item Details to update only the untagged units. Both these UIs do not support RFID mode. If a store associate cancels the packing of a pullback/transfer order, the status of any already packed units reverts from \"Reserved\" back to \"Available\". See the Updates section below for further details. If a store associate is unable to read the unit-level tag and an EPC or SGTIN barcode is present, they can scan that barcode to perform packing. The Store application does not validate the status of the unit (EPC) before packing. For example, if a tag that is read happens to be in the reserved or departed status, the packing will be performed without showing an error to the store associate. Updates When the store associate submits the package, the status of the unit inventory record(s) is updated from \"Available\" to \"Reserved\". When packages are shipped, the unit inventory status is updated from \"Reserved\" to \"Inbound\" if the destination location is a store, and from \"Reserved\" to \"Departed\" if the destination location is Distribution Center or Supplier. In the case of a package having a mix of RFID-tagged and untagged items, no unit inventory records are created for the untagged items; however, inventory supply updates are sent for both RFID-tagged and untagged items. Cross-Organization Retailers can pack and ship pullback/transfer orders from one organization's store to another organization's store or DC or supplier. When an item's unit inventory has been shipped from one organization's store to another organization's location (store, DC or supplier), the item's unit inventory status is updated to \"Departed,\" and a new unit inventory record is created as \"Inbound\" at the receiving location. Refer to the process guide for additional information about cross-organization feature. Non-parcel To support shipping pullback/transfer orders using a non-parcel carrier, the retailer must configure a job scheduler to move the non-parcel packages to shipped status. Inventory Update The following information is sent to the Inventory Management for audit purposes when inventory is updated by ASNCreate supply event, based on \"Create in-transit records for shipping inventory from a store to another location\" is true: Inventory Transaction Type - If the override store transaction type is configured for the store transaction type \"Ship Corporate Transfer\", the inventory transaction type is populated with the override value. If no override is configured, the base value is sent. Inventory Transaction ID -  Order Id, Fulfillment Id & Package Id are sent to identify the pullback/transfer transaction. External OMS Integration with Active SIM When Manhattan Active Store Inventory Management is integrated with an external Order Management System (OMS), SIF can be configured to directly send supply updates to the Inventory component since Manhattan Active Order Management is not present to send the inventory update. This applies to Pickup at Store (including Curbside pickups), Ship to Store and Same Day Delivery orders that are fulfilled by the store. This functionality should be enabled only when Active Store Inventory Management is deployed with an external OMS. Order Supply Transaction Type Supply Update Inventory Transaction Type Inventory Transaction Value (mapped to the Inventory Transaction ID of the Supply Event) Pullback or Transfer Adjustment Reduce On-Hand Supply Order Ship OrderId:FulfillmentId The “Ship Corporate Transfer” Store Transaction Type and its override do not come into effect for the above supply update when this feature is enabled. Additionally, the following relay attributes are sent as part of the supply event for Inventory Audit purposes: Order Id Order Line Id Fulfillment Id Fulfillment Line Id This functionality can be enabled for all fulfillment types via a configuration (refer to the configuration guide), or for specific fulfillment types. For example, SIF can be configured to send inventory updates only for Pullback & Transfer orders. If the functionality should only be enabled for certain fulfillment types, pass the 'isExternalOrder' property in the Fulfillment as true and leave the configuration set to false. For a given fulfillment, the logic of whether to use the Fulfillment property or the configuration is described below: If the Fulfillment isExternalOrder flag is true, it overrides whatever value is set in the configuration. If the Fulfillment isExternalOrder flag is false, the configuration is checked to determine the behavior. Services The APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on each service. Service Component Group Service Endpoint List Pullback & Transfer Fulfillment fulfillment-list-controller /fulfillment/api/storefacade/fulfillment/listPullbackAndTransfer Get Pullback & Transfer Orders Count Fulfillment fulfillment-list-controller /fulfillment/api/storefacade/fulfillment/pullbackAndTransferOrdersCount Create pullback pick list report Fulfillment fulfillment-pullback-transfer-controller /fulfillment/api/fulfillment/pullbackortransfer/pullBackTransferPickListReport/fulfillmentId/{fulfillmentId} Get fulfillment (for packing) Fulfillment fulfillment-pullback-transfer-controller /fulfillment/api/fulfillment/pullbackortransfer/pack/fulfillmentId/{fulfillmentId} Resume pullback packing Fulfillment fulfillment-pullback-transfer-controller /fulfillment/api/fulfillment/pullbackortransfer/resumePack/location/{location} Close Pullback Order Fulfillment fulfillment-pullback-transfer-controller /fulfillment/api/fulfillment/pullbackortransfer/closeOrder RFID - Pack Fulfillment Packages Services /fulfillment/api/fulfillment/packages/pack Maximum Recommended Limit Max recommended limit for both shipping and receiving across all the order types and transfer types: Fulfillment lines – 2500 No. of packages in a single fulfillment – 1000 No. of lines in a single package – 250"
}