{
  "id": "3375739",
  "permalink": "refundbylink",
  "title": "Refund by Link ",
  "type": "topic",
  "level": 4,
  "path": "Manhattan Active® Omni/Order Management/Process & Configuration Guides/Digital Self-Service/Refund by Link ",
  "raw_item": {
    "id": "3375739",
    "text": "Refund by Link ",
    "title": "Refund by Link ",
    "permalink": "refundbylink",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "193441",
    "parent": "f;193441",
    "created_date": "1709194208",
    "modified_date": "1748239420",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "13"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158714\" href=\"/digital-self-service-3\" class=\"breadcrumb-links\">Digital Self-Service</a></li><li> <span>››</span>Refund by Link </li></ul>  \t\r\n\t\t<h2>Refund by Link</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/refundbylink$refund-by-link-flow\">Refund by Link Flow</a></li><li><a href=\"/refundbylink$customer-service-refund-by-link\">Customer Service Refund by Link</a></li><li><a href=\"/refundbylink$refund-by-link-outbound-emails\">Refund by Link - Outbound Emails</a></li><li><a href=\"/refundbylink$refund-by-link-outbound-text-messages-nbsp\">Refund by Link - Outbound Text Messages&nbsp;</a></li><li><a href=\"/refundbylink$digital-self-service-refund-by-link\">Digital Self-Service Refund by Link</a><ul><li><a href=\"/refundbylink$digital-self-service-integration-with-payment-providers\">Digital Self-Service Integration with Payment Providers</a></li></ul></li><li><a href=\"/refundbylink$refund-by-link-expiry\">Refund by Link Expiry</a></li><li><a href=\"/refundbylink$multiple-payment-gateways\">Multiple Payment Gateways</a></li><li><a href=\"/refundbylink$configurations\">Configurations</a><ul><li><a href=\"/refundbylink$order-configuration\">Order Configuration</a></li><li><a href=\"/refundbylink$customer-service-configuration-nbsp\">Customer Service Configuration&nbsp;</a></li><li><a href=\"/refundbylink$digital-self-service-configuration\">Digital Self-Service Configuration</a></li><li><a href=\"/refundbylink$refund-by-link-email-configuration-nbsp\">Refund by Link Email Configuration&nbsp;</a></li><li><a href=\"/refundbylink$refund-by-link-text-message-configuration\">Refund by Link Text Message Configuration</a></li><li><a href=\"/refundbylink$multiple-payment-gateways-configuration\">Multiple Payment Gateways Configuration</a></li></ul></li><li><a href=\"/refundbylink$feature-scope-nbsp\">Feature Scope&nbsp;</a></li><li><a href=\"/refundbylink$services-nbsp\">Services&nbsp;</a></li><li><a href=\"/refundbylink$how-to-test\">How to Test</a></li></ul></div>\r\n\r\n<p style=\"text-align: justify;\">With Refund by Link, customers can provide a new payment method (credit card) to process refund transactions that have failed for a return order&nbsp;on their own mobile device, tablet, or laptop, rather than providing their sensitive credit card information to contact center&nbsp;agents. This reduces the level of risk for customers who want to add new payment methods like new credit card details over the phone, while also providing opportunities to retry the refund&nbsp;transaction when the refund transactions failed with the old payment methods or original payment methods with which the customer paid for the sales. The&nbsp;Refund by Link feature also enables contact center agents who are working from home&nbsp;to capture new payment methods&nbsp;and process failed refunds securely.</p>\r\n\r\n<p>The Refund by Link flow is as follows:</p>\r\n\r\n<ol>\r\n\t<li style=\"text-align: justify;\">A refund transaction could not be processed due to various reasons for&nbsp;the original payment method used by the customer for making the payment during the sale.</li>\r\n\t<li style=\"text-align: justify;\">The retailer has enabled refund retries and all the configured retries for the refund transaction have failed.\r\n\t<ul>\r\n\t\t<li>The retailer has enabled \"refund retries failed\" mod type in the order configuration and Refund By Link Email or Text is configured.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li style=\"text-align: justify;\">Or the customer calls the contact center (or chat, text, and so on) and inquires about the refund.\r\n\t<ul>\r\n\t\t<li>The Contact Center Representative(CSR)&nbsp;navigates to&nbsp;the Edit Return Order screen and navigates to Return Order Summary ⇾ Add Payment Method ⇾ Refund By Link and clicks on either send Email/Text/both or Copy URL and send the Refund By Link to the customer&nbsp;</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li style=\"text-align: justify;\">The customer receives the Refund By Link email or text&nbsp;on their own device, and clicks the Refund By Link URL to launch Digital Self-Service.</li>\r\n\t<li style=\"text-align: justify;\">The customer enters the new payment method details (credit&nbsp;card information) using&nbsp;Digital Self-Service and the third party payment gateway (CyberSource or Adyen)&nbsp;</li>\r\n\t<li style=\"text-align: justify;\">If the customer is on a call with CSR, the customer lets the CSR know that the payment method has been added.</li>\r\n</ol>\r\n\r\n<p>Refund by Link is supported out of the box, with CyberSource and Adyen. Other third party payment providers can be used if they provide hosted checkout capabilities.</p>\r\n\r\n<h3><a name=\"refund-by-link-flow\" id=\"refund-by-link-flow\"></a>Refund by Link Flow</h3>\r\n\r\n<p><img height=\"1443\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/833/RefundByLink-CSR_3_.jpg?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1LzgzMy9SZWZ1bmRCeUxpbmstQ1NSXzNfLmpwZyIsIkNvbmRpdGlvbiI6eyJEYXRlTGVzc1RoYW4iOnsiQVdTOkVwb2NoVGltZSI6MTc1NDc1MTYzM319fV19&Signature=U-m5T3Hz0IE51PC6yesi~UDz4o51qvYlyr3thCpuHMTLqcB-wM0ZPYGhb9wI8yxGzzyVjCd9jfHY1sK6eyFLfZJ6nbtppBCE9JnqxBm6pJxsCZKQqQ-EyZLSvsYZigKyitvRSb9Lp58dBxBd9vNluCFoUGq9tF6VcNNQnHP5Z~pjM14bTi7KG3th7mT1k0bKV3N0RQSMNYbIisD~Fh2ttyrQd3vSjvYdY7Kf8K~qhfDGtNYdpZJc09270s~kYeGy8nrCULA77qhFafPvFEbkAhRtqdXv4NqCa~KbPbQDh9QAt5wQACALtVvnBe5QStGON6ItXbqqSWZqoTzdvoM3Cw__&Key-Pair-Id=K2TK3EG287XSFC\" width=\"1024\"></p>\r\n\r\n<p><img height=\"1194\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/5618/RefundByLink-CO-1.jpg?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1LzU2MTgvUmVmdW5kQnlMaW5rLUNPLTEuanBnIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUxNjMzfX19XX0_&Signature=dAPPNwYwQjQAA7kVxin0n2Eh2jTkfPP-dMV3V8cgA-k2BjkDWlCWWp5yPTEJZ2u0taXHP9oDKH99U4e8fe3hnyiJjorrPeAZ9tVmbue~cDLa~o082p5s7SRVPdAS3GKClfz71qmdIRNegH3fca-21NbGavkHwWuIKsGqeH39dJ2T9Vh5Z2InJ77JkufDiSvoV-jrFqmZoj7jvXhsqlAAmKbvd0xhCmb5F40UNNBfQNkDsbb6oGGQXGdkvPP7XMxZ0tU84VLO~LJ3tf8LMf9fYQAkArUo-bZgWvPARmpq56m7LXQCiK2-A7MxIozOATiimzu5BCs9sdASNHyyqUYZLQ__&Key-Pair-Id=K2TK3EG287XSFC\" width=\"1024\"></p>\r\n\r\n<h3><a name=\"customer-service-refund-by-link\" id=\"customer-service-refund-by-link\"></a>Customer Service Refund by Link</h3>\r\n\r\n<p style=\"text-align: justify;\">In the contact center, the Refund by Link option can be enabled to be displayed as a payment option for capturing a new payment method for refund processing on the edit return order screen,&nbsp;alongside a credit card. Alternatively, Refund by Link can be enabled as the only payment option in scenarios where the contact center agents should not come into contact with sensitive payment data or are not required to collect credit card details from the customer.&nbsp;</p>\r\n\r\n<p>On the Refund by Link panel, the full refund due is displayed along with the Email Id and the customer phone number. Neither the CSR nor the customer can edit this amount. After a CSR clicks 'Send Email' or 'Send Text', a green icon is displayed if the outbound Email Message or Text Message was published successfully. This green icon does not indicate successful delivery of the email or text, as delivery is not currently tracked. If the Email Message or Text Message was not successfully published, then a red error icon or an&nbsp;error popup appears. The red error icon indicates that the message could not be posted to the queue, but the error popup indicates a data error (missing configuration, phone number, etc.).</p>\r\n\r\n<p style=\"text-align: justify;\">The customer receives an email or text&nbsp;and adds a new payment method on their own device. When the customer has completed this, they can verbally notify the CSR that the new payment method has been added if the CSR is still on the call. The CSR clicks the 'Refresh' button on the Refund by Link panel or 'Go Back To Return Details' button, and the customer service page refreshes to show the newly-added payment and updated refund transaction. If the refund transaction fails for the new payment method, the entire process will be repeated by the system, if&nbsp; refund retry is configured for the payment type.</p>\r\n\r\n<p>Within the Refund by Link panel, different methods of sending the link can be displayed:</p>\r\n\r\n<ul>\r\n\t<li>Send Email</li>\r\n\t<li>Send Text</li>\r\n\t<li>Copy URL</li>\r\n</ul>\r\n\r\n<div class=\"warning\" style=\"text-align: justify;\">The Email Id used to send Email messages&nbsp;and Phone No. used for sending the text message with the refund by link is populated automatically by the system from the return order and cannot be modified by the CSR.</div>\r\n\r\n<p style=\"text-align: justify;\">Refund by Link is always displayed as the first payment option on the customer service 'Add Payment Method' panel; this is not configurable. If additional payment types are supported, then they are listed below in the Refund by Link panel according to the configured sequence from the payment capture config. For instance, if the payment type, credit card, is configured with sequence '1' for assisted selling, and if Refund by Link is enabled, the 'Add Payment Method' panel lists Refund by Link at the top, followed by credit card.</p>\r\n\r\n<p>There is currently not any extensibility on the Refund by Link panel. Therefore, adding custom buttons, links, or text is not supported.</p>\r\n\r\n<h3><a name=\"refund-by-link-outbound-emails\" id=\"refund-by-link-outbound-emails\"></a>Refund by Link - Outbound Emails</h3>\r\n\r\n<p>When the CSR clicks 'Send Email', the customer receives&nbsp;an email with the link to add a new payment method for refund processing in Digital Self-Service. To send this email, an outbound Email Message json is published when the CSR clicks 'Send Email'. The Email Message json includes the Digital Self-Service Refund&nbsp;By Link URL and basic order information including customer email, name, items, and so on. Additional order fields can be included by using a template configuration (see <a hqid=\"2444800\" href=\"/transactional-emails\">here</a> for details).</p>\r\n\r\n<p>This Email Message json can be consumed in a few ways to generate the email:</p>\r\n\r\n<ol>\r\n\t<li>The Email Message json&nbsp;can be&nbsp;consumed by a third party email provider, who forms an email and delivers it to the customer.</li>\r\n\t<li>The Email Message json can be consumed by the Active®&nbsp;Omni email component, which can form the email body (HTML), and publish the HTML to a third party email provider who delivers the email as-is.</li>\r\n</ol>\r\n\r\n<p>See <a hqid=\"2444800\" href=\"/transactional-emails\">here</a> for more details on the supported email delivery options.</p>\r\n\r\n<h3><a name=\"refund-by-link-outbound-text-messages-nbsp\" id=\"refund-by-link-outbound-text-messages-nbsp\"></a>Refund by Link - Outbound Text Messages&nbsp;</h3>\r\n\r\n<p>When the CSR clicks 'Send Text', the customer receives&nbsp;a&nbsp;text&nbsp;with the link (using a short URL) to add&nbsp;a payment method for refund processing in Digital Self-Service. To send this text, an outbound Text&nbsp;Message json is published. The Text Message json includes the Digital Self-Service Refund By Link short URL and basic order information.</p>\r\n\r\n<p>To send text messages, two integrations are required:&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>A text provider, Twilio, is supported out of the box (using a retailer's Twilio account)</li>\r\n\t<li>A URL shortener, to provide a concise URL in the text message; Bitly is supported out of the box (using a retailer's Bitly account)</li>\r\n</ul>\r\n\r\n<p>Details on Text Message Configurations can be found <a href=\"https://omni.helpdocsonline.com/transactional-texts$how-to-enable-texts\">here</a>. Refer to <a href=\"https://omni.helpdocsonline.com/paybylink$sending-outbound-text-messages-with-twilio-for-u-s-phone-numbers\">Sending Outbound Text Messages with Twilio for U.S. Phone Numbers </a>and <a href=\"https://omni.helpdocsonline.com/paybylink$sending-outbound-text-messages-with-twilio-for-non-u-s-phone-numbers\">Sending Outbound Text Messages with Twilio for Non-U.S. Phone Numbers</a> for more details&nbsp;</p>\r\n\r\n<h3><a name=\"digital-self-service-refund-by-link\" id=\"digital-self-service-refund-by-link\"></a>Digital Self-Service Refund by Link</h3>\r\n\r\n<p style=\"text-align: justify;\">When a return invoice is generated with a refund&nbsp;amount, the system initiates a refund transaction to refund the amount to the customer to the original payment method used to pay the customer order - as configured in the system. If the refund transaction fails, the system can retry the refund&nbsp;transaction for the configured number&nbsp;of times configured for the refund transaction. When all attempts to process the refund transaction are exhausted, the customer is sent a refund by link to input another payment method to receive the refund amount.&nbsp;Currently, only credit card payment method&nbsp;is supported via refund by link.</p>\r\n\r\n<p>When the customer clicks the \"Add Payment Method for Refund Processing\" button in the&nbsp;email/text<strong>,&nbsp;</strong>on&nbsp;the Digital Self-Service&nbsp;Refund by Link page, the subtotal,&nbsp;tax, shipping, discount, and refund amount due are displayed&nbsp;along with the items being returned and order totals. When the customer clicks \"Next\" on the&nbsp;Digital Self-Service page, the browser directs them to&nbsp;the third party payment page to add the new credit card details. After the credit card details are added,&nbsp;a confirmation page is displayed that shows \"you're all set and your refund is in progress\".&nbsp;</p>\r\n\r\n<div class=\"warning\">Customers are not allowed to change the refund amount at any step mentioned above.</div>\r\n\r\n<div class=\"tip\"><strong>Note :</strong>&nbsp;Instructions to enable different payment methods and configuring a payment gateway for the same can be found in the&nbsp;<a href=\"https://omni.helpdocsonline.com/refundbylink$multiple-payment-gateways-configuration\">Multiple Payment Gateways Configuration</a>&nbsp;section.</div>\r\n\r\n<h5><a name=\"digital-self-service-integration-with-payment-providers\" id=\"digital-self-service-integration-with-payment-providers\"></a>Digital Self-Service Integration with Payment Providers</h5>\r\n\r\n<p>Out of the box integration with CyberSource and Adyen is provided. CyberSource provides some UI themeing capabilities, like changing the logo and background color.&nbsp;</p>\r\n\r\n<p>If the contact center is already using a secure hosted checkout with a different payment provider, then the integration may be similar to the contact center, but separate effort is required to integrate the Digital Self-Service Refund by Link page with the third party payment service provider's hosted checkout. The contact center integration cannot be reused as-is.&nbsp;</p>\r\n\r\n<p>There are a few key differences between the Digital Self-Service Refund by Link hosted checkout and the contact center hosted checkout:</p>\r\n\r\n<ul>\r\n\t<li>In Digital Self-Service, the customer needs to add their new credit card details in the third party payment page. In the contact center, this is done on the contact center page before launching the third party page, so only the credit card details are captured in the third party page.</li>\r\n\t<li>Digital Self-Service redirects to the hosted checkout page, and then back to Digital Self-Service in the same browser window, so there is no popup window. In the contact center, there is a popup window.</li>\r\n</ul>\r\n\r\n<h3><a name=\"refund-by-link-expiry\" id=\"refund-by-link-expiry\"></a>Refund by Link Expiry</h3>\r\n\r\n<p>The Digital Self-Service Refund by Link page expires after a period of time to remain secure. Upon loading the Refund by Link page, Digital Self-Service&nbsp;checks a field in the order entity (SelfServiceAttribute.RefundByLinkExpiryDate), and if this date is in the past, the customer is not able to add a payment method. A 'page expired' message is displayed, and the customer is not able to add payment method or view order details. If the expiry date is null on the order, then the Digital Self-Service page displays the expired state.</p>\r\n\r\n<p>The expiry date is populated when the 'Send Email' or 'Send Text' buttons are clicked in the contact center. If sending the customer links to launch the Digital Self-Service Refund by Link page from channels other than contact center, then call this API to ensure the expiry date is populated:&nbsp;/order/api/order/order/refundByLink</p>\r\n\r\n<p>The expiry date is saved in the database in UTC. When the UI&nbsp;loads, the expiry date is converted to the user's local time zone and compared with the current date/time.&nbsp;</p>\r\n\r\n<div class=\"tip\">Currently, the expiry date is calculated and populated&nbsp;only if Refund By Link&nbsp;Send Email' or 'Send Text' buttons are clicked in the contact center and cannot be calculated or populated either manually or by any other third party service provider.</div>\r\n\r\n<div class=\"info\"><strong>Note</strong>: Different link expiry time can be configured for Pay By Link and Refund By Link</div>\r\n\r\n<h3><a name=\"multiple-payment-gateways\" id=\"multiple-payment-gateways\"></a>Multiple Payment Gateways</h3>\r\n\r\n<p>The Digital Self-Service Refund by Link page allows users to select from different payment methods (currently only credit card is supported), if configured. For each of the payment methods, retailers can configure a different payment gateway, if needed.</p>\r\n\r\n<div class=\"tip\"><strong>Note :</strong> Instructions to enable different payment methods and configuring a payment gateway for the same can be found in the&nbsp;<a href=\"https://omni.helpdocsonline.com/refundbylink$multiple-payment-gateways-configuration\">Multiple Payment Gateways Configuration</a>&nbsp;section.</div>\r\n\r\n<h3><a name=\"configurations\" id=\"configurations\"></a>Configurations</h3>\r\n\r\n<h4><a name=\"order-configuration\" id=\"order-configuration\"></a>Order Configuration</h4>\r\n\r\n<p>To configure the valid time duration for the Digital Self-Service Refund by Link page,&nbsp;work with services to specify the expiry hours&nbsp;in the order.refundByLink.validity in the consul server (order component).&nbsp;For example, if you want the refund by link to be valid for 2 hours from the time it is generated, enter 2 hours&nbsp;in the&nbsp;configuration.&nbsp;</p>\r\n\r\n<p>Regardless of what is entered in the configuration, the application will consider&nbsp;a hard minimum of 1 hour&nbsp;and maximum of 24 hours (1&nbsp;days). Any value less than 1 hour&nbsp;will be considered 1 hour, and any value more than 24 hours will be considered 24 hours. Note that the application will not throw any errors if values less or greater than these are entered, but internally these limits will be enforced.&nbsp;</p>\r\n\r\n<h4><a name=\"customer-service-configuration-nbsp\" id=\"customer-service-configuration-nbsp\"></a>Customer Service Configuration&nbsp;</h4>\r\n\r\n<p>To enable the Refund by Link panel in customer service, the below-mentioned grants have to be provided for the CSR to access the Refund By Link panel:</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 810px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\" style=\"width: 262px;\"><strong>UI</strong></th>\r\n\t\t\t<th scope=\"col\" style=\"width: 211px;\"><strong>Button/Section</strong></th>\r\n\t\t\t<th scope=\"col\" style=\"width: 332px;\"><strong>Grant</strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 248px;\">Edit Return Order ⇾ Return Summary</td>\r\n\t\t\t<td style=\"width: 197px;\">Add Payment Method Button</td>\r\n\t\t\t<td style=\"width: 318px;\">customerservice::order::payment::addpaymentmethod</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td style=\"width: 248px;\">Edit Return Order ⇾ Return Summary ⇾&nbsp;Add Payment Method</td>\r\n\t\t\t<td style=\"width: 197px;\">Refund By Link Panel (drop-down)</td>\r\n\t\t\t<td style=\"width: 318px;\">customerservice::order::payment::addpaymentmethod::refundbylink</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>If either of these grants are not provided to the CSR, the CSR cannot access the Refund By link panel.&nbsp;The Refund by Link panel is supported on the Edit Return Order screen and edit Exchange Order screen. This single set of configurations controls&nbsp;whether Refund By Link is accessible by the CSR for both return orders and exchange orders.</p>\r\n\r\n<div class=\"warning\">Note: Refund By Link is not supported for any refund processing on customer orders resulting due to appeasements etc.</div>\r\n\r\n<h4><a name=\"digital-self-service-configuration\" id=\"digital-self-service-configuration\"></a>Digital Self-Service Configuration</h4>\r\n\r\n<p>The following configuration is required to enable Refund by Link in Digital Self-Service:</p>\r\n\r\n<ul>\r\n\t<li>Add a payment rule with Payment Type =&nbsp;'Credit Card' and Card Type = null. Because Digital Self-Service launches the third party payment gateway before the card type is selected, this rule must have null card type. The card type selection is completed on the third party payment page.</li>\r\n\t<li>For this payment rule, configure&nbsp;the&nbsp;third party gateway&nbsp;being used for Refund by Link (for example, CyberSource). Digital Self-Service uses this configuration to redirect to the&nbsp;third party gateway when the customer presses 'Next'.</li>\r\n\t<li>Update the UI styling to reflect your brand's logo, colors, and font (<a hqid=\"2465753\" href=\"/ui-theming-customization\">details here</a>). Note that this is only required once per deployment, so if this has been completed for other Digital Self-Service features, then it does not need to be done again.</li>\r\n\t<li>Review the UI labels and error messages for each supported locale/language,&nbsp;and work with services to update these as required.</li>\r\n</ul>\r\n\r\n<p>Refer <a href=\"https://omni.helpdocsonline.com/paybylink$payment-gateway-configuration\">here </a>for Payment Gateway Configuration.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: The configurations mentioned here are common to Pay By Link as well as Refund By Link</div>\r\n\r\n<h4><a name=\"refund-by-link-email-configuration-nbsp\" id=\"refund-by-link-email-configuration-nbsp\"></a>Refund by Link Email Configuration&nbsp;</h4>\r\n\r\n<p>To enable the Refund by Link emails to be delivered via the Active®&nbsp;Omni email component for testing purposes, ask services to set the&nbsp;consul server property&nbsp;<strong>config/com-manh-cp-email,om-side/email.publishEmailPayload = false</strong>.&nbsp;If this is set to true, then the email body payload is published to a queue (to be delivered by a third party email provider). If it's set to false, then the email should be delivered by Active® Omni.</p>\r\n\r\n<p>With the help of services, populate the consul server&nbsp;property <strong>order.selfServiceHostName</strong> with the host information for Digital-Self Service in Order Component (path: <strong>CONFIG/COM-MANH-CP-ORDER,OM-SIDE/</strong>). This ensures that the Digital Self-Service URL is ready to be included in emails or text messages. In the order component consul server config, add a value such as \"<strong>https://abc.manh.com</strong>\" for the selfServiceHostName property. Be sure to configure this with \"https:\" not \"http:\". If this is already completed for other Digital Self-Service flows, it does not need to be done again.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Order Configuration changes are required to generate the Refund by Link emails or texts automatically when refund retry is unsuccessful. The event is fired when the contact center user clicks 'Send Email' or 'Send Text', which triggers the outbound Email Message or Text Message.</div>\r\n\r\n<p>If using the Refund by Link email template in&nbsp;Active® Omni, then modify the HTML as needed to suit the retailer's brand. See below for a sample Refund by Link email template and&nbsp;Outbound Refund by Link email template from order to the Email component.</p>\r\n\r\n<p><div class=\"toggle_outerdiv\"><p class=\"toggle_div\"><a href=\"#tg-1\" class=\"toggle-content\"><span class=\"toggle-title\">Refund by Link Email Template</span></a></p><div id=\"tg-1\"><pre class=\"computer_code\">\n<code>{\n    &quot;TemplateId&quot;: &quot;RefundByLinkForRefundProcessing&quot;,\n    &quot;GroupName&quot;: &quot;EmailMessageService&quot;,\n    &quot;LogFailure&quot;: true,\n    &quot;Description&quot;: &quot;Sample email generated to request the customer adds payment via Digital Self-Service. This template can be used for reference purposes only&quot;,\n    &quot;ReplyToName&quot;: null,\n    &quot;Name&quot;: &quot;Sample refund by link template&quot;,\n    &quot;ReplyTo&quot;: &quot;cpadmin@manh.com&quot;,\n    &quot;FromName&quot;: &quot;Sophia&#39;s&quot;,\n    &quot;ConditionExpression&quot;: &quot;EmailMessageType contains \\&quot;RefundByLinkForRefundProcessing\\&quot;&quot;,\n    &quot;ReferenceField1&quot;: &quot;${OrderId}&quot;,\n    &quot;ReferenceField2&quot;: null,\n    &quot;ReferenceField3&quot;: &quot;${OrderTypeId}&quot;,\n    &quot;ReferenceField4&quot;: null,\n    &quot;ReferenceField5&quot;: null,\n    &quot;Subject&quot;: &quot;Update the payment method for refund processing for your Sophia&#39;s order ${OrderId}...&quot;,\n    &quot;FromEmail&quot;: &quot;cpadmin@manh.com&quot;,\n    &quot;ToAddress&quot;: [\n        {\n            &quot;ToAddressType&quot;: {\n                &quot;TypeId&quot;: &quot;TO&quot;\n            },\n            &quot;ToEmail&quot;: &quot;${CustomerEmail}&quot;,\n            &quot;ToName&quot;: &quot;${CustomerFirstName} ${CustomerLastName}&quot;\n        }\n    ],\n    &quot;LogSuccess&quot;: true,\n    &quot;Body&quot;: &quot;&lt;!DOCTYPE html PUBLIC \\&quot;-\\/\\/W3C\\/\\/DTD XHTML 1.0 Strict\\/\\/EN\\&quot; \\&quot;http:\\/\\/www.w3.org\\/TR\\/xhtml1\\/DTD\\/xhtml1-strict.dtd\\&quot;&gt;\\r\\n&lt;html xmlns=\\&quot;http:\\/\\/www.w3.org\\/1999\\/xhtml\\&quot;&gt;\\r\\n\\r\\n&lt;head&gt;\\r\\n  &lt;meta http-equiv=\\&quot;Content-Type\\&quot; content=\\&quot;text\\/html; charset=utf-8\\&quot; \\/&gt;\\r\\n  &lt;meta name=\\&quot;viewport\\&quot; content=\\&quot;width=device-width, initial-scale=1.0\\&quot; \\/&gt;\\r\\n  &lt;meta http-equiv=\\&quot;X-UA-Compatible\\&quot; content=\\&quot;IE=edge\\&quot;&gt;\\r\\n  &lt;title&gt;Order Confirmed Template&lt;\\/title&gt;\\r\\n  &lt;style type=\\&quot;text\\/css\\&quot;&gt;\\r\\n\\r\\n  \\/*Override Gmail link styling, which turns all link text blue *\\/\\r\\n  u + #body a {\\r\\n      color: inherit;\\r\\n      text-decoration: none;\\r\\n      font-size: inherit;\\r\\n      font-family: inherit;\\r\\n      font-weight: inherit;\\r\\n      line-height: inherit;\\r\\n  }\\r\\n  \\r\\n    #outlook a {\\r\\n      padding: 0;\\r\\n    }\\r\\n\\r\\n    \\/* Force Outlook to provide a \\&quot;view in browser\\&quot; menu link. *\\/\\r\\n    body {\\r\\n      font-family: \\&quot;Helvetica\\&quot;;\\r\\n      width: 100% !important;\\r\\n      -webkit-text-size-adjust: 100%;\\r\\n      -ms-text-size-adjust: 100%;\\r\\n      margin: 0;\\r\\n      padding: 0;\\r\\n    }\\r\\n\\r\\n.header {\\r\\n  padding: 1px;\\r\\n  text-align: center;\\r\\n  background: #982741;\\r\\n  color: white;\\r\\n  font-size: 14px;\\r\\n}\\r\\n\\r\\n    \\/* Prevent Webkit and Windows Mobile platforms from changing default font sizes, while not breaking desktop design. *\\/\\r\\n    .ExternalClass {\\r\\n      width: 100%;\\r\\n    }\\r\\n\\r\\n    \\/* Force Hotmail to display emails at full width *\\/\\r\\n    .ExternalClass,\\r\\n    .ExternalClass p,\\r\\n    .ExternalClass span,\\r\\n    .ExternalClass font,\\r\\n    .ExternalClass td,\\r\\n    .ExternalClass div {\\r\\n      line-height: 100%;\\r\\n      color: #000000;\\r\\n      font-family: \\&quot;Helvetica\\&quot;;\\r\\n    }\\r\\n\\r\\n    \\/* Force Hotmail to display normal line spacing.*\\/\\r\\n    #backgroundTable {\\r\\n      margin: 0;\\r\\n      padding: 0;\\r\\n      width: 100% !important;\\r\\n      line-height: 100% !important;\\r\\n    }\\r\\n\\r\\n    img {\\r\\n      outline: none;\\r\\n      text-decoration: none;\\r\\n      border: none;\\r\\n      -ms-interpolation-mode: bicubic;\\r\\n    }\\r\\n\\r\\n    a img {\\r\\n      border: none;\\r\\n    }\\r\\n\\r\\n    .image_fix {\\r\\n      display: block;\\r\\n    }\\r\\n\\r\\n    p {\\r\\n      color: #000000;\\r\\n      font-family: \\&quot;Helvetica\\&quot;;\\r\\n      margin: 0px 0px !important;\\r\\n    }\\r\\n\\r\\n    table td {\\r\\n      border-collapse: collapse;\\r\\n    }\\r\\n\\r\\n    table {\\r\\n      border-collapse: collapse;\\r\\n      mso-table-lspace: 0pt;\\r\\n      mso-table-rspace: 0pt;\\r\\n    }\\r\\n\\r\\n    a {\\r\\n      font-family: \\&quot;Helvetica\\&quot;;\\r\\n      color: #000000;\\r\\n      text-decoration: none;\\r\\n      text-decoration: none !important;\\r\\n    }\\r\\n\\r\\n    .PrimaryBgColor {\\r\\n      background-color: #982741;\\r\\n    }\\r\\n\\r\\n    .orderNumber {\\r\\n      font-size: 12px;\\r\\n      color: #000000;\\r\\n    }\\r\\n\\r\\n    .span {\\r\\n      color: #000000;\\r\\n    }\\r\\n\\r\\n    .h3 {\\r\\n      color: #000000;\\r\\n    }\\r\\n\\r\\n    .emailActionBttn,\\r\\n    .emailActionBttn:link,\\r\\n    .emailActionBttn:visited,\\r\\n    .emailActionBttn:active {\\r\\n        text-decoration: none;\\r\\n        text-align: center;\\r\\n        padding: 0.5em 1em;\\r\\n        font-size: 18px;\\r\\n        color: #FFFFFF;\\r\\n        background-color: #982741;\\r\\n        border-color: #982741;\\r\\n        border: 2px solid;\\r\\n        border-radius: 4px;\\r\\n    }\\r\\n\\r\\n    .emailActionBttn:hover {\\r\\n        background-color: #FFFFFF;\\r\\n        border-color: #982741;\\r\\n        color: #982741;\\r\\n    }\\r\\n\\r\\n    .productImg {\\r\\n      margin-right: 2rem;\\r\\n      width: 125px;\\r\\n      height: auto;\\r\\n      object-fit: cover;\\r\\n    }\\r\\n\\r\\n    .flexContainer {\\r\\n      display: flex;\\r\\n      align-items: center;\\r\\n      width: 400px;\\r\\n    }\\r\\n\\r\\n    .flexContainer2 {\\r\\n      display: flex;\\r\\n      align-items: center;\\r\\n      vertical-align: middle;\\r\\n      width: 400px;\\r\\n    }\\r\\n\\r\\n    .price {\\r\\n      margin-left: 6rem;\\r\\n    }\\r\\n\\r\\n    .sectionHeader {\\r\\n      line-height: 2;\\r\\n      font-family: Helvetica;\\r\\n      color: #ffffff;\\r\\n      font-size: 16px;\\r\\n    }\\r\\n\\r\\n    \\/*STYLES*\\/\\r\\n    table[class=full] {\\r\\n      width: 100%;\\r\\n      clear: both;\\r\\n    }\\r\\n\\r\\n    .header {\\r\\n      margin-top: 5%;\\r\\n      margin-bottom: 5%;\\r\\n      font-family: \\&quot;Helvetica\\&quot;;\\r\\n    }\\r\\n\\r\\n    .displayValue {\\r\\n      white-space: nowrap;\\r\\n      text-overflow: ellipsis;\\r\\n      overflow: hidden;\\r\\n      width: 123px;\\r\\n      display: inline-block;\\r\\n      vertical-align: bottom;\\r\\n      line-height: 37px;\\r\\n      font-family: Helvetica;\\r\\n      font-size: 14px;\\r\\n    }\\r\\n\\r\\n    .displayValue2 {\\r\\n      white-space: nowrap;\\r\\n      text-overflow: ellipsis;\\r\\n      overflow: hidden;\\r\\n      width: 300px;\\r\\n      display: inline-block;\\r\\n      vertical-align: bottom;\\r\\n      line-height: 37px;\\r\\n      font-family: Helvetica;\\r\\n      font-size: 14px;\\r\\n    }\\r\\n\\r\\n    \\/*IPAD STYLES*\\/\\r\\n    @media only screen and (max-width: 640px) {\\r\\n\\r\\n      a[href^=\\&quot;tel\\&quot;],\\r\\n      a[href^=\\&quot;sms\\&quot;] {\\r\\n        text-decoration: none;\\r\\n        color: #000000;\\r\\n        \\/* or whatever your want *\\/\\r\\n        pointer-events: none;\\r\\n        cursor: default;\\r\\n      }\\r\\n\\r\\n      .itemName {\\r\\n        font-size: 18px !important;\\r\\n        font-weight: 500 !important;\\r\\n      }\\r\\n\\r\\n      .sectionHeader {\\r\\n        align: left;\\r\\n        font-size: 18px !important;\\r\\n      }\\r\\n\\r\\n      .displayValue,\\r\\n      .displayValue2 {\\r\\n        font-size: 16px !important;\\r\\n      }\\r\\n\\r\\n      .mobile_link a[href^=\\&quot;tel\\&quot;],\\r\\n      .mobile_link a[href^=\\&quot;sms\\&quot;] {\\r\\n        text-decoration: default;\\r\\n        color: #000000 !important;\\r\\n        pointer-events: auto;\\r\\n        cursor: default;\\r\\n      }\\r\\n\\r\\n      table[class=devicewidth] {\\r\\n        width: 440px !important;\\r\\n        text-align: left !important;\\r\\n      }\\r\\n\\r\\n      table[class=devicewidthinner] {\\r\\n        width: 420px !important;\\r\\n        text-align: left !important;\\r\\n      }\\r\\n\\r\\n      img[class=banner] {\\r\\n        width: 225px !important;\\r\\n        height: 375px !important;\\r\\n      }\\r\\n\\r\\n      img[class=colimg2] {\\r\\n        width: 225px !important;\\r\\n        height: 375px !important;\\r\\n      }\\r\\n\\r\\n      .emailActionBttn,\\r\\n      .emailActionBttn:link,\\r\\n      .emailActionBttn:visited,\\r\\n      .emailActionBttn:active {\\r\\n        text-decoration: none;\\r\\n        text-align: center;\\r\\n        padding: 0.5em 1em;\\r\\n        font-size: 18px;\\r\\n        color: #FFFFFF;\\r\\n        background-color: #982741;\\r\\n        border-color: #982741;\\r\\n        border: 2px solid;\\r\\n        border-radius: 4px;\\r\\n      }\\r\\n\\r\\n      .emailActionBttn:hover {\\r\\n        background-color: #FFFFFF;\\r\\n        border-color: #982741;\\r\\n        color: #982741;\\r\\n      }\\r\\n    }\\r\\n\\r\\n    \\/*IPHONE STYLES*\\/\\r\\n    @media only screen and (max-width: 480px) {\\r\\n\\r\\n      a[href^=\\&quot;tel\\&quot;],\\r\\n      a[href^=\\&quot;sms\\&quot;] {\\r\\n        text-decoration: none;\\r\\n        color: #000000;\\r\\n        \\/* or whatever your want *\\/\\r\\n        pointer-events: none;\\r\\n        cursor: default;\\r\\n      }\\r\\n\\r\\n      .itemName {\\r\\n        font-size: 18px !important;\\r\\n        font-weight: 500 !important;\\r\\n      }\\r\\n\\r\\n      .sectionHeader {\\r\\n        align: left;\\r\\n        font-size: 18px !important;\\r\\n      }\\r\\n\\r\\n      .displayValue,\\r\\n      .displayValue2 {\\r\\n        font-size: 16px !important;\\r\\n      }\\r\\n\\r\\n      .mobile_link a[href^=\\&quot;tel\\&quot;],\\r\\n      .mobile_link a[href^=\\&quot;sms\\&quot;] {\\r\\n        text-decoration: default;\\r\\n        color: #000000 !important;\\r\\n        pointer-events: auto;\\r\\n        cursor: default;\\r\\n      }\\r\\n\\r\\n      table[class=devicewidth] {\\r\\n        width: 280px !important;\\r\\n        text-align: left !important;\\r\\n      }\\r\\n\\r\\n      table[class=devicewidthinner] {\\r\\n        width: 260px !important;\\r\\n        text-align: left !important;\\r\\n      }\\r\\n\\r\\n      img[class=banner] {\\r\\n        width: 225px !important;\\r\\n        height: 375px !important;\\r\\n      }\\r\\n\\r\\n      img[class=colimg2] {\\r\\n        width: 225px !important;\\r\\n        height: 375px !important;\\r\\n      }\\r\\n\\r\\n      td[class=mobile-hide] {\\r\\n        display: none !important;\\r\\n      }\\r\\n\\r\\n      td[class=\\&quot;padding-bottom25\\&quot;] {\\r\\n        padding-bottom: 25px !important;\\r\\n      }\\r\\n\\r\\n      .emailActionBttn,\\r\\n      .emailActionBttn:link,\\r\\n      .emailActionBttn:visited,\\r\\n      .emailActionBttn:active {\\r\\n        text-decoration: none;\\r\\n        text-align: center;\\r\\n        padding: 0.5em 1em;\\r\\n        font-size: 18px;\\r\\n        color: #FFFFFF;\\r\\n        background-color: #982741;\\r\\n        border-color: #982741;\\r\\n        border: 2px solid;\\r\\n        border-radius: 4px;\\r\\n      }\\r\\n\\r\\n      .emailActionBttn:hover {\\r\\n        background-color: #FFFFFF;\\r\\n        border-color: #982741;\\r\\n        color: #982741;\\r\\n      }\\r\\n    }\\r\\n  &lt;\\/style&gt;\\r\\n&lt;\\/head&gt;\\r\\n\\r\\n&lt;body id=\\&quot;body\\&quot;&gt;\\r\\n  &lt;#setting number_format=\\&quot;$#,##0.00; $#,##0.00\\&quot;&gt;\\r\\n    &lt;!-- Start of preheader --&gt;\\r\\n    &lt;table class=\\&quot;flexcontainer\\&quot; width=\\&quot;100%\\&quot; bgcolor=\\&quot;#ffffff\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; id=\\&quot;backgroundTable\\&quot;&gt;\\r\\n      &lt;tbody&gt;\\r\\n        &lt;tr&gt;\\r\\n          &lt;td&gt;\\r\\n            &lt;table width=\\&quot;600\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; align=\\&quot;center\\&quot; class=\\&quot;flexcontainer\\&quot;&gt;\\r\\n              &lt;tbody&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;td width=\\&quot;100%\\&quot;&gt;\\r\\n                    &lt;table width=\\&quot;600\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; align=\\&quot;center\\&quot; class=\\&quot;flexcontainer\\&quot;&gt;\\r\\n                      &lt;tbody&gt;\\r\\n                        &lt;tr&gt;\\r\\n                          &lt;td&gt;\\r\\n                            &lt;table width=\\&quot;300\\&quot; align=\\&quot;center\\&quot; border=\\&quot;0\\&quot; cellpadding=\\&quot;0px\\&quot; cellspacing=\\&quot;0\\&quot; class=\\&quot;flexcontainer\\&quot;&gt;\\r\\n                              &lt;tbody&gt;\\r\\n                                &lt;tr&gt;\\r\\n                                  &lt;td padding-bottom=\\&quot;0\\&quot; align=\\&quot;center\\&quot;&gt;\\r\\n                                    &lt;img width=\\&quot;300\\&quot; src=\\&quot;https:\\/\\/res.cloudinary.com\\/com-manh-cp\\/image\\/upload\\/v1585061036\\/digitalSelfService\\/Sophia_s-logo-centered.png\\&quot;&gt;\\r\\n                                  &lt;\\/td&gt;\\r\\n                                &lt;\\/tr&gt;\\r\\n                              &lt;\\/tbody&gt;\\r\\n                            &lt;\\/table&gt;\\r\\n                          &lt;\\/td&gt;\\r\\n                        &lt;\\/tr&gt;\\r\\n                      &lt;\\/tbody&gt;\\r\\n                    &lt;\\/table&gt;\\r\\n                  &lt;\\/td&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n              &lt;\\/tbody&gt;\\r\\n            &lt;\\/table&gt;\\r\\n          &lt;\\/td&gt;\\r\\n        &lt;\\/tr&gt;\\r\\n      &lt;\\/tbody&gt;\\r\\n    &lt;\\/table&gt;\\r\\n    &lt;!-- End of preheader --&gt;\\r\\n    &lt;!-- Start Full Text --&gt;\\r\\n    &lt;table width=\\&quot;100%\\&quot; bgcolor=\\&quot;#ffffff\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; id=\\&quot;backgroundTable\\&quot;&gt;\\r\\n      &lt;tbody&gt;\\r\\n        &lt;tr&gt;\\r\\n          &lt;td&gt;\\r\\n            &lt;table width=\\&quot;500\\&quot; align=\\&quot;center\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; class=\\&quot;devicewidthinner\\&quot;&gt;\\r\\n              &lt;tbody&gt;\\r\\n                &lt;!-- Title --&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;td align=\\&quot;center\\&quot; height=\\&quot;20\\&quot; style=\\&quot;font-size:1px; line-height:1px;\\&quot;&gt;&nbsp;&lt;\\/td&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n                &lt;!-- End of Title --&gt;\\r\\n                &lt;!-- Title --&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;div style=\\&quot;font-size: 18px; color: #000000; line-height: 30px; font-family: Helvetica\\&quot; align=\\&quot;center\\&quot;&gt;Hi&lt;#if CustomerFirstName??&gt; ${CustomerFirstName}&lt;\\/#if&gt;!&lt;\\/div&gt;\\r\\n                  &lt;div style=\\&quot;font-size: 18px; color: #000000; line-height: 30px; font-family: Helvetica\\&quot; align=\\&quot;center\\&quot;&gt;Please update your refund payment method details&lt;\\/div&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n                &lt;!-- End of Title --&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;div style=\\&quot;font-size: 15px; line-height: 30px; \\&quot; align=\\&quot;center\\&quot;&gt;\\r\\n                    &lt;p style=\\&quot;color:#000000;font-family: Helvetica\\&quot;&gt; Order: ${OrderId}&lt;\\/p&gt;\\r\\n                  &lt;\\/div&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n                &lt;!-- Spacing --&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;td width=\\&quot;100%\\&quot; height=\\&quot;20\\&quot;&gt;&lt;\\/td&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n                &lt;!-- Spacing --&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;div style=\\&quot;font-size: 15px;\\&quot; align=\\&quot;center\\&quot;&gt;\\r\\n\\r\\n                    &lt;p style=\\&quot;font-family:Helvetica; line-height: 25px; color:#000000;\\&quot;&gt;Click Below to Add or Update Your Payment Method for Refund Processing.&lt;\\/p&gt;\\r\\n\\r\\n                  &lt;\\/div&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n                &lt;!-- Add Payment button --&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;td align=\\&quot;center\\&quot; height=\\&quot;20\\&quot; style=\\&quot;font-size:1px; line-height:1px;\\&quot;&gt;&nbsp;&lt;\\/td&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;td width=\\&quot;600\\&quot; style=\\&quot;font-size: 16px; color: #fff; line-height: 30px;\\&quot; align=\\&quot;center\\&quot;&gt;\\r\\n                    &lt;a class=\\&quot;emailActionBttn\\&quot; \\r\\n                      href=\\&quot;${SelfServiceUrl}\\&quot;&gt;Add Payment Method for Refund Processing&lt;\\/a&gt;\\r\\n                  &lt;\\/td&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n                &lt;!-- End of content --&gt;\\r\\n                &lt;!-- End of content --&gt;\\r\\n              &lt;\\/tbody&gt;\\r\\n            &lt;\\/table&gt;\\r\\n          &lt;\\/td&gt;\\r\\n        &lt;\\/tr&gt;\\r\\n      &lt;\\/tbody&gt;\\r\\n    &lt;\\/table&gt;\\r\\n    &lt;br&gt;\\r\\n    &lt;!-- Items --&gt;\\r\\n\\r\\n    &lt;table width=\\&quot;100%\\&quot; style=\\&quot;background-color: #982741\\&quot;; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; id=\\&quot;backgroundTable\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n      &lt;tbody&gt;\\r\\n        &lt;tr&gt;\\r\\n          &lt;td&gt;\\r\\n            &lt;table width=\\&quot;600\\&quot; style=\\&quot;background-color: #982741; text-align: center\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; align=\\&quot;center\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n              &lt;tbody&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;td width=\\&quot;100%\\&quot;&gt;\\r\\n                    &lt;p&gt; &lt;span class=\\&quot;sectionHeader\\&quot;&gt;Returned Items&lt;\\/span&gt; &lt;\\/p&gt;\\r\\n                  &lt;\\/td&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n              &lt;\\/tbody&gt;\\r\\n            &lt;\\/table&gt;\\r\\n          &lt;\\/td&gt;\\r\\n        &lt;\\/tr&gt;\\r\\n      &lt;\\/tbody&gt;\\r\\n    &lt;\\/table&gt;\\r\\n\\r\\n\\r\\n    &lt;table width=\\&quot;100%\\&quot; bgcolor=\\&quot;#ffffff\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; id=\\&quot;backgroundTable\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n      &lt;tbody&gt;\\r\\n        &lt;tr&gt;\\r\\n          &lt;td&gt;\\r\\n            &lt;table width=\\&quot;600\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; align=\\&quot;center\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n              &lt;tbody&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;td width=\\&quot;100%\\&quot;&gt;\\r\\n                    &lt;table bgcolor=\\&quot;#ffffff\\&quot; width=\\&quot;600\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; align=\\&quot;center\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n                      &lt;tbody&gt;\\r\\n                        &lt;tr&gt;\\r\\n                          &lt;td&gt;\\r\\n                            &lt;!-- start of column --&gt;\\r\\n                            &lt;table width=\\&quot;600\\&quot; align=\\&quot;center\\&quot; border=\\&quot;0\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n                              &lt;tbody&gt;\\r\\n                                &lt;!-- Spacing --&gt;\\r\\n                                &lt;tr&gt;\\r\\n                                  &lt;td style=\\&quot;font-family: Helvetica, arial, sans-serif\\&quot;&gt;\\r\\n                                    &lt;!-- start of text content table --&gt;\\r\\n                                    &lt;table class=\\&quot;flexContainer\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; style=\\&quot;margin-top: 2%\\&quot; align=\\&quot;left\\&quot;&gt;\\r\\n                                      &lt;tbody&gt;\\r\\n                                        &lt;#list OrderedItems as Details&gt;\\r\\n                                          &lt;tr&gt;\\r\\n                                            &lt;td&gt;\\r\\n                                              &lt;table class=\\&quot;flexContainer\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; style=\\&quot;margin-top: 5%;\\&quot; align=\\&quot;left\\&quot;&gt;\\r\\n                                                &lt;tbody&gt;\\r\\n\\r\\n                                                  &lt;tr&gt;\\r\\n                                                    &lt;td&gt;\\r\\n                                                      &lt;#if Details.ItemSmallImageURI??&gt;&lt;img src=\\&quot;${Details.ItemSmallImageURI}\\&quot; width=\\&quot;125\\&quot; align=\\&quot;left\\&quot;&gt;&lt;\\/#if&gt;\\r\\n                                                    &lt;\\/td&gt;\\r\\n                                                    &lt;td&gt;\\r\\n                                                      &lt;table width=\\&quot;300\\&quot; align=\\&quot;right\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot;&gt;\\r\\n                                                        &lt;br&gt;&lt;br&gt;\\r\\n                                                        &lt;tr&gt;\\r\\n\\r\\n                                                          &lt;td style=\\&quot;font-size:16px; line-height:30px; font-family:Helvetica; font-weight:bold\\&quot;&gt;\\r\\n                                                            &lt;#if Details.ItemShortDescription??&gt; ${Details.ItemShortDescription}&lt;\\/#if&gt;\\r\\n                                                          &lt;\\/td&gt;\\r\\n\\r\\n                                                        &lt;\\/tr&gt;\\r\\n                                                        &lt;tr&gt;\\r\\n\\r\\n                                                          &lt;td style=\\&quot;font-size:14px; line-height:20px; font-family:Helvetica\\&quot;&gt;Size: &lt;#if Details.ItemSize??&gt;${Details.ItemSize}&lt;\\/#if&gt;\\r\\n                                                          &lt;\\/td&gt;\\r\\n\\r\\n                                                        &lt;\\/tr&gt;\\r\\n                                                        &lt;tr&gt;\\r\\n                                                          &lt;td style=\\&quot;font-size:14px; line-height:20px; font-family:Helvetica\\&quot;&gt;Qty: ${Details.Quantity?string(\\&quot;,##0\\&quot;)}&lt;\\/td&gt;\\r\\n                                                        &lt;\\/tr&gt;\\r\\n                                                        &lt;tr&gt;\\r\\n\\r\\n                                                          &lt;td style=\\&quot;font-size:14px; line-height:20px; font-family:Helvetica\\&quot;&gt;Color: &lt;#if Details.ItemColorDescription??&gt;${Details.ItemColorDescription}&lt;\\/#if&gt;\\r\\n                                                          &lt;\\/td&gt;\\r\\n\\r\\n                                                        &lt;\\/tr&gt;\\r\\n                                                        &lt;tr&gt;\\r\\n\\r\\n                                                          &lt;td style=\\&quot;font-size:14px; line-height:20px; font-family:Helvetica\\&quot;&gt;Price: &lt;#if !Details.UnitPrice??&gt;$0.00 &lt;#else&gt;${Details.UnitPrice}&lt;\\/#if&gt;\\r\\n                                                          &lt;\\/td&gt;\\r\\n                                                        &lt;\\/tr&gt;\\r\\n                                                        &lt;tr&gt;\\r\\n                                                          &lt;td style=\\&quot;font-size:14px; line-height:20px; font-family:Helvetica\\&quot;&gt;Item: ${Details.ItemId}&lt;\\/td&gt;\\r\\n                                                        &lt;\\/tr&gt;\\r\\n                                                      &lt;\\/table&gt;\\r\\n                                                    &lt;\\/td&gt;\\r\\n                                                  &lt;\\/tr&gt;\\r\\n\\r\\n                                                &lt;\\/tbody&gt;\\r\\n                                              &lt;\\/table&gt;\\r\\n                                            &lt;\\/td&gt;\\r\\n                                          &lt;\\/tr&gt;\\r\\n                                          &lt;tr style=\\&quot;clear:both;height:60px\\&quot;&gt; &lt;\\/tr&gt;\\r\\n                                        &lt;\\/#list&gt;\\r\\n                                      &lt;\\/tbody&gt;\\r\\n                                      &lt;tr style=\\&quot;clear:both;margin-top: 4%\\&quot;&gt;&lt;\\/tr&gt;\\r\\n                                    &lt;\\/table&gt;\\r\\n                                    &lt;!-- end of text content table --&gt;\\r\\n                                  &lt;\\/td&gt;\\r\\n                                &lt;\\/tr&gt;\\r\\n                              &lt;\\/tbody&gt;\\r\\n                            &lt;\\/table&gt;\\r\\n                          &lt;\\/td&gt;\\r\\n                        &lt;\\/tr&gt;\\r\\n                      &lt;\\/tbody&gt;\\r\\n                    &lt;\\/table&gt;\\r\\n                  &lt;\\/td&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n              &lt;\\/tbody&gt;\\r\\n            &lt;\\/table&gt;\\r\\n          &lt;\\/td&gt;\\r\\n        &lt;\\/tr&gt;\\r\\n      &lt;\\/tbody&gt;\\r\\n    &lt;\\/table&gt;\\r\\n    &lt;br&gt;\\r\\n    &lt;!-- end of items --&gt;\\r\\n    &lt;!-- Start Full Text --&gt;\\r\\n    &lt;table width=\\&quot;100%\\&quot; style=\\&quot;background-color: #982741\\&quot;; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; id=\\&quot;backgroundTable\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n      &lt;tbody&gt;\\r\\n        &lt;tr&gt;\\r\\n          &lt;td&gt;\\r\\n            &lt;table width=\\&quot;600\\&quot; style=\\&quot;background-color: #982741; text-align: center\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; align=\\&quot;center\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n              &lt;tbody&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;td width=\\&quot;100%\\&quot;&gt;\\r\\n                    &lt;p&gt; &lt;span class=\\&quot;sectionHeader\\&quot;&gt;Order Summary&lt;\\/span&gt; &lt;\\/p&gt;\\r\\n                  &lt;\\/td&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n              &lt;\\/tbody&gt;\\r\\n            &lt;\\/table&gt;\\r\\n          &lt;\\/td&gt;\\r\\n        &lt;\\/tr&gt;\\r\\n      &lt;\\/tbody&gt;\\r\\n    &lt;\\/table&gt;\\r\\n\\r\\n    &lt;table width=\\&quot;100%\\&quot; bgcolor=\\&quot;#ffffff\\&quot; cellpadding=\\&quot;10\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; id=\\&quot;backgroundTable\\&quot;&gt;\\r\\n      &lt;tbody&gt;\\r\\n        &lt;tr&gt;\\r\\n          &lt;td&gt;\\r\\n            &lt;table width=\\&quot;600\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; align=\\&quot;center\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n              &lt;tbody&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;td width=\\&quot;100%\\&quot;&gt;\\r\\n                    &lt;table width=\\&quot;600\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; align=\\&quot;center\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n                      &lt;tbody&gt;\\r\\n                        &lt;tr&gt;\\r\\n                          &lt;td&gt;\\r\\n                            &lt;table width=\\&quot;600\\&quot; align=\\&quot;center\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n                              &lt;tbody&gt;\\r\\n                                &lt;!-- content --&gt;\\r\\n                                &lt;tr&gt;\\r\\n                                  &lt;td style=\\&quot;font-size: 13px;  line-height: 20px; width: 100%\\&quot; align=\\&quot;left\\&quot;&gt;\\r\\n                                    &lt;p style=\\&quot;font-family: Helvetica; text-align: left\\&quot;&gt;Subtotal:&lt;\\/p&gt;\\r\\n                                    &lt;p style=\\&quot;font-family: Helvetica; text-align: left\\&quot;&gt;Shipping:&lt;\\/p&gt;\\r\\n                                    &lt;p style=\\&quot;font-family: Helvetica; text-align: left\\&quot;&gt;Discounts:&lt;\\/p&gt;\\r\\n                                    &lt;p style=\\&quot;font-family: Helvetica; text-align: left\\&quot;&gt;Taxes:&lt;\\/p&gt;\\r\\n                                    &lt;p style=\\&quot;font-family: Helvetica; text-align: left; font-weight:bold\\&quot;&gt;Total:&lt;\\/p&gt;\\r\\n                                  &lt;\\/td&gt;\\r\\n                                  &lt;td style=\\&quot;font-size: 13px;  line-height: 20px; width: 100%\\&quot; align=\\&quot;right\\&quot;&gt;\\r\\n                                    &lt;p style=\\&quot;font-family: Helvetica;\\&quot;&gt;&lt;#if !OrderSubTotal??&gt;$0.00 &lt;#else&gt;${OrderSubTotal}&lt;\\/#if&gt;&lt;\\/p&gt;\\r\\n                                    &lt;p style=\\&quot;font-family: Helvetica;\\&quot;&gt;&lt;#if !TotalCharges??&gt;$0.00 &lt;#else&gt;${TotalCharges}&lt;\\/#if&gt;&lt;\\/p&gt;\\r\\n                                    &lt;p style=\\&quot;color: #000000;font-family: Helvetica\\&quot;&gt;&lt;#if !TotalDiscounts??&gt;$0.00 &lt;#else&gt;${TotalDiscounts}&lt;\\/#if&gt;&lt;\\/p&gt;\\r\\n                                    &lt;p style=\\&quot;color: #000000;font-family: Helvetica\\&quot;&gt;&lt;#if !TotalTaxes??&gt;$0.00 &lt;#else&gt;${TotalTaxes}&lt;\\/#if&gt;&lt;\\/p&gt;\\r\\n                                    &lt;p style=\\&quot;color: #000000;font-family: Helvetica; font-weight:bold\\&quot;&gt;&lt;#if !OrderTotal??&gt;$0.00 &lt;#else&gt;${OrderTotal}&lt;\\/#if&gt;&lt;\\/p&gt;\\r\\n                                  &lt;\\/td\\r\\n                                &lt;\\/tr&gt;\\r\\n                                &lt;!-- End of content --&gt;\\r\\n                                &lt;!-- Title --&gt;\\r\\n                                &lt;br&gt;\\r\\n                                &lt;!-- End of Title --&gt;\\r\\n                                &lt;!-- beginning of seperator --&gt;\\r\\n                              &lt;\\/tbody&gt;\\r\\n                            &lt;\\/table&gt;\\r\\n                            &lt;table width=\\&quot;100%\\&quot; bgcolor=\\&quot;#ffffff\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; id=\\&quot;backgroundTable\\&quot;&gt;\\r\\n                              &lt;tbody&gt;\\r\\n                                &lt;tr&gt;\\r\\n                                  &lt;td&gt;\\r\\n                                    &lt;table width=\\&quot;600\\&quot; align=\\&quot;center\\&quot; cellspacing=\\&quot;0\\&quot; cellpadding=\\&quot;0\\&quot; border=\\&quot;0\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n                                      &lt;tbody&gt;\\r\\n                                        &lt;tr&gt;\\r\\n                                          &lt;td align=\\&quot;center\\&quot; height=\\&quot;6\\&quot; style=\\&quot;font-size:1px; line-height:1px;\\&quot;&gt; &nbsp;&lt;\\/td&gt;\\r\\n                                        &lt;\\/tr&gt;\\r\\n                                        &lt;tr&gt;\\r\\n                                          &lt;td width=\\&quot;600\\&quot; align=\\&quot;center\\&quot; height=\\&quot;1\\&quot; bgcolor=\\&quot;#d1d1d1\\&quot; style=\\&quot;font-size:1px; line-height:1px;\\&quot;&gt; &nbsp;&lt;\\/td&gt;\\r\\n                                        &lt;\\/tr&gt;\\r\\n                                        &lt;tr&gt;\\r\\n                                          &lt;td align=\\&quot;center\\&quot; height=\\&quot;20\\&quot; style=\\&quot;font-size:1px; line-height:1px;\\&quot;&gt; &nbsp;&lt;\\/td&gt;\\r\\n                                        &lt;\\/tr&gt;\\r\\n\\r\\n                                      &lt;\\/tbody&gt;\\r\\n                                    &lt;\\/table&gt;\\r\\n                                  &lt;\\/td&gt;\\r\\n                                &lt;\\/tr&gt;\\r\\n                              &lt;\\/tbody&gt;\\r\\n                            &lt;\\/table&gt;\\r\\n                          &lt;\\/td&gt;\\r\\n                        &lt;\\/tr&gt;\\r\\n                      &lt;\\/tbody&gt;\\r\\n                    &lt;\\/table&gt;\\r\\n                  &lt;\\/td&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n              &lt;\\/tbody&gt;\\r\\n            &lt;\\/table&gt;\\r\\n          &lt;\\/td&gt;\\r\\n        &lt;\\/tr&gt;\\r\\n      &lt;\\/tbody&gt;\\r\\n    &lt;\\/table&gt;\\r\\n    &lt;!-- end of full text --&gt;\\r\\n    &lt;table width=\\&quot;100%\\&quot; bgcolor=\\&quot;#ffffff\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; id=\\&quot;backgroundTable\\&quot;&gt;\\r\\n      &lt;tbody&gt;\\r\\n        &lt;tr&gt;\\r\\n          &lt;td&gt;\\r\\n            &lt;table width=\\&quot;600\\&quot; cellpadding=\\&quot;0\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; align=\\&quot;center\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n              &lt;tbody&gt;\\r\\n                &lt;tr&gt;\\r\\n                  &lt;td width=\\&quot;100%\\&quot;&gt;\\r\\n                    &lt;table width=\\&quot;100%\\&quot; cellpadding=\\&quot;10px\\&quot; cellspacing=\\&quot;0\\&quot; border=\\&quot;0\\&quot; align=\\&quot;center\\&quot; class=\\&quot;devicewidth\\&quot;&gt;\\r\\n                      &lt;tbody&gt;\\r\\n                        &lt;tr&gt;\\r\\n                          &lt;td align=\\&quot;center\\&quot; valign=\\&quot;middle\\&quot;&gt;\\r\\n                            &lt;p style=\\&quot;font-size:15px;font-family: Helvetica;font-weight:bold;color :  #000000\\&quot;&gt;My Account | Support | Privacy Policy&lt;\\/p&gt;\\r\\n                            &lt;hr class=\\&quot;seperator\\&quot;&gt;\\r\\n                            &lt;p style=\\&quot;color: #000000;font-size:10px;font-family: Helvetica\\&quot;&gt;This message was sent to ${CustomerEmail}&lt;\\/p&gt;\\r\\n                            &lt;p style=\\&quot;color: #000000;font-size:10px\\&quot;&gt;2019 Sophia&#39;s Inc. Sophia&#39;s and the Sophia&#39;s Outlet logo are registered trademarks&lt;\\/p&gt;\\r\\n                            &lt;p style=\\&quot;color: #000000;font-size:10px;font-family: Helvetica\\&quot;&gt;of Sophia&#39;s Inc 2300 Windy Ridge Parkway, Atlanta GA 30339.&lt;\\/p&gt;\\r\\n                          &lt;\\/td&gt;\\r\\n                        &lt;\\/tr&gt;\\r\\n                        &lt;tr&gt;\\r\\n                          &lt;td align=\\&quot;center\\&quot; valign=\\&quot;middle\\&quot;&gt;\\r\\n                            &lt;p style=\\&quot;font-size:10px;font-family: Helvetica\\&quot;&gt;&lt;\\/p&gt;\\r\\n                            &lt;hr class=\\&quot;seperator\\&quot;&gt;\\r\\n                            &lt;p style=\\&quot;color:  #bfbfbf;font-size:10px\\&quot;&gt;*This email was sent from a notification-only address that cannot accept incoming email. Please do not reply to this message.&lt;\\/p&gt;\\r\\n                          &lt;\\/td&gt;\\r\\n                        &lt;\\/tr&gt;\\r\\n                        &lt;!-- Spacing --&gt;\\r\\n                        &lt;tr&gt;\\r\\n                          &lt;td width=\\&quot;100%\\&quot; height=\\&quot;20\\&quot;&gt;&lt;\\/td&gt;\\r\\n                        &lt;\\/tr&gt;\\r\\n                        &lt;!-- Spacing --&gt;\\r\\n                      &lt;\\/tbody&gt;\\r\\n                    &lt;\\/table&gt;\\r\\n                  &lt;\\/td&gt;\\r\\n                &lt;\\/tr&gt;\\r\\n              &lt;\\/tbody&gt;\\r\\n            &lt;\\/table&gt;\\r\\n          &lt;\\/td&gt;\\r\\n        &lt;\\/tr&gt;\\r\\n      &lt;\\/tbody&gt;\\r\\n    &lt;\\/table&gt;\\r\\n    &lt;!-- End of postfooter --&gt;\\r\\n&lt;\\/body&gt;\\r\\n\\r\\n&lt;\\/html&gt;\\r\\n&quot;\n  }</code></pre>\n</div></div></p>\r\n\r\n<h4><a name=\"refund-by-link-text-message-configuration\" id=\"refund-by-link-text-message-configuration\"></a>Refund by Link Text Message Configuration</h4>\r\n\r\n<p>See the <a href=\"https://omni.helpdocsonline.com/transactional-texts$refund-by-link-nbsp-text-sample-nbsp\">Transactional Text Guide</a> for the required configuration for generating Refund by Link text messages. Here is a sample Refund by Link text template:</p>\r\n\r\n<p><div class=\"toggle_outerdiv\"><p class=\"toggle_div\"><a href=\"#tg-2\" class=\"toggle-content\"><span class=\"toggle-title\">Refund by Link Text Template</span></a></p><div id=\"tg-2\"><pre class=\"computer_code\">\n{\n      &quot;Description&quot;: &quot;Text message to send the Refund By Link to the customer.&quot;,\n      &quot;TemplateMsgId&quot;: &quot;RefundByLinkForRefundProcessing&quot;,\n      &quot;ConditionalExpression&quot;: &quot;Order.TextMessageType contains \\&quot;RefundByLinkForRefundProcessing\\&quot;&quot;,\n      &quot;MessagePrefixInterval&quot;: 0,\n      &quot;Name&quot;: &quot;RefundByLink&quot;,\n      &quot;MessagePrefix&quot;: null,\n      &quot;MessageSuffixInterval&quot;: 0,\n      &quot;SequenceNumber&quot;: null,\n      &quot;TextMessageType&quot;: {\n        &quot;TextMessageTypeId&quot;: &quot;Transactional&quot;\n      },\n      &quot;MessageBody&quot;: &quot;Hi ${Order.CustomerFirstName}! Please input a new payment method to receive your refund for Order No.: ${Order.OrderId} by clicking on the link: ${Order.DSSUrl}&quot;\n    }</pre>\n</div></div></p>\r\n\r\n<h4><a name=\"multiple-payment-gateways-configuration\" id=\"multiple-payment-gateways-configuration\"></a>Multiple Payment Gateways Configuration</h4>\r\n\r\n<ul>\r\n\t<li>In the application's 'Payment Capture Config', the retailer can select a payment type ( / method)&nbsp;which needs to be displayed on the Refund by Link page. In order for this payment type to be visible on the Refund By Link page, the checkbox 'Permit SelfService Sales' in the 'Detail' tab should be checked.</li>\r\n\t<li>For each of the&nbsp;payment types configured in the 'Payment Capture Config', a different payment gateway can be assigned by following the steps mentioned in the&nbsp;<a href=\"https://omni.helpdocsonline.com/payment-configuration-2$configuring-payment-rule\">configuring-payment-rule</a>&nbsp;section.</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note:</strong>&nbsp;All the payment types configured to be visible on the Refund By Link page will also be visible on the Payment Resolution page and Return and Exchanges Preview page.</div>\r\n\r\n<h3><a name=\"feature-scope-nbsp\" id=\"feature-scope-nbsp\"></a>Feature Scope&nbsp;</h3>\r\n\r\n<p>The following is not supported:</p>\r\n\r\n<ul>\r\n\t<li>Push notifications in the contact center, to let the CSR know that payment has been added. Currently, the customer must notify the CSR verbally over the phone, and the CSR can refresh the page.</li>\r\n\t<li>Adding custom buttons, links, text, etc. to the Refund by Link panel in customer service</li>\r\n\t<li>Adding custom buttons, links, text, panels to&nbsp;the Digital Self-Service Refund by Link UI (only the logo, font, colors, etc. can be customized per the styling guide)</li>\r\n\t<li>Populating the customer's country code phone prefix&nbsp;for customers created in the contact center</li>\r\n</ul>\r\n\r\n<h3><a name=\"services-nbsp\" id=\"services-nbsp\"></a>Services&nbsp;</h3>\r\n\r\n<p>The following APIs are related&nbsp;to Refund by Link.&nbsp;Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service</font></th>\r\n\t\t\t<th scope=\"col\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Component</font></th>\r\n\t\t\t<th scope=\"col\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Group</font></th>\r\n\t\t\t<th scope=\"col\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service Endpoint</font></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Send Pay by Link API</td>\r\n\t\t\t<td><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Order</font></td>\r\n\t\t\t<td><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Order</font></td>\r\n\t\t\t<td>order/api/order/order/payByLink</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Set the additional attribute&nbsp;\"IsRefundLink\" to&nbsp;true to generate a refund by link by using the above API.</div>\r\n\r\n<h3><a name=\"how-to-test\" id=\"how-to-test\"></a>How to Test</h3>\r\n\r\n<p>To test Refund by Link:</p>\r\n\r\n<ol>\r\n\t<li>Enable all the required configurations listed above for the order, payment, contact center, email and/or text, and Digital Self-Service.</li>\r\n\t<li>Have one Payment Type configured in the system for which a settlement transaction will succeed but the Refund Transaction will fail</li>\r\n\t<li>Have another Payment Type configured in the system for which Refund Transaction will succeed</li>\r\n\t<li>Log into the contact center as a CSR (Menu &gt; Customer Service) and create a customer order - pay using the payment type for which&nbsp;a settlement transaction will succeed.</li>\r\n\t<li>Fulfill the customer order and create a Return Order for the same.</li>\r\n\t<li>Process the return order to generate a Return Invoice - the refund transaction should fail; verify the return order is in Awating Refund status.</li>\r\n\t<li>Retry the refund transaction by executing the Payment Request API for the Return Order till all retries are exhausted.</li>\r\n\t<li>Now, as a customer, check your email or text messages (using the email or phone populated in the previous step). You should see a \"Please update refund payment method...\" email or text.</li>\r\n\t<li>In the email or text, click the 'Add Payment Method for Refund Processing' link to launch Digital Self-Service.</li>\r\n\t<li>On the Digital Self-Serivce Refund by Link page, review the items and order total and click Next'.</li>\r\n\t<li>On the payment gateway page (e.g. Cybersource), and enter credit card details - for which refund transaction will succeed.&nbsp;</li>\r\n\t<li>You should see the Digital Self-Service confirmation page, at which point the customer notifies the CSR that a new payment method is added for refund processing.</li>\r\n\t<li>Now back in the contact center, as the CSR, navigate to the Return Order status screen to see the refund transaction executed successfully to the newly-added payment method and payment status is now Refunded.</li>\r\n</ol>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 66412,
  "scraped_at": "2025-08-09T21:55:33.641359",
  "content_clean": "Home ››Manhattan Active® Omni››Order Management››Process & Configuration Guides››Digital Self-Service ››Refund by Link Refund by Link Refund by Link FlowCustomer Service Refund by LinkRefund by Link - Outbound EmailsRefund by Link - Outbound Text Messages Digital Self-Service Refund by LinkDigital Self-Service Integration with Payment ProvidersRefund by Link ExpiryMultiple Payment GatewaysConfigurationsOrder ConfigurationCustomer Service Configuration Digital Self-Service ConfigurationRefund by Link Email Configuration Refund by Link Text Message ConfigurationMultiple Payment Gateways ConfigurationFeature Scope Services How to Test With Refund by Link, customers can provide a new payment method (credit card) to process refund transactions that have failed for a return order on their own mobile device, tablet, or laptop, rather than providing their sensitive credit card information to contact center agents. This reduces the level of risk for customers who want to add new payment methods like new credit card details over the phone, while also providing opportunities to retry the refund transaction when the refund transactions failed with the old payment methods or original payment methods with which the customer paid for the sales. The Refund by Link feature also enables contact center agents who are working from home to capture new payment methods and process failed refunds securely. The Refund by Link flow is as follows: A refund transaction could not be processed due to various reasons for the original payment method used by the customer for making the payment during the sale. The retailer has enabled refund retries and all the configured retries for the refund transaction have failed. The retailer has enabled \"refund retries failed\" mod type in the order configuration and Refund By Link Email or Text is configured. Or the customer calls the contact center (or chat, text, and so on) and inquires about the refund. The Contact Center Representative(CSR) navigates to the Edit Return Order screen and navigates to Return Order Summary ⇾ Add Payment Method ⇾ Refund By Link and clicks on either send Email/Text/both or Copy URL and send the Refund By Link to the customer The customer receives the Refund By Link email or text on their own device, and clicks the Refund By Link URL to launch Digital Self-Service. The customer enters the new payment method details (credit card information) using Digital Self-Service and the third party payment gateway (CyberSource or Adyen) If the customer is on a call with CSR, the customer lets the CSR know that the payment method has been added. Refund by Link is supported out of the box, with CyberSource and Adyen. Other third party payment providers can be used if they provide hosted checkout capabilities. Refund by Link Flow Customer Service Refund by Link In the contact center, the Refund by Link option can be enabled to be displayed as a payment option for capturing a new payment method for refund processing on the edit return order screen, alongside a credit card. Alternatively, Refund by Link can be enabled as the only payment option in scenarios where the contact center agents should not come into contact with sensitive payment data or are not required to collect credit card details from the customer. On the Refund by Link panel, the full refund due is displayed along with the Email Id and the customer phone number. Neither the CSR nor the customer can edit this amount. After a CSR clicks 'Send Email' or 'Send Text', a green icon is displayed if the outbound Email Message or Text Message was published successfully. This green icon does not indicate successful delivery of the email or text, as delivery is not currently tracked. If the Email Message or Text Message was not successfully published, then a red error icon or an error popup appears. The red error icon indicates that the message could not be posted to the queue, but the error popup indicates a data error (missing configuration, phone number, etc.). The customer receives an email or text and adds a new payment method on their own device. When the customer has completed this, they can verbally notify the CSR that the new payment method has been added if the CSR is still on the call. The CSR clicks the 'Refresh' button on the Refund by Link panel or 'Go Back To Return Details' button, and the customer service page refreshes to show the newly-added payment and updated refund transaction. If the refund transaction fails for the new payment method, the entire process will be repeated by the system, if  refund retry is configured for the payment type. Within the Refund by Link panel, different methods of sending the link can be displayed: Send Email Send Text Copy URL The Email Id used to send Email messages and Phone No. used for sending the text message with the refund by link is populated automatically by the system from the return order and cannot be modified by the CSR. Refund by Link is always displayed as the first payment option on the customer service 'Add Payment Method' panel; this is not configurable. If additional payment types are supported, then they are listed below in the Refund by Link panel according to the configured sequence from the payment capture config. For instance, if the payment type, credit card, is configured with sequence '1' for assisted selling, and if Refund by Link is enabled, the 'Add Payment Method' panel lists Refund by Link at the top, followed by credit card. There is currently not any extensibility on the Refund by Link panel. Therefore, adding custom buttons, links, or text is not supported. Refund by Link - Outbound Emails When the CSR clicks 'Send Email', the customer receives an email with the link to add a new payment method for refund processing in Digital Self-Service. To send this email, an outbound Email Message json is published when the CSR clicks 'Send Email'. The Email Message json includes the Digital Self-Service Refund By Link URL and basic order information including customer email, name, items, and so on. Additional order fields can be included by using a template configuration (see here for details). This Email Message json can be consumed in a few ways to generate the email: The Email Message json can be consumed by a third party email provider, who forms an email and delivers it to the customer. The Email Message json can be consumed by the Active® Omni email component, which can form the email body (HTML), and publish the HTML to a third party email provider who delivers the email as-is. See here for more details on the supported email delivery options. Refund by Link - Outbound Text Messages When the CSR clicks 'Send Text', the customer receives a text with the link (using a short URL) to add a payment method for refund processing in Digital Self-Service. To send this text, an outbound Text Message json is published. The Text Message json includes the Digital Self-Service Refund By Link short URL and basic order information. To send text messages, two integrations are required: A text provider, Twilio, is supported out of the box (using a retailer's Twilio account) A URL shortener, to provide a concise URL in the text message; Bitly is supported out of the box (using a retailer's Bitly account) Details on Text Message Configurations can be found here. Refer to Sending Outbound Text Messages with Twilio for U.S. Phone Numbers and Sending Outbound Text Messages with Twilio for Non-U.S. Phone Numbers for more details Digital Self-Service Refund by Link When a return invoice is generated with a refund amount, the system initiates a refund transaction to refund the amount to the customer to the original payment method used to pay the customer order - as configured in the system. If the refund transaction fails, the system can retry the refund transaction for the configured number of times configured for the refund transaction. When all attempts to process the refund transaction are exhausted, the customer is sent a refund by link to input another payment method to receive the refund amount. Currently, only credit card payment method is supported via refund by link. When the customer clicks the \"Add Payment Method for Refund Processing\" button in the email/text, on the Digital Self-Service Refund by Link page, the subtotal, tax, shipping, discount, and refund amount due are displayed along with the items being returned and order totals. When the customer clicks \"Next\" on the Digital Self-Service page, the browser directs them to the third party payment page to add the new credit card details. After the credit card details are added, a confirmation page is displayed that shows \"you're all set and your refund is in progress\". Customers are not allowed to change the refund amount at any step mentioned above. Note : Instructions to enable different payment methods and configuring a payment gateway for the same can be found in the Multiple Payment Gateways Configuration section. Digital Self-Service Integration with Payment Providers Out of the box integration with CyberSource and Adyen is provided. CyberSource provides some UI themeing capabilities, like changing the logo and background color. If the contact center is already using a secure hosted checkout with a different payment provider, then the integration may be similar to the contact center, but separate effort is required to integrate the Digital Self-Service Refund by Link page with the third party payment service provider's hosted checkout. The contact center integration cannot be reused as-is. There are a few key differences between the Digital Self-Service Refund by Link hosted checkout and the contact center hosted checkout: In Digital Self-Service, the customer needs to add their new credit card details in the third party payment page. In the contact center, this is done on the contact center page before launching the third party page, so only the credit card details are captured in the third party page. Digital Self-Service redirects to the hosted checkout page, and then back to Digital Self-Service in the same browser window, so there is no popup window. In the contact center, there is a popup window. Refund by Link Expiry The Digital Self-Service Refund by Link page expires after a period of time to remain secure. Upon loading the Refund by Link page, Digital Self-Service checks a field in the order entity (SelfServiceAttribute.RefundByLinkExpiryDate), and if this date is in the past, the customer is not able to add a payment method. A 'page expired' message is displayed, and the customer is not able to add payment method or view order details. If the expiry date is null on the order, then the Digital Self-Service page displays the expired state. The expiry date is populated when the 'Send Email' or 'Send Text' buttons are clicked in the contact center. If sending the customer links to launch the Digital Self-Service Refund by Link page from channels other than contact center, then call this API to ensure the expiry date is populated: /order/api/order/order/refundByLink The expiry date is saved in the database in UTC. When the UI loads, the expiry date is converted to the user's local time zone and compared with the current date/time. Currently, the expiry date is calculated and populated only if Refund By Link Send Email' or 'Send Text' buttons are clicked in the contact center and cannot be calculated or populated either manually or by any other third party service provider. Note: Different link expiry time can be configured for Pay By Link and Refund By Link Multiple Payment Gateways The Digital Self-Service Refund by Link page allows users to select from different payment methods (currently only credit card is supported), if configured. For each of the payment methods, retailers can configure a different payment gateway, if needed. Note : Instructions to enable different payment methods and configuring a payment gateway for the same can be found in the Multiple Payment Gateways Configuration section. Configurations Order Configuration To configure the valid time duration for the Digital Self-Service Refund by Link page, work with services to specify the expiry hours in the order.refundByLink.validity in the consul server (order component). For example, if you want the refund by link to be valid for 2 hours from the time it is generated, enter 2 hours in the configuration. Regardless of what is entered in the configuration, the application will consider a hard minimum of 1 hour and maximum of 24 hours (1 days). Any value less than 1 hour will be considered 1 hour, and any value more than 24 hours will be considered 24 hours. Note that the application will not throw any errors if values less or greater than these are entered, but internally these limits will be enforced. Customer Service Configuration To enable the Refund by Link panel in customer service, the below-mentioned grants have to be provided for the CSR to access the Refund By Link panel: UI Button/Section Grant Edit Return Order ⇾ Return Summary Add Payment Method Button customerservice::order::payment::addpaymentmethod Edit Return Order ⇾ Return Summary ⇾ Add Payment Method Refund By Link Panel (drop-down) customerservice::order::payment::addpaymentmethod::refundbylink If either of these grants are not provided to the CSR, the CSR cannot access the Refund By link panel. The Refund by Link panel is supported on the Edit Return Order screen and edit Exchange Order screen. This single set of configurations controls whether Refund By Link is accessible by the CSR for both return orders and exchange orders. Note: Refund By Link is not supported for any refund processing on customer orders resulting due to appeasements etc. Digital Self-Service Configuration The following configuration is required to enable Refund by Link in Digital Self-Service: Add a payment rule with Payment Type = 'Credit Card' and Card Type = null. Because Digital Self-Service launches the third party payment gateway before the card type is selected, this rule must have null card type. The card type selection is completed on the third party payment page. For this payment rule, configure the third party gateway being used for Refund by Link (for example, CyberSource). Digital Self-Service uses this configuration to redirect to the third party gateway when the customer presses 'Next'. Update the UI styling to reflect your brand's logo, colors, and font (details here). Note that this is only required once per deployment, so if this has been completed for other Digital Self-Service features, then it does not need to be done again. Review the UI labels and error messages for each supported locale/language, and work with services to update these as required. Refer here for Payment Gateway Configuration. Note: The configurations mentioned here are common to Pay By Link as well as Refund By Link Refund by Link Email Configuration To enable the Refund by Link emails to be delivered via the Active® Omni email component for testing purposes, ask services to set the consul server property config/com-manh-cp-email,om-side/email.publishEmailPayload = false. If this is set to true, then the email body payload is published to a queue (to be delivered by a third party email provider). If it's set to false, then the email should be delivered by Active® Omni. With the help of services, populate the consul server property order.selfServiceHostName with the host information for Digital-Self Service in Order Component (path: CONFIG/COM-MANH-CP-ORDER,OM-SIDE/). This ensures that the Digital Self-Service URL is ready to be included in emails or text messages. In the order component consul server config, add a value such as \"https://abc.manh.com\" for the selfServiceHostName property. Be sure to configure this with \"https:\" not \"http:\". If this is already completed for other Digital Self-Service flows, it does not need to be done again. Note: Order Configuration changes are required to generate the Refund by Link emails or texts automatically when refund retry is unsuccessful. The event is fired when the contact center user clicks 'Send Email' or 'Send Text', which triggers the outbound Email Message or Text Message. If using the Refund by Link email template in Active® Omni, then modify the HTML as needed to suit the retailer's brand. See below for a sample Refund by Link email template and Outbound Refund by Link email template from order to the Email component. Refund by Link Email Template { \"TemplateId\": \"RefundByLinkForRefundProcessing\", \"GroupName\": \"EmailMessageService\", \"LogFailure\": true, \"Description\": \"Sample email generated to request the customer adds payment via Digital Self-Service. This template can be used for reference purposes only\", \"ReplyToName\": null, \"Name\": \"Sample refund by link template\", \"ReplyTo\": \"cpadmin@manh.com\", \"FromName\": \"Sophia's\", \"ConditionExpression\": \"EmailMessageType contains \\\"RefundByLinkForRefundProcessing\\\"\", \"ReferenceField1\": \"${OrderId}\", \"ReferenceField2\": null, \"ReferenceField3\": \"${OrderTypeId}\", \"ReferenceField4\": null, \"ReferenceField5\": null, \"Subject\": \"Update the payment method for refund processing for your Sophia's order ${OrderId}...\", \"FromEmail\": \"cpadmin@manh.com\", \"ToAddress\": [ { \"ToAddressType\": { \"TypeId\": \"TO\" }, \"ToEmail\": \"${CustomerEmail}\", \"ToName\": \"${CustomerFirstName} ${CustomerLastName}\" } ], \"LogSuccess\": true, \"Body\": \"<!DOCTYPE html PUBLIC \\\"-\\/\\/W3C\\/\\/DTD XHTML 1.0 Strict\\/\\/EN\\\" \\\"http:\\/\\/www.w3.org\\/TR\\/xhtml1\\/DTD\\/xhtml1-strict.dtd\\\">\\r\\n<html xmlns=\\\"http:\\/\\/www.w3.org\\/1999\\/xhtml\\\">\\r\\n\\r\\n<head>\\r\\n <meta http-equiv=\\\"Content-Type\\\" content=\\\"text\\/html; charset=utf-8\\\" \\/>\\r\\n <meta name=\\\"viewport\\\" content=\\\"width=device-width, initial-scale=1.0\\\" \\/>\\r\\n <meta http-equiv=\\\"X-UA-Compatible\\\" content=\\\"IE=edge\\\">\\r\\n <title>Order Confirmed Template<\\/title>\\r\\n <style type=\\\"text\\/css\\\">\\r\\n\\r\\n \\/*Override Gmail link styling, which turns all link text blue *\\/\\r\\n u + #body a {\\r\\n color: inherit;\\r\\n text-decoration: none;\\r\\n font-size: inherit;\\r\\n font-family: inherit;\\r\\n font-weight: inherit;\\r\\n line-height: inherit;\\r\\n }\\r\\n \\r\\n #outlook a {\\r\\n padding: 0;\\r\\n }\\r\\n\\r\\n \\/* Force Outlook to provide a \\\"view in browser\\\" menu link. *\\/\\r\\n body {\\r\\n font-family: \\\"Helvetica\\\";\\r\\n width: 100% !important;\\r\\n -webkit-text-size-adjust: 100%;\\r\\n -ms-text-size-adjust: 100%;\\r\\n margin: 0;\\r\\n padding: 0;\\r\\n }\\r\\n\\r\\n.header {\\r\\n padding: 1px;\\r\\n text-align: center;\\r\\n background: #982741;\\r\\n color: white;\\r\\n font-size: 14px;\\r\\n}\\r\\n\\r\\n \\/* Prevent Webkit and Windows Mobile platforms from changing default font sizes, while not breaking desktop design. *\\/\\r\\n .ExternalClass {\\r\\n width: 100%;\\r\\n }\\r\\n\\r\\n \\/* Force Hotmail to display emails at full width *\\/\\r\\n .ExternalClass,\\r\\n .ExternalClass p,\\r\\n .ExternalClass span,\\r\\n .ExternalClass font,\\r\\n .ExternalClass td,\\r\\n .ExternalClass div {\\r\\n line-height: 100%;\\r\\n color: #000000;\\r\\n font-family: \\\"Helvetica\\\";\\r\\n }\\r\\n\\r\\n \\/* Force Hotmail to display normal line spacing.*\\/\\r\\n #backgroundTable {\\r\\n margin: 0;\\r\\n padding: 0;\\r\\n width: 100% !important;\\r\\n line-height: 100% !important;\\r\\n }\\r\\n\\r\\n img {\\r\\n outline: none;\\r\\n text-decoration: none;\\r\\n border: none;\\r\\n -ms-interpolation-mode: bicubic;\\r\\n }\\r\\n\\r\\n a img {\\r\\n border: none;\\r\\n }\\r\\n\\r\\n .image_fix {\\r\\n display: block;\\r\\n }\\r\\n\\r\\n p {\\r\\n color: #000000;\\r\\n font-family: \\\"Helvetica\\\";\\r\\n margin: 0px 0px !important;\\r\\n }\\r\\n\\r\\n table td {\\r\\n border-collapse: collapse;\\r\\n }\\r\\n\\r\\n table {\\r\\n border-collapse: collapse;\\r\\n mso-table-lspace: 0pt;\\r\\n mso-table-rspace: 0pt;\\r\\n }\\r\\n\\r\\n a {\\r\\n font-family: \\\"Helvetica\\\";\\r\\n color: #000000;\\r\\n text-decoration: none;\\r\\n text-decoration: none !important;\\r\\n }\\r\\n\\r\\n .PrimaryBgColor {\\r\\n background-color: #982741;\\r\\n }\\r\\n\\r\\n .orderNumber {\\r\\n font-size: 12px;\\r\\n color: #000000;\\r\\n }\\r\\n\\r\\n .span {\\r\\n color: #000000;\\r\\n }\\r\\n\\r\\n .h3 {\\r\\n color: #000000;\\r\\n }\\r\\n\\r\\n .emailActionBttn,\\r\\n .emailActionBttn:link,\\r\\n .emailActionBttn:visited,\\r\\n .emailActionBttn:active {\\r\\n text-decoration: none;\\r\\n text-align: center;\\r\\n padding: 0.5em 1em;\\r\\n font-size: 18px;\\r\\n color: #FFFFFF;\\r\\n background-color: #982741;\\r\\n border-color: #982741;\\r\\n border: 2px solid;\\r\\n border-radius: 4px;\\r\\n }\\r\\n\\r\\n .emailActionBttn:hover {\\r\\n background-color: #FFFFFF;\\r\\n border-color: #982741;\\r\\n color: #982741;\\r\\n }\\r\\n\\r\\n .productImg {\\r\\n margin-right: 2rem;\\r\\n width: 125px;\\r\\n height: auto;\\r\\n object-fit: cover;\\r\\n }\\r\\n\\r\\n .flexContainer {\\r\\n display: flex;\\r\\n align-items: center;\\r\\n width: 400px;\\r\\n }\\r\\n\\r\\n .flexContainer2 {\\r\\n display: flex;\\r\\n align-items: center;\\r\\n vertical-align: middle;\\r\\n width: 400px;\\r\\n }\\r\\n\\r\\n .price {\\r\\n margin-left: 6rem;\\r\\n }\\r\\n\\r\\n .sectionHeader {\\r\\n line-height: 2;\\r\\n font-family: Helvetica;\\r\\n color: #ffffff;\\r\\n font-size: 16px;\\r\\n }\\r\\n\\r\\n \\/*STYLES*\\/\\r\\n table[class=full] {\\r\\n width: 100%;\\r\\n clear: both;\\r\\n }\\r\\n\\r\\n .header {\\r\\n margin-top: 5%;\\r\\n margin-bottom: 5%;\\r\\n font-family: \\\"Helvetica\\\";\\r\\n }\\r\\n\\r\\n .displayValue {\\r\\n white-space: nowrap;\\r\\n text-overflow: ellipsis;\\r\\n overflow: hidden;\\r\\n width: 123px;\\r\\n display: inline-block;\\r\\n vertical-align: bottom;\\r\\n line-height: 37px;\\r\\n font-family: Helvetica;\\r\\n font-size: 14px;\\r\\n }\\r\\n\\r\\n .displayValue2 {\\r\\n white-space: nowrap;\\r\\n text-overflow: ellipsis;\\r\\n overflow: hidden;\\r\\n width: 300px;\\r\\n display: inline-block;\\r\\n vertical-align: bottom;\\r\\n line-height: 37px;\\r\\n font-family: Helvetica;\\r\\n font-size: 14px;\\r\\n }\\r\\n\\r\\n \\/*IPAD STYLES*\\/\\r\\n @media only screen and (max-width: 640px) {\\r\\n\\r\\n a[href^=\\\"tel\\\"],\\r\\n a[href^=\\\"sms\\\"] {\\r\\n text-decoration: none;\\r\\n color: #000000;\\r\\n \\/* or whatever your want *\\/\\r\\n pointer-events: none;\\r\\n cursor: default;\\r\\n }\\r\\n\\r\\n .itemName {\\r\\n font-size: 18px !important;\\r\\n font-weight: 500 !important;\\r\\n }\\r\\n\\r\\n .sectionHeader {\\r\\n align: left;\\r\\n font-size: 18px !important;\\r\\n }\\r\\n\\r\\n .displayValue,\\r\\n .displayValue2 {\\r\\n font-size: 16px !important;\\r\\n }\\r\\n\\r\\n .mobile_link a[href^=\\\"tel\\\"],\\r\\n .mobile_link a[href^=\\\"sms\\\"] {\\r\\n text-decoration: default;\\r\\n color: #000000 !important;\\r\\n pointer-events: auto;\\r\\n cursor: default;\\r\\n }\\r\\n\\r\\n table[class=devicewidth] {\\r\\n width: 440px !important;\\r\\n text-align: left !important;\\r\\n }\\r\\n\\r\\n table[class=devicewidthinner] {\\r\\n width: 420px !important;\\r\\n text-align: left !important;\\r\\n }\\r\\n\\r\\n img[class=banner] {\\r\\n width: 225px !important;\\r\\n height: 375px !important;\\r\\n }\\r\\n\\r\\n img[class=colimg2] {\\r\\n width: 225px !important;\\r\\n height: 375px !important;\\r\\n }\\r\\n\\r\\n .emailActionBttn,\\r\\n .emailActionBttn:link,\\r\\n .emailActionBttn:visited,\\r\\n .emailActionBttn:active {\\r\\n text-decoration: none;\\r\\n text-align: center;\\r\\n padding: 0.5em 1em;\\r\\n font-size: 18px;\\r\\n color: #FFFFFF;\\r\\n background-color: #982741;\\r\\n border-color: #982741;\\r\\n border: 2px solid;\\r\\n border-radius: 4px;\\r\\n }\\r\\n\\r\\n .emailActionBttn:hover {\\r\\n background-color: #FFFFFF;\\r\\n border-color: #982741;\\r\\n color: #982741;\\r\\n }\\r\\n }\\r\\n\\r\\n \\/*IPHONE STYLES*\\/\\r\\n @media only screen and (max-width: 480px) {\\r\\n\\r\\n a[href^=\\\"tel\\\"],\\r\\n a[href^=\\\"sms\\\"] {\\r\\n text-decoration: none;\\r\\n color: #000000;\\r\\n \\/* or whatever your want *\\/\\r\\n pointer-events: none;\\r\\n cursor: default;\\r\\n }\\r\\n\\r\\n .itemName {\\r\\n font-size: 18px !important;\\r\\n font-weight: 500 !important;\\r\\n }\\r\\n\\r\\n .sectionHeader {\\r\\n align: left;\\r\\n font-size: 18px !important;\\r\\n }\\r\\n\\r\\n .displayValue,\\r\\n .displayValue2 {\\r\\n font-size: 16px !important;\\r\\n }\\r\\n\\r\\n .mobile_link a[href^=\\\"tel\\\"],\\r\\n .mobile_link a[href^=\\\"sms\\\"] {\\r\\n text-decoration: default;\\r\\n color: #000000 !important;\\r\\n pointer-events: auto;\\r\\n cursor: default;\\r\\n }\\r\\n\\r\\n table[class=devicewidth] {\\r\\n width: 280px !important;\\r\\n text-align: left !important;\\r\\n }\\r\\n\\r\\n table[class=devicewidthinner] {\\r\\n width: 260px !important;\\r\\n text-align: left !important;\\r\\n }\\r\\n\\r\\n img[class=banner] {\\r\\n width: 225px !important;\\r\\n height: 375px !important;\\r\\n }\\r\\n\\r\\n img[class=colimg2] {\\r\\n width: 225px !important;\\r\\n height: 375px !important;\\r\\n }\\r\\n\\r\\n td[class=mobile-hide] {\\r\\n display: none !important;\\r\\n }\\r\\n\\r\\n td[class=\\\"padding-bottom25\\\"] {\\r\\n padding-bottom: 25px !important;\\r\\n }\\r\\n\\r\\n .emailActionBttn,\\r\\n .emailActionBttn:link,\\r\\n .emailActionBttn:visited,\\r\\n .emailActionBttn:active {\\r\\n text-decoration: none;\\r\\n text-align: center;\\r\\n padding: 0.5em 1em;\\r\\n font-size: 18px;\\r\\n color: #FFFFFF;\\r\\n background-color: #982741;\\r\\n border-color: #982741;\\r\\n border: 2px solid;\\r\\n border-radius: 4px;\\r\\n }\\r\\n\\r\\n .emailActionBttn:hover {\\r\\n background-color: #FFFFFF;\\r\\n border-color: #982741;\\r\\n color: #982741;\\r\\n }\\r\\n }\\r\\n <\\/style>\\r\\n<\\/head>\\r\\n\\r\\n<body id=\\\"body\\\">\\r\\n <#setting number_format=\\\"$#,##0.00; $#,##0.00\\\">\\r\\n <!-- Start of preheader -->\\r\\n <table class=\\\"flexcontainer\\\" width=\\\"100%\\\" bgcolor=\\\"#ffffff\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" id=\\\"backgroundTable\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td>\\r\\n <table width=\\\"600\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" align=\\\"center\\\" class=\\\"flexcontainer\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td width=\\\"100%\\\">\\r\\n <table width=\\\"600\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" align=\\\"center\\\" class=\\\"flexcontainer\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td>\\r\\n <table width=\\\"300\\\" align=\\\"center\\\" border=\\\"0\\\" cellpadding=\\\"0px\\\" cellspacing=\\\"0\\\" class=\\\"flexcontainer\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td padding-bottom=\\\"0\\\" align=\\\"center\\\">\\r\\n <img width=\\\"300\\\" src=\\\"https:\\/\\/res.cloudinary.com\\/com-manh-cp\\/image\\/upload\\/v1585061036\\/digitalSelfService\\/Sophia_s-logo-centered.png\\\">\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <!-- End of preheader -->\\r\\n <!-- Start Full Text -->\\r\\n <table width=\\\"100%\\\" bgcolor=\\\"#ffffff\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" id=\\\"backgroundTable\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td>\\r\\n <table width=\\\"500\\\" align=\\\"center\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" class=\\\"devicewidthinner\\\">\\r\\n <tbody>\\r\\n <!-- Title -->\\r\\n <tr>\\r\\n <td align=\\\"center\\\" height=\\\"20\\\" style=\\\"font-size:1px; line-height:1px;\\\"> <\\/td>\\r\\n <\\/tr>\\r\\n <!-- End of Title -->\\r\\n <!-- Title -->\\r\\n <tr>\\r\\n <div style=\\\"font-size: 18px; color: #000000; line-height: 30px; font-family: Helvetica\\\" align=\\\"center\\\">Hi<#if CustomerFirstName??> ${CustomerFirstName}<\\/#if>!<\\/div>\\r\\n <div style=\\\"font-size: 18px; color: #000000; line-height: 30px; font-family: Helvetica\\\" align=\\\"center\\\">Please update your refund payment method details<\\/div>\\r\\n <\\/tr>\\r\\n <!-- End of Title -->\\r\\n <tr>\\r\\n <div style=\\\"font-size: 15px; line-height: 30px; \\\" align=\\\"center\\\">\\r\\n <p style=\\\"color:#000000;font-family: Helvetica\\\"> Order: ${OrderId}<\\/p>\\r\\n <\\/div>\\r\\n <\\/tr>\\r\\n <!-- Spacing -->\\r\\n <tr>\\r\\n <td width=\\\"100%\\\" height=\\\"20\\\"><\\/td>\\r\\n <\\/tr>\\r\\n <!-- Spacing -->\\r\\n <tr>\\r\\n <div style=\\\"font-size: 15px;\\\" align=\\\"center\\\">\\r\\n\\r\\n <p style=\\\"font-family:Helvetica; line-height: 25px; color:#000000;\\\">Click Below to Add or Update Your Payment Method for Refund Processing.<\\/p>\\r\\n\\r\\n <\\/div>\\r\\n <\\/tr>\\r\\n <!-- Add Payment button -->\\r\\n <tr>\\r\\n <td align=\\\"center\\\" height=\\\"20\\\" style=\\\"font-size:1px; line-height:1px;\\\"> <\\/td>\\r\\n <\\/tr>\\r\\n <tr>\\r\\n <td width=\\\"600\\\" style=\\\"font-size: 16px; color: #fff; line-height: 30px;\\\" align=\\\"center\\\">\\r\\n <a class=\\\"emailActionBttn\\\" \\r\\n href=\\\"${SelfServiceUrl}\\\">Add Payment Method for Refund Processing<\\/a>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <!-- End of content -->\\r\\n <!-- End of content -->\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <br>\\r\\n <!-- Items -->\\r\\n\\r\\n <table width=\\\"100%\\\" style=\\\"background-color: #982741\\\"; cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" id=\\\"backgroundTable\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td>\\r\\n <table width=\\\"600\\\" style=\\\"background-color: #982741; text-align: center\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" align=\\\"center\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td width=\\\"100%\\\">\\r\\n <p> <span class=\\\"sectionHeader\\\">Returned Items<\\/span> <\\/p>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n\\r\\n\\r\\n <table width=\\\"100%\\\" bgcolor=\\\"#ffffff\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" id=\\\"backgroundTable\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td>\\r\\n <table width=\\\"600\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" align=\\\"center\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td width=\\\"100%\\\">\\r\\n <table bgcolor=\\\"#ffffff\\\" width=\\\"600\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" align=\\\"center\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td>\\r\\n <!-- start of column -->\\r\\n <table width=\\\"600\\\" align=\\\"center\\\" border=\\\"0\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <!-- Spacing -->\\r\\n <tr>\\r\\n <td style=\\\"font-family: Helvetica, arial, sans-serif\\\">\\r\\n <!-- start of text content table -->\\r\\n <table class=\\\"flexContainer\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" style=\\\"margin-top: 2%\\\" align=\\\"left\\\">\\r\\n <tbody>\\r\\n <#list OrderedItems as Details>\\r\\n <tr>\\r\\n <td>\\r\\n <table class=\\\"flexContainer\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" style=\\\"margin-top: 5%;\\\" align=\\\"left\\\">\\r\\n <tbody>\\r\\n\\r\\n <tr>\\r\\n <td>\\r\\n <#if Details.ItemSmallImageURI??><img src=\\\"${Details.ItemSmallImageURI}\\\" width=\\\"125\\\" align=\\\"left\\\"><\\/#if>\\r\\n <\\/td>\\r\\n <td>\\r\\n <table width=\\\"300\\\" align=\\\"right\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\">\\r\\n <br><br>\\r\\n <tr>\\r\\n\\r\\n <td style=\\\"font-size:16px; line-height:30px; font-family:Helvetica; font-weight:bold\\\">\\r\\n <#if Details.ItemShortDescription??> ${Details.ItemShortDescription}<\\/#if>\\r\\n <\\/td>\\r\\n\\r\\n <\\/tr>\\r\\n <tr>\\r\\n\\r\\n <td style=\\\"font-size:14px; line-height:20px; font-family:Helvetica\\\">Size: <#if Details.ItemSize??>${Details.ItemSize}<\\/#if>\\r\\n <\\/td>\\r\\n\\r\\n <\\/tr>\\r\\n <tr>\\r\\n <td style=\\\"font-size:14px; line-height:20px; font-family:Helvetica\\\">Qty: ${Details.Quantity?string(\\\",##0\\\")}<\\/td>\\r\\n <\\/tr>\\r\\n <tr>\\r\\n\\r\\n <td style=\\\"font-size:14px; line-height:20px; font-family:Helvetica\\\">Color: <#if Details.ItemColorDescription??>${Details.ItemColorDescription}<\\/#if>\\r\\n <\\/td>\\r\\n\\r\\n <\\/tr>\\r\\n <tr>\\r\\n\\r\\n <td style=\\\"font-size:14px; line-height:20px; font-family:Helvetica\\\">Price: <#if !Details.UnitPrice??>$0.00 <#else>${Details.UnitPrice}<\\/#if>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <tr>\\r\\n <td style=\\\"font-size:14px; line-height:20px; font-family:Helvetica\\\">Item: ${Details.ItemId}<\\/td>\\r\\n <\\/tr>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <tr style=\\\"clear:both;height:60px\\\"> <\\/tr>\\r\\n <\\/#list>\\r\\n <\\/tbody>\\r\\n <tr style=\\\"clear:both;margin-top: 4%\\\"><\\/tr>\\r\\n <\\/table>\\r\\n <!-- end of text content table -->\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <br>\\r\\n <!-- end of items -->\\r\\n <!-- Start Full Text -->\\r\\n <table width=\\\"100%\\\" style=\\\"background-color: #982741\\\"; cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" id=\\\"backgroundTable\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td>\\r\\n <table width=\\\"600\\\" style=\\\"background-color: #982741; text-align: center\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" align=\\\"center\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td width=\\\"100%\\\">\\r\\n <p> <span class=\\\"sectionHeader\\\">Order Summary<\\/span> <\\/p>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n\\r\\n <table width=\\\"100%\\\" bgcolor=\\\"#ffffff\\\" cellpadding=\\\"10\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" id=\\\"backgroundTable\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td>\\r\\n <table width=\\\"600\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" align=\\\"center\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td width=\\\"100%\\\">\\r\\n <table width=\\\"600\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" align=\\\"center\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td>\\r\\n <table width=\\\"600\\\" align=\\\"center\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <!-- content -->\\r\\n <tr>\\r\\n <td style=\\\"font-size: 13px; line-height: 20px; width: 100%\\\" align=\\\"left\\\">\\r\\n <p style=\\\"font-family: Helvetica; text-align: left\\\">Subtotal:<\\/p>\\r\\n <p style=\\\"font-family: Helvetica; text-align: left\\\">Shipping:<\\/p>\\r\\n <p style=\\\"font-family: Helvetica; text-align: left\\\">Discounts:<\\/p>\\r\\n <p style=\\\"font-family: Helvetica; text-align: left\\\">Taxes:<\\/p>\\r\\n <p style=\\\"font-family: Helvetica; text-align: left; font-weight:bold\\\">Total:<\\/p>\\r\\n <\\/td>\\r\\n <td style=\\\"font-size: 13px; line-height: 20px; width: 100%\\\" align=\\\"right\\\">\\r\\n <p style=\\\"font-family: Helvetica;\\\"><#if !OrderSubTotal??>$0.00 <#else>${OrderSubTotal}<\\/#if><\\/p>\\r\\n <p style=\\\"font-family: Helvetica;\\\"><#if !TotalCharges??>$0.00 <#else>${TotalCharges}<\\/#if><\\/p>\\r\\n <p style=\\\"color: #000000;font-family: Helvetica\\\"><#if !TotalDiscounts??>$0.00 <#else>${TotalDiscounts}<\\/#if><\\/p>\\r\\n <p style=\\\"color: #000000;font-family: Helvetica\\\"><#if !TotalTaxes??>$0.00 <#else>${TotalTaxes}<\\/#if><\\/p>\\r\\n <p style=\\\"color: #000000;font-family: Helvetica; font-weight:bold\\\"><#if !OrderTotal??>$0.00 <#else>${OrderTotal}<\\/#if><\\/p>\\r\\n <\\/td\\r\\n <\\/tr>\\r\\n <!-- End of content -->\\r\\n <!-- Title -->\\r\\n <br>\\r\\n <!-- End of Title -->\\r\\n <!-- beginning of seperator -->\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <table width=\\\"100%\\\" bgcolor=\\\"#ffffff\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" id=\\\"backgroundTable\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td>\\r\\n <table width=\\\"600\\\" align=\\\"center\\\" cellspacing=\\\"0\\\" cellpadding=\\\"0\\\" border=\\\"0\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td align=\\\"center\\\" height=\\\"6\\\" style=\\\"font-size:1px; line-height:1px;\\\">  <\\/td>\\r\\n <\\/tr>\\r\\n <tr>\\r\\n <td width=\\\"600\\\" align=\\\"center\\\" height=\\\"1\\\" bgcolor=\\\"#d1d1d1\\\" style=\\\"font-size:1px; line-height:1px;\\\">  <\\/td>\\r\\n <\\/tr>\\r\\n <tr>\\r\\n <td align=\\\"center\\\" height=\\\"20\\\" style=\\\"font-size:1px; line-height:1px;\\\">  <\\/td>\\r\\n <\\/tr>\\r\\n\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <!-- end of full text -->\\r\\n <table width=\\\"100%\\\" bgcolor=\\\"#ffffff\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" id=\\\"backgroundTable\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td>\\r\\n <table width=\\\"600\\\" cellpadding=\\\"0\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" align=\\\"center\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td width=\\\"100%\\\">\\r\\n <table width=\\\"100%\\\" cellpadding=\\\"10px\\\" cellspacing=\\\"0\\\" border=\\\"0\\\" align=\\\"center\\\" class=\\\"devicewidth\\\">\\r\\n <tbody>\\r\\n <tr>\\r\\n <td align=\\\"center\\\" valign=\\\"middle\\\">\\r\\n <p style=\\\"font-size:15px;font-family: Helvetica;font-weight:bold;color : #000000\\\">My Account | Support | Privacy Policy<\\/p>\\r\\n <hr class=\\\"seperator\\\">\\r\\n <p style=\\\"color: #000000;font-size:10px;font-family: Helvetica\\\">This message was sent to ${CustomerEmail}<\\/p>\\r\\n <p style=\\\"color: #000000;font-size:10px\\\">2019 Sophia's Inc. Sophia's and the Sophia's Outlet logo are registered trademarks<\\/p>\\r\\n <p style=\\\"color: #000000;font-size:10px;font-family: Helvetica\\\">of Sophia's Inc 2300 Windy Ridge Parkway, Atlanta GA 30339.<\\/p>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <tr>\\r\\n <td align=\\\"center\\\" valign=\\\"middle\\\">\\r\\n <p style=\\\"font-size:10px;font-family: Helvetica\\\"><\\/p>\\r\\n <hr class=\\\"seperator\\\">\\r\\n <p style=\\\"color: #bfbfbf;font-size:10px\\\">*This email was sent from a notification-only address that cannot accept incoming email. Please do not reply to this message.<\\/p>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <!-- Spacing -->\\r\\n <tr>\\r\\n <td width=\\\"100%\\\" height=\\\"20\\\"><\\/td>\\r\\n <\\/tr>\\r\\n <!-- Spacing -->\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <\\/td>\\r\\n <\\/tr>\\r\\n <\\/tbody>\\r\\n <\\/table>\\r\\n <!-- End of postfooter -->\\r\\n<\\/body>\\r\\n\\r\\n<\\/html>\\r\\n\" } Refund by Link Text Message Configuration See the Transactional Text Guide for the required configuration for generating Refund by Link text messages. Here is a sample Refund by Link text template: Refund by Link Text Template { \"Description\": \"Text message to send the Refund By Link to the customer.\", \"TemplateMsgId\": \"RefundByLinkForRefundProcessing\", \"ConditionalExpression\": \"Order.TextMessageType contains \\\"RefundByLinkForRefundProcessing\\\"\", \"MessagePrefixInterval\": 0, \"Name\": \"RefundByLink\", \"MessagePrefix\": null, \"MessageSuffixInterval\": 0, \"SequenceNumber\": null, \"TextMessageType\": { \"TextMessageTypeId\": \"Transactional\" }, \"MessageBody\": \"Hi ${Order.CustomerFirstName}! Please input a new payment method to receive your refund for Order No.: ${Order.OrderId} by clicking on the link: ${Order.DSSUrl}\" } Multiple Payment Gateways Configuration In the application's 'Payment Capture Config', the retailer can select a payment type ( / method) which needs to be displayed on the Refund by Link page. In order for this payment type to be visible on the Refund By Link page, the checkbox 'Permit SelfService Sales' in the 'Detail' tab should be checked. For each of the payment types configured in the 'Payment Capture Config', a different payment gateway can be assigned by following the steps mentioned in the configuring-payment-rule section. Note: All the payment types configured to be visible on the Refund By Link page will also be visible on the Payment Resolution page and Return and Exchanges Preview page. Feature Scope The following is not supported: Push notifications in the contact center, to let the CSR know that payment has been added. Currently, the customer must notify the CSR verbally over the phone, and the CSR can refresh the page. Adding custom buttons, links, text, etc. to the Refund by Link panel in customer service Adding custom buttons, links, text, panels to the Digital Self-Service Refund by Link UI (only the logo, font, colors, etc. can be customized per the styling guide) Populating the customer's country code phone prefix for customers created in the contact center Services The following APIs are related to Refund by Link. Refer to the API documentation for additional details on each service. Service Component Group Service Endpoint Send Pay by Link API Order Order order/api/order/order/payByLink Note: Set the additional attribute \"IsRefundLink\" to true to generate a refund by link by using the above API. How to Test To test Refund by Link: Enable all the required configurations listed above for the order, payment, contact center, email and/or text, and Digital Self-Service. Have one Payment Type configured in the system for which a settlement transaction will succeed but the Refund Transaction will fail Have another Payment Type configured in the system for which Refund Transaction will succeed Log into the contact center as a CSR (Menu > Customer Service) and create a customer order - pay using the payment type for which a settlement transaction will succeed. Fulfill the customer order and create a Return Order for the same. Process the return order to generate a Return Invoice - the refund transaction should fail; verify the return order is in Awating Refund status. Retry the refund transaction by executing the Payment Request API for the Return Order till all retries are exhausted. Now, as a customer, check your email or text messages (using the email or phone populated in the previous step). You should see a \"Please update refund payment method...\" email or text. In the email or text, click the 'Add Payment Method for Refund Processing' link to launch Digital Self-Service. On the Digital Self-Serivce Refund by Link page, review the items and order total and click Next'. On the payment gateway page (e.g. Cybersource), and enter credit card details - for which refund transaction will succeed. You should see the Digital Self-Service confirmation page, at which point the customer notifies the CSR that a new payment method is added for refund processing. Now back in the contact center, as the CSR, navigate to the Return Order status screen to see the refund transaction executed successfully to the newly-added payment method and payment status is now Refunded."
}