{
  "success": true,
  "permalink": "release-21.1",
  "title": "Release 21.1",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a hqid=\"1788908\" href=\"/home\" class=\"breadcrumb-links\">Home</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158392\" href=\"/release-notes-2\" class=\"breadcrumb-links\">Release Notes</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3501117\" href=\"/release-notes-3\" class=\"breadcrumb-links\">Manhattan Active® Supply Chain Planning</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3501140\" href=\"/2021-2\" class=\"breadcrumb-links\">2021</a></li><li> <span>››</span>Release 21.1</li></ul>  \t\r\n\t\t<h1>Manhattan Active&reg; Allocation Release Notes 21.1</h1>\n\n<p>&nbsp;</p>\n\n<p>Release Date: 12. 31. 2020</p>\n\n<p>&nbsp;</p>\n\n<p>The 21.1 release of Manhattan Active Allocation delivers solution enhancements across our Omni-centric allocation capabilities including integration between our Order Management and Allocation solutions, product access filters and DC holdback inventory management.<br />\n&nbsp;</p>\n\n<p><b>Freeze Allocation</b></p>\n\n<p>Free and release actions have been added to the allocation maintenance screen. On freeze , frozen lines/destinations&#39; allocated quantity will not change either on recalculate or/and modify method.</p>\n\n<p>&nbsp;</p>\n\n<p><b>Product Access Filters and User Product Access</b></p>\n\n<p>Allocations and supplies that are visible to the user can now be limited with product access filters and user product access.&nbsp;Product access filters can be defined by department, class and subclass attributes. Users are added to product access filters via user product access. User visibility of allocations and supplies is limited to products meeting the product access filter criteria.</p>\n\n<p>&nbsp;</p>\n\n<p><b>Integration with Manhattan Active&reg; Omni</b></p>\n\n<p>Allocators will be able to automatically increase need computed by a specified percentage based on fulfillment options available for the product at the destination. This effective need will be used for allocating inventory.</p>\n\n<p>&nbsp;</p>\n\n<p><b>Hold Out by eCommerce Channel</b></p>\n\n<p>Users can specify hold out quantities for ecommerce channel in addition to the generic holdout quantity for an allocation strategy. Engine will exclude this combined quantity during allocation.</p>\n\n<p>&nbsp;</p>\n\n<p><b>Support updates to inventory in delta mode</b></p>\n\n<p>Changes to on-hand and on-order inventory can be updated to account for receipts and sales.</p>\n\n<p>&nbsp;</p>\n\n<p><b>Bubble Chart for Location Contribution</b></p>\n\n<p data-renderer-start-pos=\"1\">Bubble chart is displayed in the view metric pop-up to indicate the contribution of stores for the selected KPI.Refer to<a href=\"https://SCPlanning.helpdocsonline.com/bubble-chart-in-view-metrics\"><span style=\"color:#2980b9;\"> Bubble Chart in View Metrics</span></a></p>\n\n<p>&nbsp;</p>\n\n<p><b>Location Latitude-longitude</b></p>\n\n<p>Latitude and longitude information is displayed for stores and DCs. This information is derived the zip code for the respective location.</p>\n\n<p>&nbsp;</p>\n\n<p><b>Distribution Order UI</b></p>\n\n<p>New screens are added to display Distribution order headers and lines for an allocation.</p>\n\n<p>&nbsp;</p>\n\n<p><b>New Master data Screens</b></p>\n\n<p>New screens are added to view and configure master data like calendar and product-locations.</p>\n\n<p>&nbsp;</p>\n\n<p><b>UI Changes to display allocation exceptions</b></p>\n\n<p>Exceptions are displayed in respective allocation output screens (Suggested allocations , unallocated supplies etc.) if there are errors in processing the respective supplies.</p>\n\n<ul>\n\t<li>A new flag is added to allow users to activate/deactivate a product-location for allocation.</li>\n\t<li>Size profile details are displayed for the respective product-location</li>\n\t<li>Style Template information is displayed for style products.</li>\n\t<li>User preference can now be defined and persisted for the view metrics pop-up</li>\n</ul>\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 4125,
  "scraped_at": "2025-08-09T22:47:55.032601"
}