{
  "success": true,
  "permalink": "release-notes-181",
  "title": "Release 18.1",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a hqid=\"1788908\" href=\"/home\" class=\"breadcrumb-links\">Home</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158392\" href=\"/release-notes-2\" class=\"breadcrumb-links\">Release Notes</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3501148\" href=\"/manhattan-active-omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2411194\" href=\"/2018\" class=\"breadcrumb-links\">2018</a></li><li> <span>››</span>Release 18.1</li></ul>  \t\r\n\t\t<h2>Manhattan Active&trade; Omni Release Notes (18.1)</h2>\n\n<p>Release Date: 1.5.2018<br />\n&nbsp;</p>\n\n<ul><li><a href=\"/release-notes-181$order-management\">Order Management</a><ul><li><a href=\"/release-notes-181$allocation-overrides\">Allocation Overrides</a></li><li><a href=\"/release-notes-181$collecting-s-amp-h-on-the-first-shipment\">Collecting S&amp;H on the First Shipment</a></li><li><a href=\"/release-notes-181$supply-ui-improvement\">Supply UI Improvement</a></li><li><a href=\"/release-notes-181$order-audit\">Order Audit</a></li></ul></li><li><a href=\"/release-notes-181$customer-engagement\">Customer Engagement</a><ul><li><a href=\"/release-notes-181$customer-dashboard\">Customer Dashboard</a></li><li><a href=\"/release-notes-181$case-management\">Case Management</a></li><li><a href=\"/release-notes-181$telephony-integration\">Telephony Integration</a></li><li><a href=\"/release-notes-181$social-listening\">Social Listening</a></li><li><a href=\"/release-notes-181$email-management\">Email Management</a></li></ul></li><li><a href=\"/release-notes-181$store-inventory-amp-fulfillment\">Store Inventory &amp; Fulfillment</a><ul><li><a href=\"/release-notes-181$team-based-picking\">Team Based Picking</a></li><li><a href=\"/release-notes-181$reprinting-documents\">Reprinting Documents</a></li><li><a href=\"/release-notes-181$ios-11-support\">iOS 11 Support</a></li><li><a href=\"/release-notes-181$external-parcel-integration\">External Parcel Integration</a></li></ul></li><li><a href=\"/release-notes-181$point-of-sale\">Point of Sale</a><ul><li><a href=\"/release-notes-181$promotional-events-module\">Promotional Events Module</a></li><li><a href=\"/release-notes-181$gift-card-operations\">Gift Card Operations</a></li><li><a href=\"/release-notes-181$product-catalog\">Product Catalog</a></li><li><a href=\"/release-notes-181$returns\">Returns</a></li><li><a href=\"/release-notes-181$product-emails\">Product Emails</a></li><li><a href=\"/release-notes-181$void-tender\">Void Tender</a></li></ul></li></ul>\n<p>&nbsp;</p>\n\n<h4><a name=\"order-management\" id=\"order-management\"></a>Order Management</h4>\n\n<h5><a name=\"allocation-overrides\" id=\"allocation-overrides\"></a><strong>Allocation Overrides</strong></h5>\n\n<p>Order fulfillment optimization determines the optimal fulfillment location while considering location capacity and inventory protection.&nbsp;Retailers now have the flexibility to ignore capacity constraints and inventory protection for specific orders, delivery methods or for a subset of locations based on special situations, such as&nbsp;a high priority order, a gold customer order, or a &#39;buy online, pick up in store&#39; purchase.&nbsp;This enables expanded fulfillment option evaluation in lieu of backordering, by allowing retailers to evaluate these options during initial allocation optimization or as a final evaluation in order to reduce backorders.</p>\n\n<h5><a name=\"collecting-s-amp-h-on-the-first-shipment\" id=\"collecting-s-amp-h-on-the-first-shipment\"></a><strong>Collecting S&amp;H on the First Shipment</strong></h5>\n\n<p>A new option is made available to collect the S&amp;H charge when the first item within an order is shipped. The S&amp;H charges are charged at the fulfillment (shipping) group level. A fulfillment group is described as a group of order lines within an order having same Delivery Method, Shipping Method, Shipping Address and Ship To Location. If there are multiple fulfillment groups, then the customer is charged whenever the first item within that fulfillment group is shipped. For example, if an order has a combination of ship to home and pick-up in store items, then the customer does not get charged for S&amp;H when the pick-up in store items are picked up.</p>\n\n<h5><a name=\"supply-ui-improvement\" id=\"supply-ui-improvement\"></a><strong>Supply UI Improvement</strong></h5>\n\n<p>As part of this release, a number of improvements have been made to the Supply UI. The inventory search has been improved to include item and location search, ability to select multiple locations, and the filtering of supply by various attributes.&nbsp;The result set has been expanded to include all supply attributes, such as PO, ASN, ETA, Error flag, On hand and Available quantity.</p>\n\n<h5><a name=\"order-audit\" id=\"order-audit\"></a><strong>Order Audit</strong></h5>\n\n<p>Functionality&nbsp;has been added to track changes to orders that are both initiated by the customer and system, such as changes to the ordered quantity, shipping address, payment, promotions, coupons, appeasements, return, etc.</p>\n\n<h4><a name=\"customer-engagement\" id=\"customer-engagement\"></a>Customer Engagement</h4>\n\n<h5><a name=\"customer-dashboard\" id=\"customer-dashboard\"></a><strong>Customer Dashboard</strong></h5>\n\n<p>Customer Dashboard is a landing page for CSRs when they start an interaction with a customer. The screen provides a single view of the customer with metrics including purchase history, fulfillment history, social influence, local time, weather, previous transactions, phone/email/chat/social interaction history, along with open cases.&nbsp;From the Customer Dashboard CSRs may click to navigate and get more information about order status, provide order modifications, and view interaction/case details.&nbsp;</p>\n\n<h5><a name=\"case-management\" id=\"case-management\"></a><strong>Case Management</strong></h5>\n\n<p>Case Management provides CSRs&nbsp;the ability to create cases for follow-up and manage work in progress with case assignment, priority, and status. Case metrics are available as part of a new CSR dashboard and provides information about escalated cases, open cases, and case categories. Cases provide the ability to link to a customer and/or&nbsp;transaction for quick access to customer dashboard and order status screens from within a case. The case timeline shows the sequence of interactions which have&nbsp;occurred&nbsp;related to a case so&nbsp;CSRs&nbsp;can get the full picture.</p>\n\n<h5><a name=\"telephony-integration\" id=\"telephony-integration\"></a><strong>Telephony Integration</strong></h5>\n\n<p>In order to provide a quick and seamless experience&nbsp;for CSRs and customers during customer search, Computer Telephony Integration (CTI) is supported to quickly launch the Customer Dashboard of a customer. A call wrap-up panel is available to&nbsp;capture call reasons, notes, resolutions, and flag calls for follow up. Integration with major telephony providers is supported via CTI-specific&nbsp;APIs.&nbsp;</p>\n\n<h5><a name=\"social-listening\" id=\"social-listening\"></a><strong>Social Listening</strong></h5>\n\n<p>Social CSR teams in the contact center often&nbsp;use tools which are not designed for customer&nbsp;service or&nbsp;don&#39;t any have&nbsp;tools to provide customer service over social channels. The social listening component therefore provides a new way to&nbsp;listen to customer requests via social channels and respond in a streamlined workflow tailored for customer service. Using a single UI, CSRs can manage incoming social requests by marking them as done, flagging them for follow up, and/or responding to the customer; which manages these social requests while understanding the customer context and having reference to previous interactions.&nbsp;Direct API integration is provided for Facebook, Facebook Messenger, Twitter, and Twitter Direct Message.</p>\n\n<h5><a name=\"email-management\" id=\"email-management\"></a><strong>Email Management</strong></h5>\n\n<p>Manage the queue of incoming customer emails and respond directly from within Customer Engagement, while understanding the customer context around the email. A natively available email editor includes the ability to format text and all email correspondence is visible within the timeline of a case.</p>\n\n<h4><a name=\"store-inventory-amp-fulfillment\" id=\"store-inventory-amp-fulfillment\"></a>Store Inventory &amp; Fulfillment</h4>\n\n<h5><a name=\"team-based-picking\" id=\"team-based-picking\"></a><strong>Team Based Picking</strong></h5>\n\n<p>Orders can now be distributed (split)&nbsp;across multiple&nbsp;associates, enabling pick by department(s) or role. This&nbsp;improves picking efficiency in stores&nbsp;where associates specialize in particular&nbsp;departments. Once picking is complete, the items are&nbsp;sorted by order and placed in a staging location. Associates can begin packing&nbsp;when an individual order is ready or once all picked items&nbsp;have been sorted.</p>\n\n<p>Sorting is the process of scanning individual items&nbsp;and placing them in a staging location, which typically represents an order.&nbsp;When an item is scanned, the application determines the order the item belongs to. If&nbsp;the order already has a staging location assigned, the associate is guided to use the same location. The associate receives a confirmation message once an order is completely sorted.</p>\n\n<p>For shipments, sorting must be completed&nbsp;before packing is initiated. Associate can initiate packing by scanning&nbsp;staging location to retrieve&nbsp;the order or by selecting from the list of orders ready for packing.&nbsp;Staging locations for all items on the order are displayed&nbsp;to the associate for packing.</p>\n\n<p>For in-store&nbsp;pickups, the pickup slip can be printed once sorting is completed for that order. Associates can continue sorting items for other orders after the pickup slip is printed.&nbsp;During confirm pickup, the sorted orders and corresponding staging locations are displayed. An order can be picked up by the customer anytime after picking is completed<span style=\"color: rgb(255, 0, 0);\">.</span></p>\n\n<p>Using configuration rules, distributed&nbsp;picking and unified sortation&nbsp;can be enabled for ship from store orders and /or in-store pickups.</p>\n\n<h5><a name=\"reprinting-documents\" id=\"reprinting-documents\"></a><strong>Reprinting Documents</strong></h5>\n\n<p>The reprint menu option allows a user&nbsp;to reprint a pickup slip or&nbsp;shipping collate. This is necessary when:</p>\n\n<ul>\n\t<li>\n\t<p>Printing failed</p>\n\t</li>\n\t<li>\n\t<p>Original document is lost or damaged</p>\n\t</li>\n\t<li>\n\t<p>Document was not printed properly due to printer problem</p>\n\t</li>\n\t<li>\n\t<p>Customer requests a duplicate copy of the document</p>\n\t</li>\n</ul>\n\n<p>To reprint a document, users can search for&nbsp;orders by item and then select from a list of matching orders.</p>\n\n<h5><a name=\"ios-11-support\" id=\"ios-11-support\"></a><strong>iOS 11 Support</strong></h5>\n\n<p>The Store app now supports iOS&nbsp;11 for handheld devices. See the&nbsp;<a hqid=\"1832731\" href=\"/certified-technology\">Supported Technology</a>&nbsp;page for additional details.</p>\n\n<h5><a name=\"external-parcel-integration\" id=\"external-parcel-integration\"></a><strong>External Parcel Integration</strong></h5>\n\n<p>Retailers can now integrate with parcel carriers beyond&nbsp;the out-of-the-box supported UPS, FedEx and Agile through extension points. This includes the ability to retrieve&nbsp;tracking numbers, ship, track, void, return and perform rate shopping.</p>\n\n<h4><a name=\"point-of-sale\" id=\"point-of-sale\"></a>Point of Sale</h4>\n\n<h5><a name=\"promotional-events-module\" id=\"promotional-events-module\"></a><strong>Promotional Events Module</strong></h5>\n\n<p>Manhattan Active&trade; POS&nbsp;now offers a Promotional Events Module.&nbsp; Automatic discounting (benefits) will be applied to configured items (targets) when an Order meets configured trigger criteria (qualifiers).&nbsp; A promotional Deal is the complete set of parameters which establish this condition.&nbsp; The price-promo module will&nbsp;price or re-price&nbsp;all items in the cart every time an item is added (or removed, or discounted) during a Sale, so this activity occurs in real-time during the transaction.</p>\n\n<h5><a name=\"gift-card-operations\" id=\"gift-card-operations\"></a><strong>Gift Card Operations</strong></h5>\n\n<p>Gift Card operations (apart from tender) are now supported.&nbsp;The various gift card operations are&nbsp;Activate a new gift card,&nbsp;reload an existing gift card, and gift card balance inquiry.</p>\n\n<p>Activate Gift Card:</p>\n\n<ul>\n\t<li>A new gift card can be activated from the POS Active store app.</li>\n\t<li>Gift card can be&nbsp;pre-loaded or user can choose/enter the amount with which the gift card can be activated.</li>\n\t<li>Gift card purchase can be tendered using any of the available payment type supported.</li>\n\t<li>The Activated gift card will&nbsp;be printed/emailed on the receipt with the activated balance within the sale receipt.</li>\n</ul>\n\n<p>Reload&nbsp;Gift Card:</p>\n\n<ul>\n\t<li>A existing gift card which is already active can be reloaded from the POS Active store app.</li>\n\t<li>During the process of reloading Gift card, user can choose/enter the amount that needs to be reloaded.</li>\n\t<li>Gift card&nbsp;reload can be tendered using any of the available payment type supported.</li>\n\t<li>The reloaded gift card will&nbsp;be printed/emailed on the receipt with the available&nbsp;balance within the sale receipt.</li>\n</ul>\n\n<p>Gift card Balance inquiry:</p>\n\n<ul>\n\t<li>Balance inquiry can now be performed on any of the existing and active&nbsp;gift card&nbsp;from the POS Active store app.</li>\n\t<li>A gift card inquiry can&nbsp;be by itself a transaction or can be part of an existing sale transaction.</li>\n\t<li>The gift card inquiry&nbsp;will&nbsp;be printed/emailed on the receipt with the available balance within the sale receipt or an inquiry receipt by itself.</li>\n</ul>\n\n<h5><a name=\"product-catalog\" id=\"product-catalog\"></a><strong>Product Catalog</strong></h5>\n\n<p>Several enhancements have been made to the Product Catalog.</p>\n\n<ul>\n\t<li>Direct navigation to Order Summary - if an active customer has any items within their cart, the user can now choose to go directly to the order summary to quickly check out and complete the transaction.</li>\n\t<li>Item Availability Indicator - items within the product catalog, wishlist, and workspace will now show an availability indicator badge on the item thumbnail.</li>\n\t<li>Updated Item Added to Cart Navigation - from the Item Details screen, if a user chooses to add an item to the cart, they will receive a successful item added message.</li>\n\t<li>Workspace and Wishlist View All - when a user selects the View All option for either the Workspace or Wish List, they will see a full screen view of all items within these areas.</li>\n\t<li>Color swatch image - item details will now display the color swatch image from the image file.</li>\n\t<li>Enlarged Image Scroll - users can now select the item image within the item details screen and can scroll through the enlarged images.</li>\n</ul>\n\n<h5><a name=\"returns\" id=\"returns\"></a><strong>Returns</strong></h5>\n\n<p>More functionality has been added to the existing streamlined returns.</p>\n\n<ul>\n\t<li>Return Customer verification on MX - during a return transaction, the customer attached to the transaction will be displayed on MX for customer confirmation.</li>\n\t<li>Refund check-Capture Customer Info - capturing a customer information screen when&nbsp;refund payment type is mail &quot;Refund check&quot; is now supported.</li>\n\t<li>Customer ID for Returns - capturing a Customer ID during returns can now be configured.</li>\n</ul>\n\n<h5><a name=\"product-emails\" id=\"product-emails\"></a><strong>Product Emails</strong></h5>\n\n<p>Email templates are set up by retailers&nbsp;for sending product information to customers.&nbsp;Within the template, retailers can choose to set the subject and message, as well as define if either or both can be edited by users&nbsp;(at the store level)&nbsp;within the application.&nbsp; When a user chooses to email product(s) to a customer, they have the ability to select from the list of templates available&nbsp;from the email screen. Users can add or remove email addresses, or choose to search for an existing customer&#39;s address for use in email delivery.</p>\n\n<h5><a name=\"void-tender\" id=\"void-tender\"></a><strong>Void Tender</strong></h5>\n\n<p>The retailer can now void the partially tendered payment during the transaction. &nbsp;This can be configured for&nbsp;each payment type, as the retailer can choose to switch this ON/OFF making a&nbsp;paymentType&nbsp;voidable&nbsp;or non-voidable. &nbsp;The payments which are partially paid can be voided before the balance due = 0 or before proceeding to the&nbsp;receipt screen.</p>\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 17148,
  "scraped_at": "2025-08-09T22:47:32.586645"
}