{
  "id": "2284923",
  "permalink": "release-notes-19.4",
  "title": "Release 19.4",
  "type": "topic",
  "level": 4,
  "path": "Home/Release Notes/Manhattan Active® Omni/2019/Release 19.4",
  "raw_item": {
    "id": "2284923",
    "text": "Release 19.4",
    "title": "Release 19.4",
    "permalink": "release-notes-19.4",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "240618",
    "parent": "f;240618",
    "created_date": "1568983857",
    "modified_date": "1704451258",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": 100002
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a hqid=\"1788908\" href=\"/home\" class=\"breadcrumb-links\">Home</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158392\" href=\"/release-notes-2\" class=\"breadcrumb-links\">Release Notes</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3501148\" href=\"/manhattan-active-omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2411193\" href=\"/2019\" class=\"breadcrumb-links\">2019</a></li><li> <span>››</span>Release 19.4</li></ul>  \t\r\n\t\t<h2>Manhattan Active&trade; Omni Release Notes&nbsp;19.4</h2>\r\n\r\n<p>Release Date: 9.20.2019<br />\r\n&nbsp;</p>\r\n\r\n<ul><li><a href=\"/release-notes-19.4$order-management\">Order Management</a><ul><li><a href=\"/release-notes-19.4$flexible-payment-invoicing\">Flexible Payment Invoicing</a><ul><li><a href=\"/release-notes-19.4$support-for-triggering-creation-of-invoice-on-shipment-of-last-merge-leg\">Support for Triggering Creation of Invoice on Shipment of Last Merge Leg</a></li><li><a href=\"/release-notes-19.4$support-for-triggering-creation-of-invoice-on-picked-or-packed-fulfillment-status\">Support for Triggering Creation of Invoice on Picked or Packed Fulfillment Status</a></li></ul></li><li><a href=\"/release-notes-19.4$site-to-store-order-capacity-control\">Site to Store Order Capacity Control</a></li><li><a href=\"/release-notes-19.4$ability-to-enable-location-capacity-utilization-update-nbsp\">Ability to Enable Location Capacity Utilization Update&nbsp;</a></li><li><a href=\"/release-notes-19.4$inventory-audit-ability-to-persist-additional-inventory-attributes\">Inventory Audit - Ability to Persist Additional Inventory Attributes</a></li><li><a href=\"/release-notes-19.4$digital-self-service-nbsp-ndash-view-print-return-label-nbsp\">Digital Self-Service&nbsp;&ndash; View/Print Return Label&nbsp;</a></li><li><a href=\"/release-notes-19.4$order-timeline\">Order Timeline</a></li></ul></li><li><a href=\"/release-notes-19.4$store-inventory-fulfillment\">Store & Inventory Fulfillment</a><ul><li><a href=\"/release-notes-19.4$store-initiated-transfers\">Store-Initiated Transfers</a></li><li><a href=\"/release-notes-19.4$ios-support\">iOS Support</a></li><li><a href=\"/release-notes-19.4$display-task-group\">Display Task Group</a></li><li><a href=\"/release-notes-19.4$receiving-enhancements\">Receiving Enhancements</a></li><li><a href=\"/release-notes-19.4$require-customer-id-verification\">Require Customer ID Verification</a></li><li><a href=\"/release-notes-19.4$shipping-document-reprint\">Shipping Document Reprint</a></li></ul></li><li><a href=\"/release-notes-19.4$point-of-sale\">Point of Sale</a><ul><li><a href=\"/release-notes-19.4$interactions\">Interactions</a></li><li><a href=\"/release-notes-19.4$email-communication-nbsp\">Email Communication&nbsp;</a></li><li><a href=\"/release-notes-19.4$store-wide-activity-view\">Store-wide Activity View</a></li><li><a href=\"/release-notes-19.4$text-message-communication\">Text Message Communication</a></li></ul></li></ul>\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"order-management\" id=\"order-management\"></a>Order Management</h4>\r\n\r\n<hr />\r\n<h5><a name=\"flexible-payment-invoicing\" id=\"flexible-payment-invoicing\"></a><strong>Flexible Payment Invoicing</strong></h5>\r\n\r\n<p>Currently for charging the customer through payment settlement, Invoice is created only once the order is finally fulfilled or delivered to the customer. Retailers may want to trigger Invoice generation for order statuses other than fulfilled or delivered so that they can charge the customer before it is delivered. For example, in case of export orders, retailers will want to charge the customer as soon as the inventory is shipped to the DC or store from where the final delivery leg is executed. For pick-up at store orders, retailers want to charge the customer when the items are Picked by the store associate and before the customers picks it up to avoid a no-show.</p>\r\n\r\n<h6><a name=\"support-for-triggering-creation-of-invoice-on-shipment-of-last-merge-leg\" id=\"support-for-triggering-creation-of-invoice-on-shipment-of-last-merge-leg\"></a><strong>Support for Triggering Creation of Invoice on Shipment of Last Merge Leg</strong></h6>\r\n\r\n<p>Configurations are provided for triggering creation of invoice for Ship to Store and Ship to Address - merge order lines, when quantities are shipped for the last merge leg, before the pickup leg or the delivery leg so that creation of invoice can be triggered when quantities are shipped to the store and before the customer picks it up for Ship to Store Lines or when quantities are shipped to the distribution center or store and before it is finally shipped to the customer for Ship to Address Lines.</p>\r\n\r\n<p>On short cancellation of quantities in the subsequent pickup leg or delivery leg after invoice is created resulting in a refund scenario, creation of adjustment invoice will be triggered for the canceled quantities.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: For the ship to store delivery method, if shipment of last merge leg is configured, triggering creation of invoice cannot be configured for any other fulfillment statuses.&nbsp;</div>\r\n\r\n<h6><a name=\"support-for-triggering-creation-of-invoice-on-picked-or-packed-fulfillment-status\" id=\"support-for-triggering-creation-of-invoice-on-picked-or-packed-fulfillment-status\"></a><strong>Support for Triggering Creation of Invoice on Picked or Packed Fulfillment Status</strong></h6>\r\n\r\n<p>Create Invoice on configurations on Order Configuration screen, Payment container has been enhanced to include Picked fulfillment status in addition to currently available Fulfilled and Delivered statuses for Pick Up at Store delivery method. Similarly, Packed fulfillment status is available in addition to Fulfilled and Delivered statuses for Store Sales, Ship to Store, Ship to Address and Email delivery methods.</p>\r\n\r\n<p>For example, invoice can be generated for Picked fulfillment statuses for Pickup at Store orders as soon as items are picked. Similarly, invoice can be generated for Packed fulfillment statuses for Ship to Store orders as soon as items are Packed in the store and before it is delivered to customers.</p>\r\n\r\n<p>On short cancellation of quantities after invoice is created in the subsequent fulfillment statuses resulting in a refund scenario, creation of adjustment invoice will be triggered for the canceled quantities.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: For Ship to Address delivery method, if Shipment of last merge leg is configured the Packed fulfillment status cannot be selected for triggering creation of invoice.</div>\r\n\r\n<p class=\"info\"><strong>Note:</strong> Flexible Payment Invoicing configurations profoundly hinge on the assumption that the odds of reallocation for already invoiced quantities to another fulfillment source due to short reallocation in subsequent legs is not anticipated. If short reallocation in subsequent legs results in already invoiced quantities being reallocated to DC or Store other than what was recorded in the existing Invoice, the existing invoice will not be modified to reflect this change which means there will be inconsistency between invoice details and physical reality in respect to the below mentioned details.&nbsp;&nbsp;Package Id&#39;s mentioned on the Invoice and package Id&rsquo;s delivered to customer.&nbsp;Jurisdiction and invoice tax in case of source-based taxation.&nbsp;Physical origin Id on the invoice and physical origin Id of actual shipment (hence it is not advisable to use invoice published in sales posting to account for inventory in downstream systems).&nbsp;Any custom attribute/s on invoice populated when invoice is generated (for example, item serial numbers, gift card numbers, etc.).</p>\r\n\r\n<h5><a name=\"site-to-store-order-capacity-control\" id=\"site-to-store-order-capacity-control\"></a><strong>Site to Store Order Capacity Control</strong></h5>\r\n\r\n<p>When a Site to Store order is received at a store for pickup, the store associate has minimal work to make the shipment ready for customer pickup. As a result, some retailers would prefer that these orders do not consume capacity that is also used for store picking and packing. A new configuration is available to prevent Site to Store orders from consuming store capacity.</p>\r\n\r\n<h5><a name=\"ability-to-enable-location-capacity-utilization-update-nbsp\" id=\"ability-to-enable-location-capacity-utilization-update-nbsp\"></a><strong>Ability to Enable Location Capacity Utilization Update&nbsp;</strong></h5>\r\n\r\n<p>If a view is enabled to exclude locations at full capacity, location is capped for a certain number of orders/units per shift/day. Once a location reaches its max capacity, the location is marked as &quot;Capacity Full&quot; and inventory at that location is removed from the view. As a result, no additional orders are allocated to that location. When a new shift/day starts, a batch job resets the capacity utilization details, and will carry forward pending backlog (if any)&nbsp;marking location as &quot;Capacity Full&quot; false which brings the location back in view.</p>\r\n\r\n<p>As part of this release, configuration is provided to reduce capacity utilization based on a configurable status. For example, capacity can be reduced when Ship to Address orders are packed. This enables the store to process more orders than defined in maximum capacity per shift. The goal here is that if a store is defined to process 10 orders per day and they finish by 9:00 am, enable that store to receive more orders and continue to expose that stores inventory online. In addition, this allows the store to be configured to ensure they never have more than a certain number of orders in the queue (capacity utilization), while still reducing the queue of work based on completing an order. A new flag in inventory parameters, &quot;ReduceUtilizedCapacity&quot; is added. Once it&#39;s enabled, utilized capacity of a location will keep on reducing, as and when orders reach the status configured in order parameter - &quot;Release Location Capacity when the PickUp or ShipToAddress order is in Pick/Pack/Ship status&quot;. If a location still reaches its maximum capacity, it will be marked as Capacity Full &ndash; True. As the store processes more orders, the store will not be immediately marked as &quot;Capacity Full&quot; false. There will be a delay of 60 minutes after which location will be evaluated and marked as &quot;Capacity Full&quot; false. This will bring location back in View.</p>\r\n\r\n<p>If this feature is enabled, utilized capacity details captured in TotalCapacityUtilized will keep on reducing as and&nbsp;when orders are processed. To capture information about how much operational capacity is consumed for a location, a new attribute TotalCapacityConsumed is introduced in capacity utilization details. Fulfillment Capacity Utilization report in Fulfillment Analytics will refer to consumed capacity to show operational utilization.</p>\r\n\r\n<div class=\"tip\"><b>Note:</b> Delay to include Location back in View is configurable in inventory parameter (Minimum value can be 60 minutes).</div>\r\n\r\n<h5><a name=\"inventory-audit-ability-to-persist-additional-inventory-attributes\" id=\"inventory-audit-ability-to-persist-additional-inventory-attributes\"></a><b>Inventory Audit - Ability to Persist Additional Inventory Attributes</b></h5>\r\n\r\n<p>To provide supply information to Manhattan Active Omni, a list of transaction types is&nbsp;supported such as Adjustment, Movement, Receipt, etc. All inventory actions/activity that take place in the external systems are mapped to one of these supported transaction types. For instance, &quot;Cycle count&quot; is mapped to Adjustment, &quot;Returned in Store&quot; will&nbsp;also be mapped to Adjustment.</p>\r\n\r\n<p>As a part of this release, in addition to current auditing feature, retailers can also capture the actions or original activity taken place in the external system which resulted in the change to the supply record. Inventory supply can persist two additional attributes whose values will be audited in Inventory audit details. If Audit functionality is enabled for Supply, system will start auditing any updates to these new attributes - InventoryTransactionType and InventoryTransactionId. This allows for example the Host to differentiate between a Cycle Count vs Return to Store.&nbsp; To differentiate the internally generated adjustments created as a result of the Inventory Sync from other Adjustments sent directly to the supply event, Inventory Sync adjustments will have InventoryTransactionType as &quot;InboundSync&quot; and InventoryTransactionId with transaction number (existing attribute in sync event).</p>\r\n\r\n<p>There is no UI for retrieving audit records. Rest API - /inventory/api/audit/entity/supply?format=V2 needs to be executed to see audit trails. More details for this API are present in Inventory Process Guide.</p>\r\n\r\n<div class=\"tip\"><b>Note:</b> System doesn&#39;t audit for Supply inserts, so any new supply creation is not audited.</div>\r\n\r\n<h5><a name=\"digital-self-service-nbsp-ndash-view-print-return-label-nbsp\" id=\"digital-self-service-nbsp-ndash-view-print-return-label-nbsp\"></a><b>Digital Self-Service</b>&nbsp;&ndash; <b>View/Print Return Label&nbsp;</b></h5>\r\n\r\n<p>Starting this release, customers initiating a return via the Digital Self-Service web portal (DSS) can view and print the Return Label from their devices. We have added a new button on return confirmation screen as part of the &lsquo;create return&rsquo; flow of Digital Self-Service, clicking which would open the return label. The customer can then use the browser functionalities to save / print the return label. In case the system fails to generate/fetch the return label, then an appropriate error message is displayed to the customer so that they can reach out to the retailer&rsquo;s contact center in order to proceed with the next steps.</p>\r\n\r\n<h5><a name=\"order-timeline\" id=\"order-timeline\"></a><b>Order Timeline</b></h5>\r\n\r\n<p>Customer Service Representatives (CSRs) using a purpose-built screen within the Contact Center UI can now understand the list of events that has occurred on an order which would help them respond to customer queries more effectively. This feature captures the relevant events required by the CSRs as part of the order lifecycle initiated by both user and system and displays them in a chronological order. This includes basic fulfillment events such as, allocation and release. Order updates such as quantity updates, address changes, appeasements and price overrides, and these events are represented in a user-friendly view.<br />\r\n&nbsp;</p>\r\n\r\n<h4><a name=\"store-inventory-fulfillment\" id=\"store-inventory-fulfillment\"></a>Store & Inventory Fulfillment</h4>\r\n\r\n<hr />\r\n<h5><a name=\"store-initiated-transfers\" id=\"store-initiated-transfers\"></a><strong>Store-Initiated Transfers</strong></h5>\r\n\r\n<p dir=\"ltr\">Manhattan Active Store now allows stores to initiate inventory transfers to another location in order for the store to quickly respond to adhoc transfer requests. For example, if a district manager sees that one store in the region has a low inventory level for a popular promotional item while another store has a much higher inventory level, the store with excess inventory can now create a store-initiated transfer to replenish the other store . Store-initiated transfers allow stores to be self-sufficient by directly creating transfer orders without the need for the corporate office to manage and initiate the process. &nbsp;Once the shipping store is notified of the request (i.e., through in person, phone, e-mail, spreadsheet, etc.) a store associate can transfer inventory.</p>\r\n\r\n<ul dir=\"ltr\">\r\n\t<li>\r\n\t<p><strong>Transfer order creation -&nbsp;</strong>A transfer order can be created in seconds.&nbsp;The associate selects the&nbsp;receiving location as well as the carrier and service level. Any location within the store&#39;s&nbsp;organization can be selected. For shipping, both parcel and&nbsp;non-parcel carriers are supported.</p>\r\n\t</li>\r\n\t<li><strong>Picking</strong>&nbsp;- Picking is performed offline based on inventory request to the other location.</li>\r\n\t<li><strong>Packing</strong>&nbsp;- Once the order is created, associates can immediately begin scanning items and packing into package(s.) As each package is finished, the corresponding shipping documents are printed.&nbsp;The system allows&nbsp;different associates to pack a particular transfer order at different periods of time, if needed.</li>\r\n\t<li><b>Inventory Updates</b>: Once the packages&nbsp;are shipped, inventory gets reduced from the origin location and in-transit record gets created for the destination location.</li>\r\n\t<li><strong>Close order</strong>&nbsp;- Once all package(s) are packed, the associate closes the order.</li>\r\n</ul>\r\n\r\n<p>In the event that the packing should be undone, a cancel packing option is also available.</p>\r\n\r\n<h5><a name=\"ios-support\" id=\"ios-support\"></a><strong>iOS Support</strong></h5>\r\n\r\n<p>Support for the iPod Touch 7th Generation has been added. For a full list of supported devices, please check the&nbsp;<a hqid=\"1832731\" href=\"/certified-technology\">Supported Technology</a>&nbsp;page.</p>\r\n\r\n<h5><a name=\"display-task-group\" id=\"display-task-group\"></a><strong>Display Task Group</strong></h5>\r\n\r\n<p>Task Group is now displayed on the Task Monitoring UI. This gives the store manager additional information when a partially completed picklist&nbsp;needs to be reassigned to another associate.</p>\r\n\r\n<h5><a name=\"receiving-enhancements\" id=\"receiving-enhancements\"></a><strong>Receiving Enhancements</strong></h5>\r\n\r\n<p>The ability for store associates to receive an unknown package (by order) and receive a wrong store package are now based on user permissions. A store associate can only perform these receiving functions if they have the corresponding permission.</p>\r\n\r\n<p>ASN Verification now automatically occurs when the last package is received for a fulfillment, eliminating the need to wait until the job scheduler runs to perform the verification. For scenarios when a package&nbsp;is shipped and received at the wrong store, the inventory updates between the intended versus actual store now occur sooner since they are triggered during the ASN verification process. This applies to receipt type item or package. The job scheduler continues to handle verification for any ASNs with missing packages.</p>\r\n\r\n<h5><a name=\"require-customer-id-verification\" id=\"require-customer-id-verification\"></a><strong>Require Customer ID Verification</strong></h5>\r\n\r\n<p>Configuration now controls whether customer ID verification is required for confirm pickups. Customer&nbsp;verification continues to be optional unless this configuration is enabled.</p>\r\n\r\n<h5><a name=\"shipping-document-reprint\" id=\"shipping-document-reprint\"></a><b>Shipping Document Reprint</b></h5>\r\n\r\n<p>Shipping documents (labels and collate) can be reprinted from Manhattan Active SOF for up to 30 days from the date of creation. Shipping documents older than 30 days will be deleted as part of environment maintenance.<br />\r\n&nbsp;</p>\r\n\r\n<h4><a name=\"point-of-sale\" id=\"point-of-sale\"></a>Point of Sale</h4>\r\n\r\n<hr />\r\n<h5><a name=\"interactions\" id=\"interactions\"></a><strong>Interactions</strong></h5>\r\n\r\n<p>Today&#39;s retailer&nbsp;must create&nbsp;a more personalized experience for their customers in order to be competitive as Gen Z shoppers (over 70 million in the US) create higher demands. This is nowhere more evident than in the store, since research data shows that Gen Z shoppers (along with Gen X and Millennials) are frequenting stores in high numbers.&nbsp;One of the novel ways to deliver a higher level of engagement with these customers is to support&nbsp;two-way communication between the brick and mortar channel (stores) and customers.&nbsp;With&nbsp;<em>Interactions</em>, not only can a store associate initiate a customer communication, but they can also send relevant product content and can&nbsp;view and reply to certain types of inbound communications from their customers.&nbsp;</p>\r\n\r\n<p>Here is a list of new two-way interaction types supported in the 19.4 release of Point of Sale and Store Customer Engagement.</p>\r\n\r\n<ul>\r\n\t<li>Email: Single/multiple item emails; Lookbooks; General; Appointments - when integrated with a third party ESP, inbound emails are visible to users, and they can respond to the customer.</li>\r\n\t<li>Text Messages -&nbsp;can be initiated by the store associate, or the associate can respond to an inbound message from a known customer. Today, the outbound text is sent from a common, store account.</li>\r\n\t<li>Chat (viewable only). Currently, outbound chat is only supported by with the Contact Center application and Customer Engagement to ensure that a chat representative is always&nbsp;available.</li>\r\n\t<li>Social Media (viewable only). Currently this data exists when a retailer owns Customer Engagement and has integrated Social Media feeds directly with a Social Media&nbsp;platform, like Facebook or&nbsp;Twitter.&nbsp;</li>\r\n\t<li>Virtual Assistant (viewable only). Currently these interactions occur between the customer and the direct channel Customer Support Representative, in the Manhattan Active Contact Center Application with Customer Engagement. Inbound queries can be received through a Twilio-integrated feed from Amazon Alexa.</li>\r\n\t<li>In-store Pickups (viewable only)</li>\r\n</ul>\r\n\r\n<p>When looking at interactions within a customer record, the user can view all interactions for that customer, regardless of the location in which the interaction occurred, or is with.&nbsp; This includes interactions not just with other store locations, but also contact center or website chat bots.</p>\r\n\r\n<p>When looking at interactions within the store-wide view of interactions, users will be able to view all interactions for the specific location from which they are logged into the application.</p>\r\n\r\n<p>We have included the framework and facility to collect and enforce Opt-In or Opt-Out criteria for each customer and channel type (text, phone, email)&nbsp;to ensure compliance with privacy requirements in various jurisdictions.</p>\r\n\r\n<h5><a name=\"email-communication-nbsp\" id=\"email-communication-nbsp\"></a><strong>Email Communication&nbsp;</strong></h5>\r\n\r\n<p>Two-way communication now makes the overall experience of the store more interactive. Retailers can share number of details with the customer over the email now.</p>\r\n\r\n<p>Receipt email continues to be&nbsp;part of the remaining list without any modifications on the template or the way it is triggered.&nbsp;</p>\r\n\r\n<p>Retailers have the below email options&nbsp;to communicate with the customer.&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>Single/Multiple Item Email -&nbsp; This is an enhancement on the existing item details email which is used to send details of a single item over an&nbsp;email.&nbsp;This&nbsp;email type now enables the retailers to share the details of single or multiple item over the email. The item details are shared as embedded image in the email body thus there is no limit to the number of items details&nbsp;that can be shared over the mail.&nbsp;</li>\r\n\t<li>LookBook Email - Lookbook created by the retailers can be shared over the emails in the specific templates.&nbsp;</li>\r\n\t<li>General Email - This is a new type of the email that is introduced to provide the retailers to share ad hoc information over the mail. Retailers can share details&nbsp;to the customer which is different than the usual transactional emails. These emails can be used to provide information such as - new arrivals at the store, or if there is any order which can be picked from the store etc.&nbsp;</li>\r\n\t<li>Appointment Email - Retailers earlier had the ability to create the appointment for the customers at the store. Now, these appointment details can also be shared over the email. These emails will include details like the store location, start and end date and time of the appointment.&nbsp;</li>\r\n</ol>\r\n\r\n<p>Each of these emails have specific templates attached to them. These templates contain the format specific to each type of the email and are configurable. Retailers can modify them as per their requirements.&nbsp;</p>\r\n\r\n<h5><a name=\"store-wide-activity-view\" id=\"store-wide-activity-view\"></a><strong>Store-wide Activity View</strong></h5>\r\n\r\n<p>Store users will now have the ability to view Announcements, Lookbooks, Appointments, and Tasks&nbsp;across the store.&nbsp; Previously these features were limited to the specific user - for example, a Store Manager could not see a Task created by a Store Associate.&nbsp; &nbsp;</p>\r\n\r\n<p>This store-wide view is protected by grants - retailers can choose to extend this ability only to the Store Manager role, for example.</p>\r\n\r\n<p>This enhancement provides users (with permissions) with&nbsp;visibility across activities in the store&nbsp;to allow them to take appropriate and necessary corrective actions.</p>\r\n\r\n<p><strong>Appointments</strong></p>\r\n\r\n<p>Providing access to view the appointments across&nbsp;the store&nbsp;for a givien day or the calendar month&nbsp;enhances to track the proceedings in the store. This data can be leveraged to track&nbsp;productivity of the store associates, and also corrective actions during absence of any associates for an appointment.</p>\r\n\r\n<p>With the access to this data store managers or users can:</p>\r\n\r\n<ol>\r\n\t<li>View appointments across the store created and maintained by all users in the store.</li>\r\n\t<li>Edit appointments created by other users during their absence.</li>\r\n\t<li>Delete or cancel appointments which needs corrective actions.</li>\r\n</ol>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Appointments now have new statuses added to base seed data (i.e. Created, Accepted, Tentative, Declined, Cancelled)&nbsp; to support two-way communication with customers.</div>\r\n\r\n<p><strong>Tasks</strong></p>\r\n\r\n<p>Providing access to tasks across all users in the store, add more transparency and&nbsp;enable&nbsp;store managers&nbsp;to make more informed decisions. These decisions help to track efficiency of the store associates, and also help&nbsp;increase their productivity.</p>\r\n\r\n<p>This enables the store managers to:</p>\r\n\r\n<ol>\r\n\t<li>View the tasks for a given&nbsp;day or the calendar month created by users across the store.</li>\r\n\t<li>It&#39;s a read&nbsp;only access, store managers cannot edit/delete the tasks created by other users.</li>\r\n\t<li>Store manager can still create, edit&nbsp;or delete&nbsp;their own tasks.</li>\r\n</ol>\r\n\r\n<p><strong>Lookbooks</strong></p>\r\n\r\n<p>Managing retail data can be a challenge, primarily because the industry is largely built on a revolving door of short-term employees who don&rsquo;t often move beyond entry-level positions. Learning how to effectively manage these data when they are constantly in a state of flux can be difficult. Providing data transparency&nbsp;gives access to all lookbooks created in that store across&nbsp;users. The store managers can now make access and make effective decisions over this data and re-use data when necessary.</p>\r\n\r\n<p>This enables the store managers to:</p>\r\n\r\n<ol>\r\n\t<li>View the lookbooks&nbsp;created by all users in the store.</li>\r\n\t<li>It&#39;s a read&nbsp;only access, but store managers can still access other lookbooks and make&nbsp;a copy&nbsp;if it can be re-used.</li>\r\n\t<li>Store manager can still create, edit&nbsp;or delete&nbsp;their own lookbooks.</li>\r\n\t<li>This data access will also provide the ability to track productivity of each users in store in terms of lookbook.</li>\r\n</ol>\r\n\r\n<ol>\r\n</ol>\r\n\r\n<p><strong>Announcements</strong></p>\r\n\r\n<p>Store managers can now view announcements across the organization or store irrespective of the user roles.&nbsp;</p>\r\n\r\n<h5><a name=\"text-message-communication\" id=\"text-message-communication\"></a><strong>Text Message Communication</strong></h5>\r\n\r\n<p>Engaging with customer&nbsp;has helped the retailers to get more traffic to store by providing good support to customer queries and providing over all better store experience. Retailer can now with the consent of the customer can have a two-way communication via text messaging.&nbsp; Via the Opt-In/Opt-Out features, our solution follows&nbsp;CTIA&nbsp;(Cellular Telecommunications Industry Association) wireless industry standards for ensuring that the recipients of your text messages (your recipients) have expressly consented or &ldquo;opted-in&rdquo; to receiving text messages.&nbsp;</p>\r\n\r\n<p>Our Base solution features integration to&nbsp;Twilio as text message solution provider.&nbsp; &nbsp;The APIs can be extended/customized to support integration to another&nbsp;text messaging solution in theory.</p>\r\n\r\n<p>With two-way text message communication, user can now:</p>\r\n\r\n<ol>\r\n\t<li>Send&nbsp; simple text or&nbsp;text with image attached to the customer</li>\r\n\t<li>Configure messaging template based on the business needs and to adhere to industry standards - for example, create a standard boilerplate postscript to append to each outgoing text&nbsp;</li>\r\n\t<li>Receive text messaging from the customers.</li>\r\n\t<li>Send promotional text based on configurations and extensions.</li>\r\n</ol>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 29590,
  "scraped_at": "2025-08-09T21:52:51.159203",
  "content_clean": "Home››Release Notes››Manhattan Active® Omni››2019 ››Release 19.4 Manhattan Active™ Omni Release Notes 19.4 Release Date: 9.20.2019 Order ManagementFlexible Payment InvoicingSupport for Triggering Creation of Invoice on Shipment of Last Merge LegSupport for Triggering Creation of Invoice on Picked or Packed Fulfillment StatusSite to Store Order Capacity ControlAbility to Enable Location Capacity Utilization Update Inventory Audit - Ability to Persist Additional Inventory AttributesDigital Self-Service – View/Print Return Label Order TimelineStore & Inventory FulfillmentStore-Initiated TransfersiOS SupportDisplay Task GroupReceiving EnhancementsRequire Customer ID VerificationShipping Document ReprintPoint of SaleInteractionsEmail Communication Store-wide Activity ViewText Message Communication Order Management Flexible Payment Invoicing Currently for charging the customer through payment settlement, Invoice is created only once the order is finally fulfilled or delivered to the customer. Retailers may want to trigger Invoice generation for order statuses other than fulfilled or delivered so that they can charge the customer before it is delivered. For example, in case of export orders, retailers will want to charge the customer as soon as the inventory is shipped to the DC or store from where the final delivery leg is executed. For pick-up at store orders, retailers want to charge the customer when the items are Picked by the store associate and before the customers picks it up to avoid a no-show. Support for Triggering Creation of Invoice on Shipment of Last Merge Leg Configurations are provided for triggering creation of invoice for Ship to Store and Ship to Address - merge order lines, when quantities are shipped for the last merge leg, before the pickup leg or the delivery leg so that creation of invoice can be triggered when quantities are shipped to the store and before the customer picks it up for Ship to Store Lines or when quantities are shipped to the distribution center or store and before it is finally shipped to the customer for Ship to Address Lines. On short cancellation of quantities in the subsequent pickup leg or delivery leg after invoice is created resulting in a refund scenario, creation of adjustment invoice will be triggered for the canceled quantities. Note: For the ship to store delivery method, if shipment of last merge leg is configured, triggering creation of invoice cannot be configured for any other fulfillment statuses. Support for Triggering Creation of Invoice on Picked or Packed Fulfillment Status Create Invoice on configurations on Order Configuration screen, Payment container has been enhanced to include Picked fulfillment status in addition to currently available Fulfilled and Delivered statuses for Pick Up at Store delivery method. Similarly, Packed fulfillment status is available in addition to Fulfilled and Delivered statuses for Store Sales, Ship to Store, Ship to Address and Email delivery methods. For example, invoice can be generated for Picked fulfillment statuses for Pickup at Store orders as soon as items are picked. Similarly, invoice can be generated for Packed fulfillment statuses for Ship to Store orders as soon as items are Packed in the store and before it is delivered to customers. On short cancellation of quantities after invoice is created in the subsequent fulfillment statuses resulting in a refund scenario, creation of adjustment invoice will be triggered for the canceled quantities. Note: For Ship to Address delivery method, if Shipment of last merge leg is configured the Packed fulfillment status cannot be selected for triggering creation of invoice. Note: Flexible Payment Invoicing configurations profoundly hinge on the assumption that the odds of reallocation for already invoiced quantities to another fulfillment source due to short reallocation in subsequent legs is not anticipated. If short reallocation in subsequent legs results in already invoiced quantities being reallocated to DC or Store other than what was recorded in the existing Invoice, the existing invoice will not be modified to reflect this change which means there will be inconsistency between invoice details and physical reality in respect to the below mentioned details.  Package Id's mentioned on the Invoice and package Id’s delivered to customer. Jurisdiction and invoice tax in case of source-based taxation. Physical origin Id on the invoice and physical origin Id of actual shipment (hence it is not advisable to use invoice published in sales posting to account for inventory in downstream systems). Any custom attribute/s on invoice populated when invoice is generated (for example, item serial numbers, gift card numbers, etc.). Site to Store Order Capacity Control When a Site to Store order is received at a store for pickup, the store associate has minimal work to make the shipment ready for customer pickup. As a result, some retailers would prefer that these orders do not consume capacity that is also used for store picking and packing. A new configuration is available to prevent Site to Store orders from consuming store capacity. Ability to Enable Location Capacity Utilization Update If a view is enabled to exclude locations at full capacity, location is capped for a certain number of orders/units per shift/day. Once a location reaches its max capacity, the location is marked as \"Capacity Full\" and inventory at that location is removed from the view. As a result, no additional orders are allocated to that location. When a new shift/day starts, a batch job resets the capacity utilization details, and will carry forward pending backlog (if any) marking location as \"Capacity Full\" false which brings the location back in view. As part of this release, configuration is provided to reduce capacity utilization based on a configurable status. For example, capacity can be reduced when Ship to Address orders are packed. This enables the store to process more orders than defined in maximum capacity per shift. The goal here is that if a store is defined to process 10 orders per day and they finish by 9:00 am, enable that store to receive more orders and continue to expose that stores inventory online. In addition, this allows the store to be configured to ensure they never have more than a certain number of orders in the queue (capacity utilization), while still reducing the queue of work based on completing an order. A new flag in inventory parameters, \"ReduceUtilizedCapacity\" is added. Once it's enabled, utilized capacity of a location will keep on reducing, as and when orders reach the status configured in order parameter - \"Release Location Capacity when the PickUp or ShipToAddress order is in Pick/Pack/Ship status\". If a location still reaches its maximum capacity, it will be marked as Capacity Full – True. As the store processes more orders, the store will not be immediately marked as \"Capacity Full\" false. There will be a delay of 60 minutes after which location will be evaluated and marked as \"Capacity Full\" false. This will bring location back in View. If this feature is enabled, utilized capacity details captured in TotalCapacityUtilized will keep on reducing as and when orders are processed. To capture information about how much operational capacity is consumed for a location, a new attribute TotalCapacityConsumed is introduced in capacity utilization details. Fulfillment Capacity Utilization report in Fulfillment Analytics will refer to consumed capacity to show operational utilization. Note: Delay to include Location back in View is configurable in inventory parameter (Minimum value can be 60 minutes). Inventory Audit - Ability to Persist Additional Inventory Attributes To provide supply information to Manhattan Active Omni, a list of transaction types is supported such as Adjustment, Movement, Receipt, etc. All inventory actions/activity that take place in the external systems are mapped to one of these supported transaction types. For instance, \"Cycle count\" is mapped to Adjustment, \"Returned in Store\" will also be mapped to Adjustment. As a part of this release, in addition to current auditing feature, retailers can also capture the actions or original activity taken place in the external system which resulted in the change to the supply record. Inventory supply can persist two additional attributes whose values will be audited in Inventory audit details. If Audit functionality is enabled for Supply, system will start auditing any updates to these new attributes - InventoryTransactionType and InventoryTransactionId. This allows for example the Host to differentiate between a Cycle Count vs Return to Store.  To differentiate the internally generated adjustments created as a result of the Inventory Sync from other Adjustments sent directly to the supply event, Inventory Sync adjustments will have InventoryTransactionType as \"InboundSync\" and InventoryTransactionId with transaction number (existing attribute in sync event). There is no UI for retrieving audit records. Rest API - /inventory/api/audit/entity/supply?format=V2 needs to be executed to see audit trails. More details for this API are present in Inventory Process Guide. Note: System doesn't audit for Supply inserts, so any new supply creation is not audited. Digital Self-Service – View/Print Return Label Starting this release, customers initiating a return via the Digital Self-Service web portal (DSS) can view and print the Return Label from their devices. We have added a new button on return confirmation screen as part of the ‘create return’ flow of Digital Self-Service, clicking which would open the return label. The customer can then use the browser functionalities to save / print the return label. In case the system fails to generate/fetch the return label, then an appropriate error message is displayed to the customer so that they can reach out to the retailer’s contact center in order to proceed with the next steps. Order Timeline Customer Service Representatives (CSRs) using a purpose-built screen within the Contact Center UI can now understand the list of events that has occurred on an order which would help them respond to customer queries more effectively. This feature captures the relevant events required by the CSRs as part of the order lifecycle initiated by both user and system and displays them in a chronological order. This includes basic fulfillment events such as, allocation and release. Order updates such as quantity updates, address changes, appeasements and price overrides, and these events are represented in a user-friendly view. Store & Inventory Fulfillment Store-Initiated Transfers Manhattan Active Store now allows stores to initiate inventory transfers to another location in order for the store to quickly respond to adhoc transfer requests. For example, if a district manager sees that one store in the region has a low inventory level for a popular promotional item while another store has a much higher inventory level, the store with excess inventory can now create a store-initiated transfer to replenish the other store . Store-initiated transfers allow stores to be self-sufficient by directly creating transfer orders without the need for the corporate office to manage and initiate the process.  Once the shipping store is notified of the request (i.e., through in person, phone, e-mail, spreadsheet, etc.) a store associate can transfer inventory. Transfer order creation - A transfer order can be created in seconds. The associate selects the receiving location as well as the carrier and service level. Any location within the store's organization can be selected. For shipping, both parcel and non-parcel carriers are supported. Picking - Picking is performed offline based on inventory request to the other location. Packing - Once the order is created, associates can immediately begin scanning items and packing into package(s.) As each package is finished, the corresponding shipping documents are printed. The system allows different associates to pack a particular transfer order at different periods of time, if needed. Inventory Updates: Once the packages are shipped, inventory gets reduced from the origin location and in-transit record gets created for the destination location. Close order - Once all package(s) are packed, the associate closes the order. In the event that the packing should be undone, a cancel packing option is also available. iOS Support Support for the iPod Touch 7th Generation has been added. For a full list of supported devices, please check the Supported Technology page. Display Task Group Task Group is now displayed on the Task Monitoring UI. This gives the store manager additional information when a partially completed picklist needs to be reassigned to another associate. Receiving Enhancements The ability for store associates to receive an unknown package (by order) and receive a wrong store package are now based on user permissions. A store associate can only perform these receiving functions if they have the corresponding permission. ASN Verification now automatically occurs when the last package is received for a fulfillment, eliminating the need to wait until the job scheduler runs to perform the verification. For scenarios when a package is shipped and received at the wrong store, the inventory updates between the intended versus actual store now occur sooner since they are triggered during the ASN verification process. This applies to receipt type item or package. The job scheduler continues to handle verification for any ASNs with missing packages. Require Customer ID Verification Configuration now controls whether customer ID verification is required for confirm pickups. Customer verification continues to be optional unless this configuration is enabled. Shipping Document Reprint Shipping documents (labels and collate) can be reprinted from Manhattan Active SOF for up to 30 days from the date of creation. Shipping documents older than 30 days will be deleted as part of environment maintenance. Point of Sale Interactions Today's retailer must create a more personalized experience for their customers in order to be competitive as Gen Z shoppers (over 70 million in the US) create higher demands. This is nowhere more evident than in the store, since research data shows that Gen Z shoppers (along with Gen X and Millennials) are frequenting stores in high numbers. One of the novel ways to deliver a higher level of engagement with these customers is to support two-way communication between the brick and mortar channel (stores) and customers. With Interactions, not only can a store associate initiate a customer communication, but they can also send relevant product content and can view and reply to certain types of inbound communications from their customers. Here is a list of new two-way interaction types supported in the 19.4 release of Point of Sale and Store Customer Engagement. Email: Single/multiple item emails; Lookbooks; General; Appointments - when integrated with a third party ESP, inbound emails are visible to users, and they can respond to the customer. Text Messages - can be initiated by the store associate, or the associate can respond to an inbound message from a known customer. Today, the outbound text is sent from a common, store account. Chat (viewable only). Currently, outbound chat is only supported by with the Contact Center application and Customer Engagement to ensure that a chat representative is always available. Social Media (viewable only). Currently this data exists when a retailer owns Customer Engagement and has integrated Social Media feeds directly with a Social Media platform, like Facebook or Twitter. Virtual Assistant (viewable only). Currently these interactions occur between the customer and the direct channel Customer Support Representative, in the Manhattan Active Contact Center Application with Customer Engagement. Inbound queries can be received through a Twilio-integrated feed from Amazon Alexa. In-store Pickups (viewable only) When looking at interactions within a customer record, the user can view all interactions for that customer, regardless of the location in which the interaction occurred, or is with.  This includes interactions not just with other store locations, but also contact center or website chat bots. When looking at interactions within the store-wide view of interactions, users will be able to view all interactions for the specific location from which they are logged into the application. We have included the framework and facility to collect and enforce Opt-In or Opt-Out criteria for each customer and channel type (text, phone, email) to ensure compliance with privacy requirements in various jurisdictions. Email Communication Two-way communication now makes the overall experience of the store more interactive. Retailers can share number of details with the customer over the email now. Receipt email continues to be part of the remaining list without any modifications on the template or the way it is triggered. Retailers have the below email options to communicate with the customer. Single/Multiple Item Email -  This is an enhancement on the existing item details email which is used to send details of a single item over an email. This email type now enables the retailers to share the details of single or multiple item over the email. The item details are shared as embedded image in the email body thus there is no limit to the number of items details that can be shared over the mail. LookBook Email - Lookbook created by the retailers can be shared over the emails in the specific templates. General Email - This is a new type of the email that is introduced to provide the retailers to share ad hoc information over the mail. Retailers can share details to the customer which is different than the usual transactional emails. These emails can be used to provide information such as - new arrivals at the store, or if there is any order which can be picked from the store etc. Appointment Email - Retailers earlier had the ability to create the appointment for the customers at the store. Now, these appointment details can also be shared over the email. These emails will include details like the store location, start and end date and time of the appointment. Each of these emails have specific templates attached to them. These templates contain the format specific to each type of the email and are configurable. Retailers can modify them as per their requirements. Store-wide Activity View Store users will now have the ability to view Announcements, Lookbooks, Appointments, and Tasks across the store.  Previously these features were limited to the specific user - for example, a Store Manager could not see a Task created by a Store Associate. This store-wide view is protected by grants - retailers can choose to extend this ability only to the Store Manager role, for example. This enhancement provides users (with permissions) with visibility across activities in the store to allow them to take appropriate and necessary corrective actions. Appointments Providing access to view the appointments across the store for a givien day or the calendar month enhances to track the proceedings in the store. This data can be leveraged to track productivity of the store associates, and also corrective actions during absence of any associates for an appointment. With the access to this data store managers or users can: View appointments across the store created and maintained by all users in the store. Edit appointments created by other users during their absence. Delete or cancel appointments which needs corrective actions. Note: Appointments now have new statuses added to base seed data (i.e. Created, Accepted, Tentative, Declined, Cancelled)  to support two-way communication with customers. Tasks Providing access to tasks across all users in the store, add more transparency and enable store managers to make more informed decisions. These decisions help to track efficiency of the store associates, and also help increase their productivity. This enables the store managers to: View the tasks for a given day or the calendar month created by users across the store. It's a read only access, store managers cannot edit/delete the tasks created by other users. Store manager can still create, edit or delete their own tasks. Lookbooks Managing retail data can be a challenge, primarily because the industry is largely built on a revolving door of short-term employees who don’t often move beyond entry-level positions. Learning how to effectively manage these data when they are constantly in a state of flux can be difficult. Providing data transparency gives access to all lookbooks created in that store across users. The store managers can now make access and make effective decisions over this data and re-use data when necessary. This enables the store managers to: View the lookbooks created by all users in the store. It's a read only access, but store managers can still access other lookbooks and make a copy if it can be re-used. Store manager can still create, edit or delete their own lookbooks. This data access will also provide the ability to track productivity of each users in store in terms of lookbook. Announcements Store managers can now view announcements across the organization or store irrespective of the user roles. Text Message Communication Engaging with customer has helped the retailers to get more traffic to store by providing good support to customer queries and providing over all better store experience. Retailer can now with the consent of the customer can have a two-way communication via text messaging.  Via the Opt-In/Opt-Out features, our solution follows CTIA (Cellular Telecommunications Industry Association) wireless industry standards for ensuring that the recipients of your text messages (your recipients) have expressly consented or “opted-in” to receiving text messages. Our Base solution features integration to Twilio as text message solution provider.   The APIs can be extended/customized to support integration to another text messaging solution in theory. With two-way text message communication, user can now: Send  simple text or text with image attached to the customer Configure messaging template based on the business needs and to adhere to industry standards - for example, create a standard boilerplate postscript to append to each outgoing text Receive text messaging from the customers. Send promotional text based on configurations and extensions."
}