{
  "success": true,
  "permalink": "release-notes-182",
  "title": "Release 18.2",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a hqid=\"1788908\" href=\"/home\" class=\"breadcrumb-links\">Home</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158392\" href=\"/release-notes-2\" class=\"breadcrumb-links\">Release Notes</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3501148\" href=\"/manhattan-active-omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2411194\" href=\"/2018\" class=\"breadcrumb-links\">2018</a></li><li> <span>››</span>Release 18.2</li></ul>  \t\r\n\t\t<h2>Manhattan Active&trade; Omni Release Notes (18.2)</h2>\n\n<p>Release Date: 3.23.2018<br />\n&nbsp;</p>\n\n<ul><li><a href=\"/release-notes-182$order-management\">Order Management</a><ul><li><a href=\"/release-notes-182$distribution-center-capacity-management\">Distribution Center Capacity Management</a></li><li><a href=\"/release-notes-182$order-prioritization-and-reallocation\">Order Prioritization and Reallocation</a></li><li><a href=\"/release-notes-182$wmi-integration\">WMi Integration</a></li><li><a href=\"/release-notes-182$refund-shipping-and-handling-charges\">Refund Shipping and Handling Charges</a></li><li><a href=\"/release-notes-182$call-center-delivery-tracking\">Call Center Delivery Tracking</a></li><li><a href=\"/release-notes-182$promotions-and-discounts\">Promotions and Discounts</a></li></ul></li><li><a href=\"/release-notes-182$store-inventory-amp-fulfillment\">Store Inventory &amp; Fulfillment</a><ul><li><a href=\"/release-notes-182$inventory-adjustments\">Inventory Adjustments</a></li><li><a href=\"/release-notes-182$inventory-audit\">Inventory Audit</a></li><li><a href=\"/release-notes-182$item-identification-before-editing-quantity\">Item Identification Before Editing Quantity</a></li></ul></li><li><a href=\"/release-notes-182$point-of-sale\">Point of Sale</a><ul><li><a href=\"/release-notes-182$resilient-cloud-for-pos\">Resilient Cloud for POS</a></li><li><a href=\"/release-notes-182$automated-device-configuration-and-registration\">Automated Device Configuration and Registration</a></li><li><a href=\"/release-notes-182$customer-based-promotional-deal-qualifiers\">Customer-based Promotional Deal Qualifiers</a></li></ul></li></ul>\n<p>&nbsp;</p>\n\n<h4><a name=\"order-management\" id=\"order-management\"></a>Order Management</h4>\n\n<h5><a name=\"distribution-center-capacity-management\" id=\"distribution-center-capacity-management\"></a><strong>Distribution Center Capacity Management</strong></h5>\n\n<p>This feature provides the ability to configure Manhattan&nbsp;Active&trade; Omni to management and&nbsp;track capacity utilization for high-volume locations, such as Distribution Centers (DC). Prior to this enhancement, DCs were considered to have infinite capacity. In certain situations, this may result in an imbalance of workload between some DCs and a backlog at other DCs. This architecturally advanced tracking can be turned on at the location level for any high volume fulfillment locations, including DCs.</p>\n\n<h5><a name=\"order-prioritization-and-reallocation\" id=\"order-prioritization-and-reallocation\"></a><strong>Order Prioritization and Reallocation</strong></h5>\n\n<p>A new job scheduler has been provided to enable batch allocation and reallocation. This job scheduler is query-based and provides flexibility to select orders based on order and order line attributes, and leverages order prioritization functionality when allocating or reallocating a group of orders. Batch Allocation and Reallocation can be used to prioritize the allocation of orders.</p>\n\n<p>For example:</p>\n\n<ul>\n\t<li>Replenishment Orders by Priority</li>\n\t<li>B2B/Wholesale Orders by Customer and Requested Delivery Date</li>\n\t<li>Direct to Consumer Orders over other Order Types</li>\n\t<li>Based on Latest Ship Date / Requested Delivery Date vs First In First Out</li>\n\t<li>Unallocated and/ or Backorders</li>\n\t<li>Orders allocated against future inventory</li>\n</ul>\n\n<h5><a name=\"wmi-integration\" id=\"wmi-integration\"></a><strong>WMi Integration</strong></h5>\n\n<p>In order to provide a seamless integration between the Manhattan suite of products, we provide an out of the box MIF (Manhattan Integration Framework) adapter to enable a WMS and Manhattan Active&nbsp;Omni solution. As second part of that series,&nbsp;the WMi&nbsp;v2018&nbsp;and a Manhattan&nbsp;Active Omni Integration is also provided. MIF v2017 was expanded to understand the JSON structure and to communicate with SQS (Amazon Simple Queue Service). MIF also holds all the transformations that are required to convert the message formats and contents that each of the products can understand. The scope of the integration includes all the standard master data, order and inventory flow between the products.</p>\n\n<h5><a name=\"refund-shipping-and-handling-charges\" id=\"refund-shipping-and-handling-charges\"></a><strong>Refund Shipping and Handling Charges</strong></h5>\n\n<p>The business can now choose not to refund the S&amp;H charges to their customers when the product is returned. When chosen not to refund the S&amp;H, the discounts and taxes against the S&amp;H charges are also not refunded. This new configuration is available at the order type level through the order configuration UI. When this configuration is not enabled, the default behavior of refunding the S&amp;H charges during return continues.</p>\n\n<h5><a name=\"call-center-delivery-tracking\" id=\"call-center-delivery-tracking\"></a><strong>Call Center Delivery Tracking</strong></h5>\n\n<p>We have added ability to display the latest carrier delivery tracking information for shipped items right within our call center UI screens without navigating to a carrier site. This has been accomplished by providing out of the box integration with FedEx, UPS, and USPS carriers. Call Center CSRs can now view the up-to-date delivery tracking status and location for each shipped package from the Order Status UI screens, and relay this information to the customer.</p>\n\n<h5><a name=\"promotions-and-discounts\" id=\"promotions-and-discounts\"></a><strong>Promotions and Discounts</strong></h5>\n\n<p>The Call Center module is now integrated with the native Manhattan Active&trade; Omni Promotions engine to calculate and apply promotions. The integration provides support for flat rate, percent off, BOGO, and BXGY discounts. A 3rd&nbsp;party promotions engine can also be invoked from the Call Center module to apply promotions automatically. Additionally, Call Center UI has been enhanced to allow CSRs to have the ability to apply, remove, and view coupons using via integration with a third party coupons engine.</p>\n\n<p>&nbsp;</p>\n\n<h4><a name=\"store-inventory-amp-fulfillment\" id=\"store-inventory-amp-fulfillment\"></a>Store Inventory &amp; Fulfillment</h4>\n\n<h5><a name=\"inventory-adjustments\" id=\"inventory-adjustments\"></a><strong>Inventory Adjustments</strong></h5>\n\n<p>The adjust&nbsp;inventory feature enables store associates and managers to accurately maintain perpetual inventory and improve accuracy. Manual inventory adjustments allow&nbsp;the associates to apply configuration based adjustment types to store inventory,&nbsp;such as&nbsp;&quot;mark as defective&quot;, &quot;dispose&quot; and &quot;correct on hand&quot;. Adjustment types are&nbsp;configurable. The creation of adjustment types includes defining whether the adjustment is&nbsp;an&nbsp;increase,&nbsp;decrease, or movement of inventory&nbsp;from one disposition to another.</p>\n\n<p>When performing an adjustment,&nbsp;the user can specify comments and a reason for the adjustment to&nbsp;explain&nbsp;the need for&nbsp;manual adjustment.&nbsp;Adjustment reasons can be defined and associated with the adjustment types. Adjustment types are permission based. For&nbsp;example, a store associate&nbsp;may have permission to mark inventory as defective, while a store manager&nbsp;has permission to dispose of the inventory that is marked as defective.&nbsp;</p>\n\n<p>The number of units that can be adjusted in a single adjustment is configuration based.</p>\n\n<h5><a name=\"inventory-audit\" id=\"inventory-audit\"></a><strong>Inventory Audit</strong></h5>\n\n<p>Inventory audit&nbsp;functionality provides a historical audit trail of all inventory adjustments performed. For each transaction, users can see the reason for the inventory adjustments such as&nbsp;quality mismatch or losses/damages.&nbsp;Inventory audit information&nbsp;is logged when items are received, or when inventory is manually adjusted by a store user. Auditing can be enabled or disabled based on configuration.&nbsp; Users can search the inventory audit information by:</p>\n\n<ul>\n\t<li>Item</li>\n\t<li>Type of transaction (i.e. Receipt, Manual Adjustment)</li>\n\t<li>Type of adjustment (i.e. Residue Receipt, Sellable Stock etc.)</li>\n\t<li>Time period of the transactions</li>\n</ul>\n\n<p>&nbsp;<span style=\"font-size: 10.5pt; font-family: Arial, sans-serif;\">Inventory audit information can be accessed from a new menu option and from an option&nbsp;in view inventory.</span></p>\n\n<h5><a name=\"item-identification-before-editing-quantity\" id=\"item-identification-before-editing-quantity\"></a><strong>Item Identification Before Editing Quantity</strong></h5>\n\n<p>Item level configuration exists to indicate whether or not scanning item is required while picking, packing and receiving. When item scanning is not required for an item, the associate can manually enter the quantity picked, packed &amp; received.</p>\n\n<p>Profile level configuration is now available to enforce that the first item is scanned when picking multiple units and item level scanning is not required. The scan&nbsp;ensures&nbsp;the associate has the correct item, while manually editing the quantity eliminates the need to scan multiple units of the same SKU.</p>\n\n<p>&nbsp;</p>\n\n<h4><a name=\"point-of-sale\" id=\"point-of-sale\"></a>Point of Sale</h4>\n\n<h5><a name=\"resilient-cloud-for-pos\" id=\"resilient-cloud-for-pos\"></a><strong>Resilient Cloud for POS</strong></h5>\n\n<p>Cloud-native applications rely upon continuous&nbsp;connectivity for persistent operations and in default mode, Point of Sale and Back Office require the same. This is inherent in the Active Omni architecture and applies to all hosted components located outside the store, with secure communication over the web.&nbsp;Consequently, store networks should be resilient and provide secondary and tertiary network paths in the event of a connectivity failure for the primary service link.&nbsp; In default Active Omni service mode, a device which loses connectivity to the Cloud will not be able to complete sales or other simple transactions as it will be unable to contact Item, Order, Payment, and other required components.&nbsp; Similarly, no devices will be able to perform Back Office functions such as Open Till without connectivity to the Back Office Component.&nbsp;</p>\n\n<p>With our Resilient Cloud POS&nbsp;implementation, Active Omni now features&nbsp;a Store&nbsp;Off-Cloud mode for our the Manhattan Active POS application. In Resilient mode, standard in-store transaction operations may continue. The Resilient&nbsp;mode may be entered by an authorized person at store level using a secure PIN. While the POS application is operating in&nbsp;resilient&nbsp;off-line mode, cashiers, associates and managers will be able to continue POS processing with standard&nbsp;functions&nbsp;such as Sales, Returns-without-Receipt,&nbsp;and the Till Open procedure.&nbsp; This functionality will be more limited than full Active features available with Cloud connectivity, but is designed to allow the store to continue to operate using a local subset of all Active data and&nbsp;configurations, and to record and store required transactional data locally until connectivity is re-established.&nbsp;&nbsp;</p>\n\n<h5><a name=\"automated-device-configuration-and-registration\" id=\"automated-device-configuration-and-registration\"></a><strong>Automated Device Configuration and Registration</strong></h5>\n\n<p>To facilitate chain-wide rollouts and new store openings for our&nbsp;chainstore&nbsp;customers, we now offer&nbsp;a set of simplified device pre-configuration and registration features to reduce time and effort for the setup of stores installing the Manhattan Active&trade; POS application.&nbsp;This&nbsp;preconfiguration&nbsp;and registration process is controlled by both a Feature Flag, as well as a Business Configuration.&nbsp;Prior&nbsp;to this new feature, the configurations process was managed on a device-by-device basis. A new pre-configuration set up has been added to Manhattan Active Omni&nbsp;Master Configuration under POS, where stores may be selected from within their groups as&nbsp;determined&nbsp;by the schema established in the Manhattan Active Omni organization&nbsp;set up by the retailer.&nbsp;&nbsp;The device-level UI has been extended to provide easy to use settings to support the device registration and activation process at store level. The device registration process uses cloud service communication to&nbsp;ensure&nbsp;that&nbsp;register numbers and devices are validated and mapped in the organization database for&nbsp;each selected store.</p>\n\n<ul>\n\t<li>More user-friendly device management</li>\n\t<li>Individual uploads for Printers, Cash Drawers, Registers and Payment Terminals</li>\n\t<li>Ability to auto or manually assign Register numbers, as well as assign peripherals or add them later</li>\n\t<li>Flexibility to associate or disassociate a device from a Registered number or Store</li>\n\t<li>Faster store installation from pre-staged &quot;Store-in-a-Box&quot; in rapid rollout deployments</li>\n\t<li>Easier new store opening process</li>\n</ul>\n\n<h5><a name=\"customer-based-promotional-deal-qualifiers\" id=\"customer-based-promotional-deal-qualifiers\"></a><strong>Customer-based Promotional Deal Qualifiers</strong></h5>\n\n<p>With this new&nbsp;enhancement&nbsp;to the Active Omni Promotions engine, Retailers can now target promotions to specific retail customers based on the Customer Loyalty Status attribute in the Active Omni Customer Component. For example, only GOLD customers might be eligible for a certain deal.&nbsp;&nbsp;</p>\n\n<p>In addition, the Master Configuration UI allows customer-based qualifiers to be established and configured as the&nbsp;order level qualifier &quot;Customer Type&quot; for any one of the three types of deals we feature: Combo-Item, Combo-Order, or Single-Item.&nbsp;The type is chosen from a static table&nbsp;picklist&nbsp;which can be populated by the retailer with their own unique customer loyalty levels.</p>\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 14766,
  "scraped_at": "2025-08-09T22:47:33.563942"
}