{
  "id": "2158823",
  "permalink": "release-notes-19.1",
  "title": "Release 19.1",
  "type": "topic",
  "level": 4,
  "path": "Home/Release Notes/Manhattan Active® Omni/2019/Release 19.1",
  "raw_item": {
    "id": "2158823",
    "text": "Release 19.1",
    "title": "Release 19.1",
    "permalink": "release-notes-19.1",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "240618",
    "parent": "f;240618",
    "created_date": "1545405648",
    "modified_date": "1545427783",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": 99999
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a hqid=\"1788908\" href=\"/home\" class=\"breadcrumb-links\">Home</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158392\" href=\"/release-notes-2\" class=\"breadcrumb-links\">Release Notes</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3501148\" href=\"/manhattan-active-omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2411193\" href=\"/2019\" class=\"breadcrumb-links\">2019</a></li><li> <span>››</span>Release 19.1</li></ul>  \t\r\n\t\t<h2>Manhattan Active&trade; Omni Release Notes&nbsp;19.1</h2>\n\n<p>Release Date: 1.4.2019<br />\n&nbsp;</p>\n\n<ul><li><a href=\"/release-notes-19.1$order-management\">Order Management</a><ul><li><a href=\"/release-notes-19.1$substitution\">Substitution</a></li><li><a href=\"/release-notes-19.1$large-order\">Large Order</a></li><li><a href=\"/release-notes-19.1$digital-self-service\">Digital Self-Service</a></li></ul></li><li><a href=\"/release-notes-19.1$store-amp-inventory-fulfillment\">Store &amp; Inventory Fulfillment</a><ul><li><a href=\"/release-notes-19.1$visibility-into-completed-customer-pickups\">Visibility into Completed Customer Pickups</a></li><li><a href=\"/release-notes-19.1$customer-loyalty-status\">Customer Loyalty Status</a></li><li><a href=\"/release-notes-19.1$archive-purge-fulfillments\">Archive/Purge Fulfillments</a></li><li><a href=\"/release-notes-19.1$wmi-integration\">WMi Integration</a></li><li><a href=\"/release-notes-19.1$support-multiple-pullback-transfer-order-types\">Support Multiple Pullback/Transfer Order Types</a></li><li><a href=\"/release-notes-19.1$technical-updates\">Technical Updates</a></li></ul></li><li><a href=\"/release-notes-19.1$point-of-sale\">Point of Sale</a><ul><li><a href=\"/release-notes-19.1$time-clock\">Time Clock</a></li><li><a href=\"/release-notes-19.1$customer-engagement-in-stores\">Customer Engagement in Stores</a></li><li><a href=\"/release-notes-19.1$manager-functions-outside-of-cart\">Manager Functions Outside of Cart</a></li><li><a href=\"/release-notes-19.1$capture-manager-override-details-on-order-and-ej\">Capture Manager Override Details on Order and EJ</a></li><li><a href=\"/release-notes-19.1$interactive-customer-closet-lookbook\">Interactive Customer Closet (Lookbook)</a></li><li><a href=\"/release-notes-19.1$one-time-use-coupon-offer-number\">One-time Use Coupon (Offer Number)</a></li><li><a href=\"/release-notes-19.1$store-close-payment-reconciliation-and-order-cancellation\">Store Close - Payment Reconciliation and Order Cancellation</a></li></ul></li><li><a href=\"/release-notes-19.1$cloud-framework\">Cloud Framework</a><ul><li><a href=\"/release-notes-19.1$password-expiry\">Password Expiry</a></li><li><a href=\"/release-notes-19.1$configuration-director-nbsp-user-interface\">Configuration Director&nbsp;User Interface</a></li><li><a href=\"/release-notes-19.1$base-profile-for-seed-data\">Base Profile for Seed Data</a></li></ul></li></ul>\n<p>&nbsp;</p>\n\n<h4><a name=\"order-management\" id=\"order-management\"></a>Order Management</h4>\n\n<hr />\n<h5><a name=\"substitution\" id=\"substitution\"></a><strong style=\"font-style: inherit;\">Substitution</strong></h5>\n\n<p>With this release, business users can now define and manage item substitution rules. This enables the ability to configure when an alternate item can be used to fulfill an order. Substitution rules can be configured to:&nbsp;</p>\n\n<ul>\n\t<li>immediately substitute the ordered item with an alternate item;&nbsp;for example, when a vendor SKU changes.&nbsp;</li>\n\t<li>substitute the ordered item when inventory is not available.</li>\n</ul>\n\n<p>Included is the ability to conditionally apply substitution, such as&nbsp;when the order is shipping to Canada or the order line is a rental.</p>\n\n<p>Inventory messaging includes details about applicable substitute items in&nbsp;availability requests, alerts, and sync messages.</p>\n\n<p>Substitutions are enabled for 1:1 quantity ratios and 1:1 items.</p>\n\n<h5><a name=\"large-order\" id=\"large-order\"></a><strong>Large Order</strong></h5>\n\n<p>As part of this feature, Manhattan Active Omni supports Retail Orders with 5000 lines.</p>\n\n<div class=\"info\" style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px;\"><strong style=\"font-style: inherit;\">Note</strong>: There are no changes to Customer Order flow, which still supports 120 lines.</div>\n\n<h5><a name=\"digital-self-service\" id=\"digital-self-service\"></a><strong>Digital Self-Service</strong></h5>\n\n<p>As customers are increasingly looking to rely on technology instead of people, a self-service portal enables customers to complete tasks without the help of a human intermediary. In Manhattan&rsquo;s Digital Self-Service, customers can track shipments and create returns in a web-based portal. Here&rsquo;s how a customer can access the portal:</p>\n\n<ol>\n\t<li>The customer places an order.</li>\n\t<li>When the order ships, Active Omni generates a shipment confirmation email. The customer can select links in the email to either track their shipment or return items.</li>\n\t<li>When the links are clicked, the Digital Self-Service UI is launched in a web browser.</li>\n</ol>\n\n<p>Note that the 19.1 release supports:</p>\n\n<ul style=\"list-style-position: initial; list-style-image: initial;\">\n\t<li>Tracking packages on the Shipment Tracking feature</li>\n\t<li>Returning items by mail or in store in the Returns feature</li>\n\t<li>iPhones (Safari browser and mobile form factor)</li>\n\t<li>Branding the UI&nbsp;through CSS</li>\n\t<li>Sample email templates, which generate customer-facing emails directly from Active Omni for order confirmation and shipment confirmation</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<h4><a name=\"store-amp-inventory-fulfillment\" id=\"store-amp-inventory-fulfillment\"></a>Store &amp; Inventory Fulfillment</h4>\n\n<hr style=\"width: 700.833px;\" />\n<h5><a name=\"visibility-into-completed-customer-pickups\" id=\"visibility-into-completed-customer-pickups\"></a><strong>Visibility into Completed Customer Pickups</strong></h5>\n\n<p>Several changes are made to the Confirm Pickup screens to allow&nbsp;associates to better serve their customers. The default order&nbsp;list now contains only the&nbsp;orders which are eligible for pickup. In the event that a store associate&nbsp;needs to address a&nbsp;customer query&nbsp;regarding an open, previously picked or canceled order, they are&nbsp;still able to search across all&nbsp;orders. For orders which have already been picked up, associates are now provided with the pickup name (to support alternate contact pickups),&nbsp;pickup date/time,&nbsp;the&nbsp;store&nbsp;associate and the customer&#39;s signature. For canceled orders, the cancellation reason code&nbsp;is displayed. Lastly, at the time of pickup, associates are now able to select the contact who is picking up&nbsp;the order (customer or alternate contact.)</p>\n\n<h5><a name=\"customer-loyalty-status\" id=\"customer-loyalty-status\"></a><strong>Customer Loyalty Status</strong></h5>\n\n<p>To help store associates identify key customers, the Confirm Pickup order details page now displays the customer&#39;s loyalty status and member since information. These details are shown in Store Confirm Pickup user interfaced when the customer details are available in Active Omni.&nbsp;</p>\n\n<h5><a name=\"archive-purge-fulfillments\" id=\"archive-purge-fulfillments\"></a><strong>Archive/Purge Fulfillments</strong></h5>\n\n<p>Manhattan Active Store now provides the&nbsp;ability to archive or purge fulfillments&nbsp;in order to free up disk space. Shipped, picked up and cancelled&nbsp;fulfillments&nbsp;can be archived or purged based on a configured number of days. Archiving a fulfillment removes the data from the fulfillment entities, but retains a copy for searches in case of future inquiries. Purging removes the fulfillment data and does not retain it for future searching. Configuration determines whether to archive&nbsp;or purge. In addition to the fulfillment, related information including pick tasks,&nbsp;pack tasks,&nbsp;packages, and&nbsp;shipping documents&nbsp;are included.</p>\n\n<h5><a name=\"wmi-integration\" id=\"wmi-integration\"></a><b>WMi Integration</b></h5>\n\n<p>Manhattan Active Store is now integrated with WMI for Site to Store orders.&nbsp;This integration converts the WMi&nbsp;ship confirmation message into an Active Store fulfillment so that the Store application can process the fulfillment.</p>\n\n<h5><a name=\"support-multiple-pullback-transfer-order-types\" id=\"support-multiple-pullback-transfer-order-types\"></a><strong>Support Multiple Pullback/Transfer Order Types</strong></h5>\n\n<p>Retailers can now configure multiple order types for pullback&nbsp;or transfer orders based on their business need. For example, a&nbsp;retailer&nbsp;is now able to create a&nbsp;pullback order type exclusively for&nbsp;defective items to help store associates identify the purpose of the order.</p>\n\n<h5><a name=\"technical-updates\" id=\"technical-updates\"></a><strong>Technical Updates</strong></h5>\n\n<p>Manhattan Active Store now supports&nbsp;iOS&nbsp;12.&nbsp;</p>\n\n<p>Support for the iPod Touch 5th Generation has been deprecated.</p>\n\n<p>&nbsp;</p>\n\n<h4><a name=\"point-of-sale\" id=\"point-of-sale\"></a>Point of Sale</h4>\n\n<hr style=\"width: 700.833px;\" />\n<h5><a name=\"time-clock\" id=\"time-clock\"></a><strong>Time Clock</strong></h5>\n\n<p>Time clock feature provides retailers with an easy and effective way to track the employee&nbsp;working hours. As employees already use the store app to perform various store operations, it is convenient to be able to clock in and clock out using the same application. The application features can be accessed only after the employee clocks in to&nbsp;ensure accurate time tracking.</p>\n\n<ul style=\"list-style-position: initial; list-style-image: initial;\">\n\t<li>\n\t<p>Employees can clock in and clock out after login&nbsp;to the store application.</p>\n\t</li>\n\t<li>Retailers can choose to optionally track the break based on a configuration</li>\n\t<li>The time entries are published to outbound queue for external systems to consume&nbsp;</li>\n\t<li>Store Managers can force clock out the employees during store close based on a configuration.</li>\n\t<li>Certain employees like admin users, store managers can be exempt from time clock using an attribute at the user level.<br />\n\t&nbsp;</li>\n</ul>\n\n<h5><a name=\"customer-engagement-in-stores\" id=\"customer-engagement-in-stores\"></a><strong>Customer Engagement in Stores</strong></h5>\n\n<p>Customer Engagement provides retailers and their employees an enhanced view into their customers.&nbsp; Retailers can now use customer engagement to view information about the customer such as shipping and contact preferences, social media influence, open cases logged by the call center agents against an order, and social media influence. In the past, customer engagement has been used by call center agents to better serve the customers that call in to place orders or ask for information. With customer engagement in stores, retailers can now use some of this same information to provide a better in-store experience for their customers. Users can have a quick overview of the customer they are working with currently within the store, and they can also use the information to better prepare for an upcoming customer visit.</p>\n\n<p><strong>Customer Dashboard</strong>:</p>\n\n<p>The customer dashboard provides a high level look into the customer the user is working with.&nbsp; The dashboard can provide insights into the type of shopper the customer is, as well as some of their preferences with regard to their shopping habits.&nbsp;</p>\n\n<ul style=\"list-style-position: initial; list-style-image: initial;\">\n\t<li>The dashboard is configurable by the retailer</li>\n\t<li>When enabled, the user will land on the dashboard when viewing the customer record, or they can view it from anywhere in the POS application when a customer has been activated</li>\n</ul>\n\n<p><strong>Customer Sub-header</strong>:</p>\n\n<p>The customer sub-header provides additional information on the customer, such as total purchase and return values as well as social media influence.</p>\n\n<ul style=\"list-style-position: initial; list-style-image: initial;\">\n\t<li>The attributes shown within sub-header can be configured by the retailer<br />\n\t&nbsp;</li>\n</ul>\n\n<p><strong>Cases</strong>:</p>\n\n<p>Currently, cases are created by call center representatives for customer inquiries, complaints, and issues related to specific orders.&nbsp; Store personnel can use case details to potentially help resolve an issue with an order, or to have additional information regarding a past purchase.</p>\n\n<ul style=\"list-style-position: initial; list-style-image: initial;\">\n\t<li>If a customer has a case open against a previous purchase, then the user will be able to view the details by navigating to the past purchases tab within the customer record.&nbsp;</li>\n\t<li>Once a case is closed, it will no longer appear within the past purchases.<br />\n\t&nbsp;</li>\n</ul>\n\n<h5><a name=\"manager-functions-outside-of-cart\" id=\"manager-functions-outside-of-cart\"></a><strong>Manager Functions Outside of Cart</strong></h5>\n\n<p>Based on grants, users can now access manager functions outside of the cart.&nbsp; A new menu option will appear on the home screen as well as the hamburger navigation.&nbsp; Additionally, retailers can now configure the application to require a single associate be applied to the various manager functions.&nbsp; The applied associate will appear on the function overlay as well as on the receipt print out.</p>\n\n<h5><a name=\"capture-manager-override-details-on-order-and-ej\" id=\"capture-manager-override-details-on-order-and-ej\"></a><strong>Capture Manager Override Details on Order and EJ</strong></h5>\n\n<p>This feature provides the ability to persist manager override details when an action is performed through override action.&nbsp; This is information is also made available on Electronic Journal too.&nbsp; Key information that is captured based on this action is: Order ID, Order Line ID, Action performed using manager override, status, manager authorizing the action.&nbsp; This is captured in the following cases:</p>\n\n<ul style=\"list-style-position: initial; list-style-image: initial;\">\n\t<li>\n\t<p>Manager override completed successfully in Check only mode.</p>\n\t</li>\n\t<li>Manager override in check and forward mode.&nbsp; Both success and failed attempts.</li>\n\t<li>New features enabled with manager override make it to EJ automatically.<br />\n\t&nbsp;</li>\n</ul>\n\n<h5><a name=\"interactive-customer-closet-lookbook\" id=\"interactive-customer-closet-lookbook\"></a><strong>Interactive Customer Closet (Lookbook)</strong></h5>\n\n<p>More and more, retailers are working to create an enhanced experience when a customer shops with them.&nbsp; This leaves the customer with a feeling of value, therefore increasing the likelihood that they will not only continue to shop with the retailer, but will also recommend them to friends and family.&nbsp; Part of this experience involves engaging with the customers &nbsp;by creating lookbooks.&nbsp; A lookbook is part of a customizable shopping experience. These looks combine items that the customer has already purchased from the retailer, and combines them with new items to make a tailor-made look for the customer. Customers can use these looks to find favorite items, discover new items, and get inspired.</p>\n\n<p><strong>Creating a lookbook</strong>:</p>\n\n<p>Store users can create&nbsp;lookbook from user, customer screen or from global cart screen. To create a lookbook&nbsp;user can drag and drop items from the source&nbsp;to the specified positions in the target. Lookbook&nbsp;can have multiple pages with each page containing a max of 6 items, the items within the lookbook&nbsp;can be positioned within and across the pages.</p>\n\n<p>Lookbook&nbsp;can be created from below sources:</p>\n\n<ul style=\"list-style-position: initial; list-style-image: initial;\">\n\t<li>Catalog</li>\n\t<li>Workspace</li>\n\t<li>Past Purchase (Only when customer is active)</li>\n\t<li>Wishlist&nbsp;(Only when customer is active)<br />\n\t&nbsp;</li>\n</ul>\n\n<p><strong>Sharing lookbook&nbsp;with customer</strong>:</p>\n\n<p>During creating of a lookbook&nbsp;or once the it is are created, lookbooks can be shared to customers. User can choose&nbsp;to share&nbsp;lookbook&nbsp;just to customer profiles to start with&nbsp;and then share via email later or sharing it via email to customer directly. Both of these operations will create visibility of&nbsp;shared lookbook&nbsp;information on customer records.</p>\n\n<p><strong>Viewing/Update&nbsp;lookbook</strong>:</p>\n\n<p>Upon creation&nbsp;of the lookbook, user can view the lookbooks&nbsp;created by them from the user menu. From the same screen user can also view lookbooks&nbsp;created across the organization or&nbsp;public/shared lookbooks from corporate users,&nbsp;this is controlled using the filter operations.&nbsp;</p>\n\n<p><strong>Edit/Delete</strong>: User can choose to update the lookbooks&nbsp;from user or customer screens if this is not already shared to the customer via email. If shared, user can perform a copy using save as operation and update the copied lookbook.&nbsp;User can delete the lookbooks&nbsp;at any point in time from the&nbsp;user or customer screens.</p>\n\n<h5><a name=\"one-time-use-coupon-offer-number\" id=\"one-time-use-coupon-offer-number\"></a><strong>One-time Use Coupon (Offer Number)</strong></h5>\n\n<p>This feature allow the retailer to create deals with one time use coupons (internally termed as offer number). While creating a deal, user can choose the number of one-time use coupons&nbsp;that they want to generate as part of this deal. All these one-time use coupons generated will be attached back to this deal in the backend system. We have pretty complex algorithm in place for one-time use coupons generated to make sure are unique within a deal and across the deal which can be shared to the customers via mail/email or any mode of communication.&nbsp;</p>\n\n<p><strong>Configuring one-time coupon code generation pattern:</strong></p>\n\n<p>From the config&nbsp;ui, users can choose to&nbsp;length of offer number and the below patterns that they want to keep in the generated offer number.</p>\n\n<ul style=\"list-style-position: initial; list-style-image: initial;\">\n\t<li>Configure any&nbsp;static number/digits that they want to keep in&nbsp;one-time coupon.</li>\n\t<li>All one-time coupons created in a deal will be having constant four character, users can choose the starting position of these constants.</li>\n\t<li>User can also choose if they want to generate one-time coupons as numbers or alphabets or both in each position over the length of these coupons.</li>\n\t<li>Note that: Once any deal with offer numbers are created, configuration changes are not allowed.<br />\n\t&nbsp;</li>\n</ul>\n\n<p><strong>Export one-time use coupon</strong>:</p>\n\n<p>Retailer will be provide with an option to export generated one-time coupons from the config&nbsp;ui screen.&nbsp;Once the deal is created with one-time use coupons, user can go back to edit deal screen and download the data. This data will be download to the local machine which is a zip file, upon extract will get you one-time use coupons.</p>\n\n<p><strong>Using one-time use coupon</strong>:</p>\n\n<p>The one-time use coupons can be scanned or entered manually in the POS application same as that for regular coupons. Once successful&nbsp;scan, and if&nbsp;the&nbsp;one-time use coupons is valid and lifetime max redemption is not reached will be evaluated for a deal and added to the cart to provide the eligible promotion.</p>\n\n<h5><a name=\"store-close-payment-reconciliation-and-order-cancellation\" id=\"store-close-payment-reconciliation-and-order-cancellation\"></a><strong>Store Close - Payment Reconciliation and Order Cancellation</strong></h5>\n\n<p>This feature offers to reconcile the payment records between the gateway and payment component. If there are&nbsp; any transactions created in the gateway, but did not make it to the payment.&nbsp; The process creates / updates requisite payment transactions.&nbsp; Order cancellation cancels open orders and the payments, if any, in addition to open Back Office transactions.&nbsp; This insures all transactions created for the day are closed logically and downstream systems get the visibility to it.<br />\n&nbsp;</p>\n\n<h4><a name=\"cloud-framework\" id=\"cloud-framework\"></a>Cloud Framework</h4>\n\n<hr style=\"width: 700.833px;\" />\n<h5><a name=\"password-expiry\" id=\"password-expiry\"></a><b style=\"font-style: inherit; font-size: 15.75px;\">Password Expiry</b></h5>\n\n<p>Now passwords of natively-authenticated&nbsp;users expire&nbsp;after 90 days.</p>\n\n<h5><a name=\"configuration-director-nbsp-user-interface\" id=\"configuration-director-nbsp-user-interface\"></a><b style=\"font-style: inherit; font-size: 15.75px;\">Configuration Director</b><span style=\"font-style: inherit; font-size: 15.75px;\"><b style=\"font-style: inherit;\">&nbsp;User Interface</b></span></h5>\n\n<p>Following the Configuration Director APIs from last quarter, purpose-built UIs are now available for the Configuration Director tool &ndash; <em>Config Director</em>. Config Director can be used to move configuration data between environments.</p>\n\n<p>The Configuration Director UI enables the export, import, and comparison&nbsp;between configuration&nbsp;data and optionally master data of all or the selected components and provisioning profiles. Configuration Director also indicates the historical count of exports and imports. Further details of previous exports and imports can also be visually inspected. Configuration Director allows downloading exports and compares zip files for data transformations, which can be uploaded to S3 (or other cloud space) from the Configuration Director UI and later used for import and comparison.</p>\n\n<p style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; padding: 0px;\"><strong>Export</strong></p>\n\n<p style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; padding: 0px;\">Export is a function&nbsp;provided by Config Director that enables the user to export the config and optionally master data from an environment.</p>\n\n<p style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; padding: 0px;\"><strong>Import</strong></p>\n\n<p style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; padding: 0px;\">Import is a function&nbsp;provided by Config Director that enables the user to import an ExportId or a Diff (the result of a compare) in a target environment.</p>\n\n<p style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; padding: 0px;\"><strong>Compare</strong></p>\n\n<p style=\"margin-top: 0px; margin-right: 0px; margin-left: 0px; padding: 0px;\">Compare is a function&nbsp;provided by Config Director that enables comparison between two existing export Ids from the same or different environments.</p>\n\n<h5><a name=\"base-profile-for-seed-data\" id=\"base-profile-for-seed-data\"></a><strong style=\"font-style: inherit;\">Base Profile for Seed Data</strong></h5>\n\n<p><span style=\"font-family: &quot;Open Sans&quot;, arial, sans-serif;\">The base profile will store all the entities for which seed data is provided. Seed data is used for application startups to&nbsp;minimize required&nbsp;configuration before the application starts.</span><span style=\"font-family: arial, helvetica, sans-serif;\">&nbsp;This &quot;base&quot; profile cannot be used in any provisioning profile other than the profile belonging to System&nbsp;organization. Upgrades can be made to seed data without impacting active configurations because the seed data in Base profile is not used directly for the upgrade.</span></p>\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 23930,
  "scraped_at": "2025-08-09T21:52:46.732749",
  "content_clean": "Home››Release Notes››Manhattan Active® Omni››2019 ››Release 19.1 Manhattan Active™ Omni Release Notes 19.1 Release Date: 1.4.2019 Order ManagementSubstitutionLarge OrderDigital Self-ServiceStore & Inventory FulfillmentVisibility into Completed Customer PickupsCustomer Loyalty StatusArchive/Purge FulfillmentsWMi IntegrationSupport Multiple Pullback/Transfer Order TypesTechnical UpdatesPoint of SaleTime ClockCustomer Engagement in StoresManager Functions Outside of CartCapture Manager Override Details on Order and EJInteractive Customer Closet (Lookbook)One-time Use Coupon (Offer Number)Store Close - Payment Reconciliation and Order CancellationCloud FrameworkPassword ExpiryConfiguration Director User InterfaceBase Profile for Seed Data Order Management Substitution With this release, business users can now define and manage item substitution rules. This enables the ability to configure when an alternate item can be used to fulfill an order. Substitution rules can be configured to: immediately substitute the ordered item with an alternate item; for example, when a vendor SKU changes. substitute the ordered item when inventory is not available. Included is the ability to conditionally apply substitution, such as when the order is shipping to Canada or the order line is a rental. Inventory messaging includes details about applicable substitute items in availability requests, alerts, and sync messages. Substitutions are enabled for 1:1 quantity ratios and 1:1 items. Large Order As part of this feature, Manhattan Active Omni supports Retail Orders with 5000 lines. Note: There are no changes to Customer Order flow, which still supports 120 lines. Digital Self-Service As customers are increasingly looking to rely on technology instead of people, a self-service portal enables customers to complete tasks without the help of a human intermediary. In Manhattan’s Digital Self-Service, customers can track shipments and create returns in a web-based portal. Here’s how a customer can access the portal: The customer places an order. When the order ships, Active Omni generates a shipment confirmation email. The customer can select links in the email to either track their shipment or return items. When the links are clicked, the Digital Self-Service UI is launched in a web browser. Note that the 19.1 release supports: Tracking packages on the Shipment Tracking feature Returning items by mail or in store in the Returns feature iPhones (Safari browser and mobile form factor) Branding the UI through CSS Sample email templates, which generate customer-facing emails directly from Active Omni for order confirmation and shipment confirmation Store & Inventory Fulfillment Visibility into Completed Customer Pickups Several changes are made to the Confirm Pickup screens to allow associates to better serve their customers. The default order list now contains only the orders which are eligible for pickup. In the event that a store associate needs to address a customer query regarding an open, previously picked or canceled order, they are still able to search across all orders. For orders which have already been picked up, associates are now provided with the pickup name (to support alternate contact pickups), pickup date/time, the store associate and the customer's signature. For canceled orders, the cancellation reason code is displayed. Lastly, at the time of pickup, associates are now able to select the contact who is picking up the order (customer or alternate contact.) Customer Loyalty Status To help store associates identify key customers, the Confirm Pickup order details page now displays the customer's loyalty status and member since information. These details are shown in Store Confirm Pickup user interfaced when the customer details are available in Active Omni. Archive/Purge Fulfillments Manhattan Active Store now provides the ability to archive or purge fulfillments in order to free up disk space. Shipped, picked up and cancelled fulfillments can be archived or purged based on a configured number of days. Archiving a fulfillment removes the data from the fulfillment entities, but retains a copy for searches in case of future inquiries. Purging removes the fulfillment data and does not retain it for future searching. Configuration determines whether to archive or purge. In addition to the fulfillment, related information including pick tasks, pack tasks, packages, and shipping documents are included. WMi Integration Manhattan Active Store is now integrated with WMI for Site to Store orders. This integration converts the WMi ship confirmation message into an Active Store fulfillment so that the Store application can process the fulfillment. Support Multiple Pullback/Transfer Order Types Retailers can now configure multiple order types for pullback or transfer orders based on their business need. For example, a retailer is now able to create a pullback order type exclusively for defective items to help store associates identify the purpose of the order. Technical Updates Manhattan Active Store now supports iOS 12. Support for the iPod Touch 5th Generation has been deprecated. Point of Sale Time Clock Time clock feature provides retailers with an easy and effective way to track the employee working hours. As employees already use the store app to perform various store operations, it is convenient to be able to clock in and clock out using the same application. The application features can be accessed only after the employee clocks in to ensure accurate time tracking. Employees can clock in and clock out after login to the store application. Retailers can choose to optionally track the break based on a configuration The time entries are published to outbound queue for external systems to consume Store Managers can force clock out the employees during store close based on a configuration. Certain employees like admin users, store managers can be exempt from time clock using an attribute at the user level. Customer Engagement in Stores Customer Engagement provides retailers and their employees an enhanced view into their customers.  Retailers can now use customer engagement to view information about the customer such as shipping and contact preferences, social media influence, open cases logged by the call center agents against an order, and social media influence. In the past, customer engagement has been used by call center agents to better serve the customers that call in to place orders or ask for information. With customer engagement in stores, retailers can now use some of this same information to provide a better in-store experience for their customers. Users can have a quick overview of the customer they are working with currently within the store, and they can also use the information to better prepare for an upcoming customer visit. Customer Dashboard: The customer dashboard provides a high level look into the customer the user is working with.  The dashboard can provide insights into the type of shopper the customer is, as well as some of their preferences with regard to their shopping habits. The dashboard is configurable by the retailer When enabled, the user will land on the dashboard when viewing the customer record, or they can view it from anywhere in the POS application when a customer has been activated Customer Sub-header: The customer sub-header provides additional information on the customer, such as total purchase and return values as well as social media influence. The attributes shown within sub-header can be configured by the retailer Cases: Currently, cases are created by call center representatives for customer inquiries, complaints, and issues related to specific orders.  Store personnel can use case details to potentially help resolve an issue with an order, or to have additional information regarding a past purchase. If a customer has a case open against a previous purchase, then the user will be able to view the details by navigating to the past purchases tab within the customer record. Once a case is closed, it will no longer appear within the past purchases. Manager Functions Outside of Cart Based on grants, users can now access manager functions outside of the cart.  A new menu option will appear on the home screen as well as the hamburger navigation.  Additionally, retailers can now configure the application to require a single associate be applied to the various manager functions.  The applied associate will appear on the function overlay as well as on the receipt print out. Capture Manager Override Details on Order and EJ This feature provides the ability to persist manager override details when an action is performed through override action.  This is information is also made available on Electronic Journal too.  Key information that is captured based on this action is: Order ID, Order Line ID, Action performed using manager override, status, manager authorizing the action.  This is captured in the following cases: Manager override completed successfully in Check only mode. Manager override in check and forward mode.  Both success and failed attempts. New features enabled with manager override make it to EJ automatically. Interactive Customer Closet (Lookbook) More and more, retailers are working to create an enhanced experience when a customer shops with them.  This leaves the customer with a feeling of value, therefore increasing the likelihood that they will not only continue to shop with the retailer, but will also recommend them to friends and family.  Part of this experience involves engaging with the customers  by creating lookbooks.  A lookbook is part of a customizable shopping experience. These looks combine items that the customer has already purchased from the retailer, and combines them with new items to make a tailor-made look for the customer. Customers can use these looks to find favorite items, discover new items, and get inspired. Creating a lookbook: Store users can create lookbook from user, customer screen or from global cart screen. To create a lookbook user can drag and drop items from the source to the specified positions in the target. Lookbook can have multiple pages with each page containing a max of 6 items, the items within the lookbook can be positioned within and across the pages. Lookbook can be created from below sources: Catalog Workspace Past Purchase (Only when customer is active) Wishlist (Only when customer is active) Sharing lookbook with customer: During creating of a lookbook or once the it is are created, lookbooks can be shared to customers. User can choose to share lookbook just to customer profiles to start with and then share via email later or sharing it via email to customer directly. Both of these operations will create visibility of shared lookbook information on customer records. Viewing/Update lookbook: Upon creation of the lookbook, user can view the lookbooks created by them from the user menu. From the same screen user can also view lookbooks created across the organization or public/shared lookbooks from corporate users, this is controlled using the filter operations. Edit/Delete: User can choose to update the lookbooks from user or customer screens if this is not already shared to the customer via email. If shared, user can perform a copy using save as operation and update the copied lookbook. User can delete the lookbooks at any point in time from the user or customer screens. One-time Use Coupon (Offer Number) This feature allow the retailer to create deals with one time use coupons (internally termed as offer number). While creating a deal, user can choose the number of one-time use coupons that they want to generate as part of this deal. All these one-time use coupons generated will be attached back to this deal in the backend system. We have pretty complex algorithm in place for one-time use coupons generated to make sure are unique within a deal and across the deal which can be shared to the customers via mail/email or any mode of communication. Configuring one-time coupon code generation pattern: From the config ui, users can choose to length of offer number and the below patterns that they want to keep in the generated offer number. Configure any static number/digits that they want to keep in one-time coupon. All one-time coupons created in a deal will be having constant four character, users can choose the starting position of these constants. User can also choose if they want to generate one-time coupons as numbers or alphabets or both in each position over the length of these coupons. Note that: Once any deal with offer numbers are created, configuration changes are not allowed. Export one-time use coupon: Retailer will be provide with an option to export generated one-time coupons from the config ui screen. Once the deal is created with one-time use coupons, user can go back to edit deal screen and download the data. This data will be download to the local machine which is a zip file, upon extract will get you one-time use coupons. Using one-time use coupon: The one-time use coupons can be scanned or entered manually in the POS application same as that for regular coupons. Once successful scan, and if the one-time use coupons is valid and lifetime max redemption is not reached will be evaluated for a deal and added to the cart to provide the eligible promotion. Store Close - Payment Reconciliation and Order Cancellation This feature offers to reconcile the payment records between the gateway and payment component. If there are  any transactions created in the gateway, but did not make it to the payment.  The process creates / updates requisite payment transactions.  Order cancellation cancels open orders and the payments, if any, in addition to open Back Office transactions.  This insures all transactions created for the day are closed logically and downstream systems get the visibility to it. Cloud Framework Password Expiry Now passwords of natively-authenticated users expire after 90 days. Configuration Director User Interface Following the Configuration Director APIs from last quarter, purpose-built UIs are now available for the Configuration Director tool – Config Director. Config Director can be used to move configuration data between environments. The Configuration Director UI enables the export, import, and comparison between configuration data and optionally master data of all or the selected components and provisioning profiles. Configuration Director also indicates the historical count of exports and imports. Further details of previous exports and imports can also be visually inspected. Configuration Director allows downloading exports and compares zip files for data transformations, which can be uploaded to S3 (or other cloud space) from the Configuration Director UI and later used for import and comparison. Export Export is a function provided by Config Director that enables the user to export the config and optionally master data from an environment. Import Import is a function provided by Config Director that enables the user to import an ExportId or a Diff (the result of a compare) in a target environment. Compare Compare is a function provided by Config Director that enables comparison between two existing export Ids from the same or different environments. Base Profile for Seed Data The base profile will store all the entities for which seed data is provided. Seed data is used for application startups to minimize required configuration before the application starts. This \"base\" profile cannot be used in any provisioning profile other than the profile belonging to System organization. Upgrades can be made to seed data without impacting active configurations because the seed data in Base profile is not used directly for the upgrade."
}