{
  "success": true,
  "permalink": "returns-shipped-to-distribution-center",
  "title": "Returns Shipped to Distribution Center",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158393\" href=\"/order-management\" class=\"breadcrumb-links\">Order Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158394\" href=\"/process-configuration-guides\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2161123\" href=\"/returns-exchanges-2\" class=\"breadcrumb-links\">Returns & Exchanges</a></li><li> <span>››</span>Returns Shipped to Distribution Center</li></ul>  \t\r\n\t\t<h2>Returns Shipped to Distribution Center</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/returns-shipped-to-distribution-center$overview\">Overview</a><ul><li><a href=\"/returns-shipped-to-distribution-center$high-level-flow\">High Level Flow</a></li><li><a href=\"/returns-shipped-to-distribution-center$dc-recieving\">DC Recieving</a></li><li><a href=\"/returns-shipped-to-distribution-center$return-order-updates-on-item-receipt-and-verification\">Return Order Updates on Item Receipt and Verification</a></li><li><a href=\"/returns-shipped-to-distribution-center$return-variances\">Return Variances</a><ul><li><a href=\"/returns-shipped-to-distribution-center$quantity-variance\">Quantity Variance</a></li><li><a href=\"/returns-shipped-to-distribution-center$item-variance\">Item Variance</a></li><li><a href=\"/returns-shipped-to-distribution-center$condition-variance\">Condition Variance</a></li></ul></li></ul></li><li><a href=\"/returns-shipped-to-distribution-center$return-order-cancelation\">Return Order Cancelation</a></li><li><a href=\"/returns-shipped-to-distribution-center$configuration\">Configuration</a><ul><li><a href=\"/returns-shipped-to-distribution-center$item-conditions\">Item Conditions</a></li><li><a href=\"/returns-shipped-to-distribution-center$auto-resolve-quantity-variance\">Auto Resolve Quantity Variance</a></li></ul></li><li><a href=\"/returns-shipped-to-distribution-center$feature-scope\">Feature Scope</a></li><li><a href=\"/returns-shipped-to-distribution-center$uis-and-entities\">UIs and Entities</a></li><li><a href=\"/returns-shipped-to-distribution-center$related-articles\">Related Articles</a></li></ul></div>\r\n\r\n<h3><a name=\"overview\" id=\"overview\"></a>Overview</h3>\r\n\r\n<p>Manhattan&nbsp;Active&reg; Order Management System with Manhattan&nbsp;Active&reg; Warehouse Management (MAWM) integration provides&nbsp;the&nbsp;ability for DCs&nbsp;to process the customer not present returns created through MA Call Center or MA Digital Self-Service.&nbsp;Manhattan&nbsp;Active OM&nbsp;utilizes the Dynamic Return Center Optimization to identify an optimized DC as a return center facility. And&nbsp;also helps retailers&nbsp;to&nbsp;initiate a refund when the returned items&nbsp;are received and verified at DCs, along with the inventory update in the Manhattan&nbsp;Active Inventory based on the returned item condition.</p>\r\n\r\n<p>Here&#39;s how it works:</p>\r\n\r\n<ul>\r\n\t<li>A customer places a return order using&nbsp;Manhattan&nbsp;Active&reg; Omni Digital Self-Service or Contact Center.</li>\r\n\t<li>A Manhattan Active WM DC is identified as the optimized return center.</li>\r\n\t<li>Return label is generated and emailed to the customer on return order confirmation.</li>\r\n\t<li>The package arrives at the DC and the DC user receives&nbsp;the items with&nbsp;quantities and conditions by validating against the original expected items from the Return Order.</li>\r\n\t<li>Manhattan Active OM processes the receipt event and updates the return order to received status.</li>\r\n\t<li>Manhattan Active WM inventory updates on return receipts are processed by Manhattan Active Inventory Management.</li>\r\n\t<li>The DC user submits the verification process with the verified items and&nbsp;quantities.</li>\r\n\t<li>Manhattan Active OM processes the line verification event and initiates the refund if there are no variances. If there are variances, the Customer Service Representative (CSR) has to resolve the variances manually and process the return order.</li>\r\n\t<li>Manhattan Active WM inventory updates on verification are processed by Manhattan Active Inventory Management.</li>\r\n</ul>\r\n\r\n<h4><a name=\"high-level-flow\" id=\"high-level-flow\"></a>High Level Flow</h4>\r\n\r\n<p>Once the return order is confirmed&nbsp;in&nbsp;Manhattan Active OM System,&nbsp;Manhattan Active WM will create Return ASN. The&nbsp;DC user will receive the package against an already created return ASN. Once the item is received, the DC user will&nbsp;proceed with verifying the returned items, and send the verification update to Manhattan Active OM to update the return order for a refund.</p>\r\n\r\n<p><img height=\"1031\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/qu/4398/Active_MAO_-_MAWM_Integration__5_.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL3F1LzQzOTgvQWN0aXZlX01BT18tX01BV01fSW50ZWdyYXRpb25fXzVfLnBuZyIsIkNvbmRpdGlvbiI6eyJEYXRlTGVzc1RoYW4iOnsiQVdTOkVwb2NoVGltZSI6MTc1NDc1Mzk3Mn19fV19&Signature=X7SbFfQGpB55D2G-K26qriyRA6SK9LRzzQZKPyy3nB2cXUjw8Cl2-24Dz9B5da~jnWR7e55TZrZNKJuyTk6-wFX95Rk~kd4k-Yo1pUKcotAQyx9SMvpHgaBvZYQUr46HdVk7eX-TbO~Dvp15nHbNcqsOcdXlWbnbOd2wbFQXbykm~cWafbd9cVAf7n9pplvnARW7L63BkYp1bcdyCk11KBfr4HcyRGRcMA5~PnBzUhTxZFgmI1~G7zqYQvRSvYNWQUfYZ5iUUbJeFU41S0EIp1-CzDUO87OnkSPd-3K2d9CdpUuSBsRDWGwujI1qiZadMUVPSMzXlQKwgpAIHMD2vQ__&Key-Pair-Id=K2TK3EG287XSFC\" width=\"1024\" /></p>\r\n\r\n<h4><a name=\"dc-recieving\" id=\"dc-recieving\"></a>DC Recieving</h4>\r\n\r\n<p>Manhattan Active&reg; Warehouse Management(MAWM) has been enhanced to streamline the process of converting&nbsp;Manhattan Active&reg; Omni(MAO) return orders to Manhattan Active WM Return ASN. Additionally, the MA Order Management system now supports the utilization of receipt pix and item-level verification pix to update the status of return orders. DC users are empowered to process returns seamlessly through either WM Mobile or the return station.</p>\r\n\r\n<p>The return process can be initiated by scanning either the Return ASN Number or the RRN (Parent order), provided there is only one associated Return ASN. Upon scanning the ASN, users can proceed to scan each item along with its quantity for return receiving. For items with tracking attributes, users are prompted to capture these attributes before proceeding with return disposition.</p>\r\n\r\n<p>Return disposition options enable users to determine whether the returned quantity should be received, received and consumed, or received and sorted. Condition codes and reason codes are applied to the return quantity based on the final return disposition.</p>\r\n\r\n<p>Upon completion of the receiving process, a receipt pix is generated. This receipt pix is consumed by the MA Order Management system and the MA Inventory component. Receiving unexpected items or quantities exceeding those listed on the ASN is supported but controlled through receiving criteria attribute configuration.</p>\r\n\r\n<p>Once all quantities are received, the ASN is verified, and item-level verification pixes are consumed by the MA Order Management system. The return order is then updated accordingly.</p>\r\n\r\n<h4><a name=\"return-order-updates-on-item-receipt-and-verification\" id=\"return-order-updates-on-item-receipt-and-verification\"></a>Return Order Updates on Item Receipt and Verification</h4>\r\n\r\n<p>When a return package is received by a DC associate, the following updates occur:</p>\r\n\r\n<ul>\r\n\t<li>The return detail entry is created with Item Id, Quantity, Condition codes for both expected and unexpected items.</li>\r\n\t<li>The return order line will be updated to received status for expected items.</li>\r\n\t<li>The return order line is created in received status for unexpected items.</li>\r\n\t<li>MA Warehouse Management inventory updates on return receipts are processed by Manhattan Active&reg; Omni Inventory. The Onhand Inventory is adjusted upon receipts based on Inventory lock codes and dispositions in MA Inventory.</li>\r\n</ul>\r\n\r\n<p>When a return package is verified&nbsp;by a DC associate, the following updates occur:</p>\r\n\r\n<ul>\r\n\t<li>The return order line is updated to returned status and a refund is processed if there are no variances found. Refer below section&nbsp;Return Variances that can occur on an order line if there is a mismatch in receipt quantity and order line quantity or mismatch between order line item condition and receipt condition codes&nbsp;or item variances.</li>\r\n\t<li>MA Warehouse Management inventory updates on verification does not impact MA inventory.</li>\r\n</ul>\r\n\r\n<div class=\"info\"><strong>Note</strong>:&nbsp;As part of this MA Order Management System - MA Warehouse Management Inventory Management integration, the &quot;customer&nbsp;not present&quot; DC return&nbsp;orders&nbsp;are always verified at the line level, regardless of&nbsp;the existing&nbsp;return verification policy in the MA Order Management System&#39;s Order Configuration. This is identified by&nbsp;&quot;ActiveLocationType&quot; : &quot;ActiveWM&quot; on the Return Order Event for&nbsp;&quot;EventType&quot;: &quot;LineVerification&quot;.</div>\r\n\r\n<h4><a name=\"return-variances\" id=\"return-variances\"></a>Return Variances</h4>\r\n\r\n<h5><a name=\"quantity-variance\" id=\"quantity-variance\"></a>Quantity Variance</h5>\r\n\r\n<p>If a package contains:</p>\r\n\r\n<ol>\r\n\t<li>Less than the expected number of units of a given item in the return order</li>\r\n\t<li>Greater than the expected number of units of a given item in the return order but less than the number of units ordered as part of the original parent order</li>\r\n</ol>\r\n\r\n<p>A quantity variance hold is applied on the respective return order line in such situations.&nbsp;The order line quantity is updated with the receipt quantity and variance quantity is calculated. If the sum of the verified quantity is equal to the receipt quantity, then the hold will be resolved automatically&nbsp;if &quot;auto resolve quantity variance&quot; is&nbsp;configured,&nbsp;else manual intervention is required for the refund process to be completed. In case of manual intervention, CSR will not be able to unhold the line if there are any quantities in received status. However, CSR has to cancel the return order line in such case&nbsp;and initiate a new return order with&nbsp;receipt expected as false to process the refund.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: If any of the expected items are not received, a line verification message is sent to MA Order Management with 0 quantity. In such a case, the order line is canceled, and the variance quantity will be the original order line quantity.</div>\r\n\r\n<p>Examples:</p>\r\n\r\n<ol>\r\n\t<li>Customer order with Item A and Item B&nbsp;with 2&nbsp;quantities each and a return order is initiated for Item A with 2 quantities. However, when the items are received at the return center, Item A is&nbsp;received and verified for 1 quantity each.&nbsp;&quot;Auto Resolve Quantity Variance&quot;&nbsp;is set to true in order configuration.\r\n\t<ul>\r\n\t\t<li>When the return order line verification is processed, the return order line quantity is updated with 1.</li>\r\n\t\t<li>Variance Quantity -1 is calculated to indicate less quantity was received.</li>\r\n\t\t<li>The order line is held with quantity variance hold&nbsp;and is auto resolved.</li>\r\n\t\t<li>Refund is processed.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Customer Order with Item A and Item B&nbsp;with 2&nbsp;quantities each, a return order is initiated for Item A with 1 quantity. However, when the items are received at the return center,&nbsp;Item A is received&nbsp;and verified for 2&nbsp;quantities&nbsp;each.&nbsp;&quot;Auto Resolve Quantity Variance&quot;&nbsp;is set to true in order configuration.\r\n\t<ul>\r\n\t\t<li>When the return order or return line verification is processed, the return order line quantity is updated to 2.</li>\r\n\t\t<li>Variance Quantity +1 is calculated to indicate more quantity was received.</li>\r\n\t\t<li>The order line is held with quantity variance hold and is auto resolved.</li>\r\n\t\t<li>Refund is processed.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Customer Order with Item A and Item B&nbsp;with 2&nbsp;quantities each, a return order is initiated for Item A with&nbsp;2 quantities. However, when the items are received at the return center,&nbsp;Item A is received&nbsp;and verified for 1&nbsp;quantity&nbsp;each.&nbsp;&quot;Auto Resolve Quantity Variance&quot;&nbsp;is set to false in order configuration.\r\n\t<ul>\r\n\t\t<li>When the return order or return line verification is processed, the return order line quantity is updated to 2.</li>\r\n\t\t<li>Variance Quantity -1 is calculated to indicate less quantity was received.</li>\r\n\t\t<li>The order line is held with quantity variance hold.&nbsp;</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Customer Order with Item A and Item B&nbsp;with 2&nbsp;quantities each, a return order is initiated for Item A with 2 quantities. However, when the items are received at the return center,&nbsp;Item A was never received and was verified with 0 qty.\r\n\t<ul>\r\n\t\t<li>When the return order line verification is processed, the return order line quantity is updated to 0&nbsp;and the line is canceled.</li>\r\n\t\t<li>Variance Quantity -2&nbsp;is calculated to indicate less quantity was received.</li>\r\n\t</ul>\r\n\t</li>\r\n</ol>\r\n\r\n<h5><a name=\"item-variance\" id=\"item-variance\"></a>Item Variance</h5>\r\n\r\n<p>If a package contains:</p>\r\n\r\n<ol>\r\n\t<li>An unexpected item which is a part of the parent order but not the return order</li>\r\n\t<li>An unexpected item which is not a part of the parent order</li>\r\n</ol>\r\n\r\n<p>A hold is applied on the respective return order line in such situations and manual intervention is required for the refund process to be completed.</p>\r\n\r\n<h5><a name=\"condition-variance\" id=\"condition-variance\"></a>Condition Variance</h5>\r\n\r\n<p>If a package contains an item whose condition is not the same as that mentioned by the customer at the time of the creation of the return order.</p>\r\n\r\n<p>A hold is applied on the respective return order line and manual intervention is required for the refund process to be completed.</p>\r\n\r\n<div class=\"tip\"><strong>Note: </strong>Return Item and Condition variances cannot be auto-resolved by default.&nbsp;Refer <a href=\"https://omni.helpdocsonline.com/return-variance\">here</a> for more information on how to resolve&nbsp;return variance manually for these. Return Quantity variance can be auto-resolved by configuring &quot;Auto Resolve Quantity Variance&quot; in order configuration.</div>\r\n\r\n<h3><a name=\"return-order-cancelation\" id=\"return-order-cancelation\"></a>Return Order Cancelation</h3>\r\n\r\n<p>A CSR can cancel the return order or return order line until the return ASN or ASN line is not received yet. When a CSR cancels a return order or return order line in pending return status, a return order cancelation outbound is published for MA Warehouse Management to consume and cancel the ASN or ASN line.</p>\r\n\r\n<h3><a name=\"configuration\" id=\"configuration\"></a>Configuration</h3>\r\n\r\n<p>The following configuration needs to be enabled to receive &ldquo;customer not present&rdquo; returns in DC.</p>\r\n\r\n<h5><a name=\"item-conditions\" id=\"item-conditions\"></a>Item Conditions</h5>\r\n\r\n<p>This configuration comprises&nbsp;the item condition that can be specified on return order creation so that condition variances can be determined when the return line is received and verified with a different condition code. The MA Order Management item condition should be defined the same as the MA Warehouse Management&nbsp;condition code for condition variance to be determined.</p>\r\n\r\n<div class=\"computer_code\">Configuration Name: <strong>Item Conditions</strong></div>\r\n\r\n<h5><a name=\"auto-resolve-quantity-variance\" id=\"auto-resolve-quantity-variance\"></a>Auto Resolve Quantity Variance</h5>\r\n\r\n<p>Auto resolve of quantity variance can be enabled using the &#39;Auto Resolve Quantity Variance&#39; flag in the returns and exchanges section of the <a href=\"https://omni.helpdocsonline.com/return_exchange_configurations$auto-resolve-quantity-variance\">Order Configuration</a>. This flag indicates whether return lines having Quantity Variance&nbsp;should be resolved automatically or put on hold for manual approval.</p>\r\n\r\n<div class=\"computer_code\">Configuration Name: <b>Auto Resolve Quantity Variance</b></div>\r\n\r\n<h3><a name=\"feature-scope\" id=\"feature-scope\"></a>Feature Scope</h3>\r\n\r\n<p>A return order must exist. Blind returns are not supported.</p>\r\n\r\n<h3><a name=\"uis-and-entities\" id=\"uis-and-entities\"></a>UIs and Entities</h3>\r\n\r\n<p>This document refers to the following UIs.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><strong>UI Name</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Component</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Group</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Seed Data Present?</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Seed Data Profile</strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Item Condition</td>\r\n\t\t\t<td>Order</td>\r\n\t\t\t<td>Order services</td>\r\n\t\t\t<td>No</td>\r\n\t\t\t<td>Base</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3><a name=\"related-articles\" id=\"related-articles\"></a>Related Articles</h3>\r\n\r\n<div class=\"info\"><ul class=\"related-articles\"><li><a href=\"/troubleshooting-returns-exchanges\" hqid=\"2696815\">Troubleshooting Returns & Exchanges</a></li><li><a href=\"/return-variance\" hqid=\"2604080\">Return Variance</a></li><li><a href=\"/exchanges\" hqid=\"2596256\">Exchanges</a></li><li><a href=\"/how-does-return-work\" hqid=\"2619553\">How Returns Work</a></li><li><a href=\"/returns-overview\" hqid=\"2596240\">Returns Overview</a></li><li><a href=\"/return-labels\" hqid=\"2596255\">Return Labels </a></li><li><a href=\"/returnlabeltracking\" hqid=\"3153241\">Return Label Tracking </a></li><li><a href=\"/returns-restapis\" hqid=\"2597376\">REST APIs and User Exits</a></li></ul></div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 18301,
  "scraped_at": "2025-08-09T22:34:32.231683"
}