{
  "success": true,
  "permalink": "sci-limits-and-guidelines",
  "title": "SCI Limits and Guidelines",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3501638\" href=\"/supply-chain-intelligence-2\" class=\"breadcrumb-links\">Supply Chain Intelligence</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158406\" href=\"/supply-chain-intelligence\" class=\"breadcrumb-links\">Supply Chain Intelligence - Omni</a></li><li> <span>››</span>SCI Limits and Guidelines</li></ul>  \t\r\n\t\t<h2>SCI Limits and Guidelines</h2>\r\n\r\n<p></p>\r\n\r\n<p>Manhattan Active® Omni includes Operational Supply Chain Intelligence. Use of Operational SCI is limited to the Manhattan Active® Omni&nbsp;Suite and any directly related systems. The following use restrictions on reporting apply as pre-defined configurations:</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"2\" rowspan=\"1\"><b>Limit Description</b></td>\r\n\t\t\t<td><strong>Limit</strong></td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" rowspan=\"2\">\r\n\t\t\t<p><br>\r\n\t\t\t<u><strong>Report Time Limits</strong></u></p>\r\n\t\t\t</td>\r\n\t\t\t<td>Maximum execution time for batch/scheduled reports</td>\r\n\t\t\t<td>30 Minutes</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Maximum execution time for interactive reports</td>\r\n\t\t\t<td>5 minutes</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\"><u><strong>Rows Retrieval</strong></u></td>\r\n\t\t\t<td>Maximum number of retrieved rows per query</td>\r\n\t\t\t<td>100,000</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" rowspan=\"2\">\r\n\t\t\t<p>&nbsp;</p>\r\n\r\n\t\t\t<p><u><strong>Content retention</strong></u></p>\r\n\t\t\t</td>\r\n\t\t\t<td>Number of report output versions</td>\r\n\t\t\t<td>1</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Number of report history occurrences</td>\r\n\t\t\t<td>5</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\" rowspan=\"2\">\r\n\t\t\t<p><br>\r\n\t\t\t<u><strong>Content Removal</strong></u><br>\r\n\t\t\t&nbsp;</p>\r\n\t\t\t</td>\r\n\t\t\t<td>Retention period for report output</td>\r\n\t\t\t<td>7 days</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Retention period for report history</td>\r\n\t\t\t<td>7 days</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"1\"><u><strong>Email Message</strong></u></td>\r\n\t\t\t<td>Maximum Email message size limit allowed</td>\r\n\t\t\t<td>10 MB</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>Additionally, the following general system guidelines are recommended to maintain optimal system performance:</p>\r\n\r\n<p><strong>a)Data Set Query recommendations</strong>:&nbsp; To achieve a more concise and focused report, it's essential to limit the results in your dataset. Consider implementing filters to limit the rows returned, as this leads to local processing of information.</p>\r\n\r\n<ul>\r\n\t<li>SCI datasets should not be refreshed more often than every 15 minutes.</li>\r\n\t<li>Implement strategies to limit the number of hits to the database to fetch the information/results. Schedule reports to run in Save mode to distribute saved versions and reduce database load.</li>\r\n\t<li>Utilize proper grouping and summaries to ensure report results align closely with dataset results.</li>\r\n\t<li>Avoid using the 'ALL' package for single package use cases to prevent excessive load and potential errors.</li>\r\n</ul>\r\n\r\n<p><strong>b)</strong>&nbsp;No more than 25 reports running concurrently.</p>\r\n\r\n<p><strong>c)</strong> CSV table extracts should not be used.<br>\r\n<br>\r\n<strong>d)</strong>&nbsp;&nbsp;<b>Raw Data Movement Limitation</b>: Extraction of large amounts of raw data, for example, CSV or Excel files in Cognos and then moving a large volume of rows, is not&nbsp;supported in Manhattan Active® SCI. This immense movement of data impacts the stability of Cognos and creates performance issues for conventional reporting use cases. Manhattan Active® SCI is intended only for analytics through the production of human-readable reports and dashboards.<br>\r\n<br>\r\n<strong>e) Real-Time&nbsp;</strong><b>Mission-Critical reports are not supported:&nbsp;</b>Reports are generated using a read-replica of the production database.&nbsp; While the replication is typically near real-time, there may be occasional replication delays.&nbsp; Reports will always reflect what is currently in the read-replica, but because of occasional delays, may not reflect the current production data and therefore may not be appropriate for reports requiring real-time production data.&nbsp; Some examples of mission-critical reports are:</p>\r\n\r\n<ul>\r\n\t<li>Shipping labels and documents such as packing lists and bills of lading</li>\r\n\t<li>Trucks expecting an SCI report before transporting orders</li>\r\n\t<li>Floor-level employees waiting for SCI reports before beginning their operations</li>\r\n\t<li>Receiving a worksheet to initiate the receiving process</li>\r\n\t<li>Printing of packing lists and dispatching of orders (shipments stopping due to the dependency on these reports)</li>\r\n\t<li>Assembly line operations&nbsp;halted due to the dependency on the&nbsp;SCI report&nbsp;</li>\r\n</ul>\r\n\r\n<p><br>\r\n<strong>f)&nbsp;</strong><b>My </b><b>Content</b><b> Folder Limitation:</b> Cognos Analytics offers two folders, namely, Team Content and My Content, for developing reports and dashboards. During a Cognos upgrade, the transfer of content and ownership of items saved in the My Content folder is not supported.&nbsp;&nbsp;The usage of My Content is not supported in general. It must not be used as a reliable location to save any Cognos object.&nbsp;Items in the My Content Folder must be moved to the Team Content folder.</p>\r\n\r\n<p><strong>g) Access Control</strong>:&nbsp;Admin-level access to the Cognos system is exclusively limited to Manhattan Services and Operations teams to manage Active SCI deployments. Customers are prohibited from accessing the system with admin privileges.</p>\r\n\r\n<p><strong>h)&nbsp;Scheduling</strong>:&nbsp;Consider the following recommendations for scheduling</p>\r\n\r\n<ul>\r\n\t<li>Stagger schedules to prevent simultaneous triggers that can overload systems.</li>\r\n\t<li>Ensure that the execution of multiple schedules does not exceed the set concurrency limits.</li>\r\n\t<li>Monitor system performance to adjust schedules accordingly and maintain optimal workflow.</li>\r\n\t<li>Implement alerts to notify of potential concurrency limit breaches or scheduling conflicts.</li>\r\n\t<li>Regularly review and update scheduling parameters to align with system capabilities and requirements.</li>\r\n</ul>\r\n\r\n<p><strong>i)&nbsp;Standardizing report generation times</strong></p>\r\n\r\n<ul>\r\n\t<li>Aligning MySQL and Cognos limits to 90 minutes</li>\r\n\t<li>The database has a maximum SQL execution time of 90 minutes to ensure efficient query execution. After which the DB process is usually terminated.</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: For more information on the SCI guidelines for report developers, refer to this <a href=\"https://omni.helpdocsonline.com/guidelines-for-report-developers\"><span style=\"color:#2980b9;\">page</span></a>.</div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 7192,
  "scraped_at": "2025-08-09T22:36:45.537357"
}