{
  "success": true,
  "permalink": "screenlockguide",
  "title": "Screen Lock",
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2164553\" href=\"/store-common\" class=\"breadcrumb-links\">Store Common</a></li><li> <span>››</span>Screen Lock</li></ul>  \t\r\n\t\t<h2><a name=\"screen-lock-process\" id=\"screen-lock-process\"></a><a id=\"Screen Lock\" name=\"Screen Lock\"></a>Screen Lock Process</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/screenlockguide$screen-lock-process\">Screen Lock Process</a><ul><li><a href=\"/screenlockguide$screen-lock-trigger\">Screen Lock Trigger</a></li><li><a href=\"/screenlockguide$lock-state\">Lock State</a></li><li><a href=\"/screenlockguide$unlocking\">Unlocking</a></li><li><a href=\"/screenlockguide$logout\">Logout</a><ul><li><a href=\"/screenlockguide$interaction-of-screen-lock-with-inactivity-logoff-timers\">Interaction of Screen Lock with Inactivity (logoff) timers</a></li><li><a href=\"/screenlockguide$re-setting-the-countdown-timer-on-the-screen-lock-nbsp\">Re-setting the Countdown Timer on the Screen Lock&nbsp;</a></li></ul></li><li><a href=\"/screenlockguide$interaction-of-screen-lock-with-auto-recovery-feature\">Interaction of Screen Lock with Auto Recovery Feature</a></li><li><a href=\"/screenlockguide$screen-lock-configurations-enablement\">Screen Lock Configurations/enablement</a><ul><li><a href=\"/screenlockguide$enable-manual-screen-lock-function-icon\">Enable Manual Screen Lock function/icon</a></li><li><a href=\"/screenlockguide$timer-to-automatically-lock-screen-seconds\">Timer To Automatically Lock Screen (Seconds)</a></li><li><a href=\"/screenlockguide$automatically-lock-after-pos-transaction-lock-screen-after-jump-to\">Automatically lock after POS transaction - Lock Screen After Jump To</a></li></ul></li><li><a href=\"/screenlockguide$resource-ids\">Resource IDs</a></li><li><a href=\"/screenlockguide$services\">Services</a></li></ul></li></ul></div>\r\n\r\n<p>Screen Lock functionality on any enterprise application is a vital part of security. It allows the associates&nbsp;to secure the devices from unauthorized access. Manhattan Active Omni Store provides the ability for associates to manually lock their devices when not in use without logging out of the application. This feature can be configured to work either automatically or&nbsp;manual action by the store associates or both.</p>\r\n\r\n<h3><a name=\"screen-lock-trigger\" id=\"screen-lock-trigger\"></a>Screen Lock Trigger</h3>\r\n\r\n<p>The screen lock gets applied on top of the application either&nbsp;manually by the associate or automatically whenever the application is left idle. Below are the three ways which allow a business to decide how the screen lock can be applied based on their use cases.</p>\r\n\r\n<ol>\r\n\t<li><strong>With a manual function key</strong> &ndash; There is a manual lock icon that is provided in the Hamburger menu. Associates can click on this to lock the screen immediately. The lock icon is accessible across all application screens.&nbsp;For Ex: Associates&nbsp;can lock the screen while they are in Cart, Catalog, or Prepare Pickups&nbsp;screen. This lock icon is protected using a business configuration and a grant which is highlighted in the Config section below.</li>\r\n\t<li><strong>Automatically using a screen lock timer</strong> &ndash; Sometimes the company decides to have a common way of locking the application in case the application is left idle for some time. They want the behavior to be same across different associate/ stores. For such purposes, it is possible to configure a specific timer which locks the application screen once the set time is reached. The timer is configurable and acts like an inactivity check to protect the screen from unauthorized access. So, if the application is left idle for the specified time, the application automatically triggers the lock masking the screen where the application was left by the associate. The screen where the lock kicked in from will still be available in the background. &nbsp;</li>\r\n\t<li><strong>Auto Lock after a certain type of transaction</strong> &ndash; This option allows the company to lock the application screen after a certain POS Cart flow is executed. This is also controlled by a business flag, which in turn depends on another business flag &quot;<a href=\"http://omni.helpdocsonline.com/poscartccnfiguration$AfterTransJumpToflag\">AFTER TRANSACTION JUMP TO</a>&quot;. There are currently a few set &quot;jumpTo&quot; possibilities&nbsp;-&nbsp;Cart, Catalog and Login (which auto-logs off the user after each POS transaction).\r\n\t<ol>\r\n\t\t<li>When the new auto-lock option is enabled, POS will first respect the jump to settings to CART or CATALOG, and then&nbsp;the screen will lock.</li>\r\n\t\t<li>Because the third afterTransactionJumpTo option involves a complete logoff, auto-lock is not relevant, since in this case, after each transaction&nbsp;the associate&nbsp;session ends and hence, screen lock has no relevance and thus lock is not applied.</li>\r\n\t</ol>\r\n\t</li>\r\n</ol>\r\n\r\n<p>See the&nbsp;<a href=\"/screenlockguide$ScreenLockEnablement\">Config/Enablement section</a> for details on configuring all three options.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>:&nbsp;While the Payment Terminal interaction is in progress for a payment, the screen lock timer will not be triggered automatically.</div>\r\n\r\n<h3><a name=\"lock-state\" id=\"lock-state\"></a>Lock State</h3>\r\n\r\n<p>Once the screen lock is applied using any of the three different ways as highlighted above, the application cannot be accessed by the associate until they clear the screen lock.</p>\r\n\r\n<p>The screen where the associate&nbsp;is currently working is moved into the background of the lock screen, thus making it inaccessible. For ex. The associate is on the Cart screen and has added a few items and the lock screen is triggered. The lock screen will then completely mask the Cart screen and restrict any access to the Cart until it is cleared - it acts like&nbsp;a desktop screen saver.&nbsp;&nbsp;&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>The login screen-lock pop-up displays a (configurable) graphic, and the First Name and the Last Name of the associate who is currently logged in, as well as a credentials form to &#39;unlock&#39; the application.</li>\r\n\t<li>In case the first/last name details are not set up, the associate user id is displayed on the lock screen login pop-up.</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><span style=\"color:#000000;\"><strong>Note:&nbsp;</strong>Store Common Configuration provides the customers with the ability to configure the background image for the lock screen. Also, the text on the lock screen supports localization.</span></div>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> The Screen lock is supported on all platforms i.e. iOS, Android,Windows, Browser. However, on the Browser the screen lock is applied only on the Storefacade screen&nbsp;and not on the Omnifacade.</div>\r\n\r\n<h3><a name=\"unlocking\" id=\"unlocking\"></a>Unlocking</h3>\r\n\r\n<p>The screen saver/lock can only be cleared to return to the application/screen/state/transaction in progress by the same user during whose session the &#39;lock&#39; was manually or automatically invoked.</p>\r\n\r\n<p>To validate the identity of the &#39;unlocker&#39;, the associate is required&nbsp;to enter his/her user PIN&nbsp;to unlock the screen on the pop-up screen.&nbsp;</p>\r\n\r\n<p>Associates also have the option to log in as a different associate from this lock screen. However, if the associate chooses to login as a New User, all the &quot;In Progress&quot; transaction detail associated with the previous user is lost. The application will void any unfinished transactions which were there before the screen was locked.</p>\r\n\r\n<div class=\"tip\"><span style=\"color:#000000;\"><strong>Note:</strong>&nbsp;The PIN is an existing attribute of MAO Store users, which is used for offline/Edge application access as well as Manager Override key credentialing.&nbsp;In order to use a PIN to unlock the screen, it&nbsp;must be configured for the associate&nbsp;using the <a href=\"https://omni.helpdocsonline.com/basic_overview_resilientpos$PINSetReset\">User PIN&nbsp;option in the users&#39; set up</a>.&nbsp;</span></div>\r\n\r\n<div class=\"tip\"><span style=\"color:#000000;\"><strong>Note:</strong> As noted, if a user&#39;s&nbsp;PIN is not configured, the user will not be able to unlock the Screen Lock and clear the screen saver.&nbsp;In such an&nbsp;event, they will use the option to logout/login to the Home screen of the Store app as New User, obviously losing any of the unsaved transactional data.&nbsp;If the screen is locked while being online, the user cannot unlock the application if the internet connection is lost. A valid PIN entered by the user will not be verified&nbsp;since the POS service cannot be reached while offline. To unlock the application, the user must wait for the internet to resume or can close the application.&nbsp;&nbsp;</span></div>\r\n\r\n<h3><a name=\"logout\" id=\"logout\"></a>Logout</h3>\r\n\r\n<p>The Logout option on the Lock Screen provides the user with an ability&nbsp;to directly disconnect from the logged-in application. It is also a way to switch between users by ending the existing session and starting a fresh one.Any In Progress transaction, however, is cancelled if the user decides to log out of the application directly from the lock screen.&nbsp;</p>\r\n\r\n<div class=\"tip\">\r\n<div><strong>Note:</strong>&nbsp;The seed data mentioned below must be added to the base profile to ensure the cancellation of an unfinished transaction when the user selects the Log Out option on the Lock screen.&nbsp;</div>\r\n\r\n<div>&nbsp;</div>\r\n\r\n<div>A new reason code is added to capture the cancellation of the &quot;In progress&quot; transaction when the user selects the log&nbsp;out option from the lock screen.&nbsp;</div>\r\n\r\n<p><strong>Seed Data:</strong></p>\r\n\r\n<p><strong>{<br />\r\n&nbsp; &nbsp;&quot;ReasonId&quot;: &quot;LockScreenLogout&quot;,<br />\r\n&nbsp; &nbsp;&quot;ReasonTypeId&quot;: &quot;Cancel&quot;,<br />\r\n&nbsp; &nbsp;&quot;Description&quot;: &quot;Transaction canceled as the user was logged out when the screen was locked&quot;,<br />\r\n&nbsp; &nbsp;&quot;ShortDescription&quot;: &quot;Lock Screen User Logout&quot;<br />\r\n}</strong></p>\r\n\r\n<p><strong>API Detail:</strong>&nbsp;{{url}}/order/api/order/reason/save</p>\r\n</div>\r\n\r\n<h4><a name=\"interaction-of-screen-lock-with-inactivity-logoff-timers\" id=\"interaction-of-screen-lock-with-inactivity-logoff-timers\"></a>Interaction of Screen Lock with Inactivity (logoff) timers</h4>\r\n\r\n<p>Inactivity timers can currently be configured for the Store application, which automatically logs off the associate and closes the application session if no activity occurs for the configured period.&nbsp;In the current store application, there are two types of Inactivity timers &ndash; &ldquo;Inactivity Timeout Within Trans in Minutes&rdquo; and &ldquo;Inactivity Timeout Without Trans in Minutes&rdquo;.&nbsp; &nbsp;These are configured via&nbsp; <a href=\"http://omni.helpdocsonline.com/poscartccnfiguration$InactivityTimers\">POS&nbsp;Store Configuration&gt;Store Common Configuration</a></p>\r\n\r\n<div class=\"tip\"><span style=\"color:#000000;\"><strong>Note</strong>: Locking the device via Screen Lock functionality does not disable the inactivity timers and they will still trigger as per the configuration if the device is left idle, even while&nbsp;locked.</span></div>\r\n\r\n<p>These Inactivity Timeouts ensure that the associate is logged out of the application if the application is idle for the set period.&nbsp; &nbsp;Prior to the actual auto-logoff, a warning is displayed with a 60 second countdown which gives the associate time to press any key and reset the time, avoiding auto-logoff.</p>\r\n\r\n<p>The Screen Lock feature is designed to work in tandem with both these timers. Below are the two states showing the behavior of the screen lock:</p>\r\n\r\n<ol>\r\n\t<li><strong>When the device is not locked</strong> - There is no change in the application behavior. The Inactivity Timeout warning pop up will be displayed as per the configuration with a pop up showing the remaining time to logout.&nbsp;</li>\r\n\t<li><strong>When the device is&nbsp;locked</strong> -&nbsp;This can happen either manually or automatically, depending on the configuration. In either of the scenarios, the countdown timer on the Screen Lock displays the remaining time when the application will log out. The Inactivity Timeout warning popup is not displayed on the lock screen, instead it is pushed in the background.</li>\r\n</ol>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> It is an ideal process to configure the Screen Lock timer less than the Inactivity Timeout timers. This is because when the Inactivity Timers expire the application is logged out, thus having no relevance for the screen lock to be fired as the session has already ended.&nbsp; In other words, it makes no sense to configure a screen lock to occur when the associate will already have been logged out and their session terminated prior.</div>\r\n\r\n<p>The Login pop up also displays a countdown timer which shows the time left before the associate will be logged out of the application unless there is an action done by the associate.</p>\r\n\r\n<h4><a name=\"re-setting-the-countdown-timer-on-the-screen-lock-nbsp\" id=\"re-setting-the-countdown-timer-on-the-screen-lock-nbsp\"></a>Re-setting the Countdown Timer on the Screen Lock&nbsp;</h4>\r\n\r\n<p>Associates can reset this logout countdown timer by tapping anywhere on the screen or scanning an item/order using a scanner. If the associate scans an item/order while on the lock screen, the countdown timer is reset. However, the item/order is not added to the cart. Associates&nbsp;can add an item/order only after unlocking the application and re-scanning it.</p>\r\n\r\n<p><span style=\"color:#000000;\">When the timer is reset by either tapping or scanning an item/order, the application adds a minute extra over the configured time to this timer. This happens as the application is designed to idle up to the configured time and then show the pop up with a 60 second countdown timer for the user to act. Hence, the new time on the screen to logout will be <strong>&quot;Inactivity Timer + 60 sec&quot;</strong> every time the user resets the timer.&nbsp;</span></p>\r\n\r\n<p><span style=\"color:#000000;\">To understand, let&#39;s say if the inactivity timers are set to <strong>2 minutes (120 sec)</strong>. The screen is currently locked, and the countdown timer displays <strong>Time to Log Out as 40 sec</strong>. When the user taps anywhere on the app the timers are reset. The countdown timer now displays the Time<strong>&nbsp;to Log Out as 180&nbsp;sec, </strong>which is 120 sec of Inactivity Timer + 60 sec.</span></p>\r\n\r\n<h3><a name=\"interaction-of-screen-lock-with-auto-recovery-feature\" id=\"interaction-of-screen-lock-with-auto-recovery-feature\"></a>Interaction of Screen Lock with Auto Recovery Feature</h3>\r\n\r\n<p>The Auto Recovery feature provides the associate with an option to recover the session they were working on in the event of an application crash.&nbsp; The time duration within which the app can be recovered is <a href=\"https://omni.helpdocsonline.com/store-application-recovery-process$AppRecoveryDuration\">configurable</a>.&nbsp;</p>\r\n\r\n<p>When the app is recovered, the associate is navigated either to&nbsp;Home or the Cart screen based on the App Recovery feature.&nbsp; The Screen Lock, however,&nbsp;will be applied in case the app was locked prior to recovery.</p>\r\n\r\n<p>For example, let&#39;s say that the user is on the Home screen and locks&nbsp;the screen.&nbsp; Due to some issue, the app crashes.&nbsp; The user tries to re-launch the app.</p>\r\n\r\n<p>In such a case, when the app recovers, the recovered state is present but includes the screen lock.&nbsp; Just as prior to the crash, the associate has to enter the PIN to re-enter the application.</p>\r\n\r\n<p>In case the Screen Lock was not applied prior to the app crash, as with current functionality, upon recovery the associate is&nbsp;directly navigated to the expected screen without the lock screen. The landing screen is as per the auto recovery feature.&nbsp;</p>\r\n\r\n<h3><a name=\"screen-lock-configurations-enablement\" id=\"screen-lock-configurations-enablement\"></a><a id=\"ScreenLockEnablement\" name=\"ScreenLockEnablement\"></a>Screen Lock Configurations/enablement</h3>\r\n\r\n<p>There are multiple configurations which can&nbsp;enable the screen lock feature in the Active Omni application&nbsp;and can be found in the Store Common Configuration. These&nbsp;can be used either individually or in combination.&nbsp;</p>\r\n\r\n<h4><a name=\"enable-manual-screen-lock-function-icon\" id=\"enable-manual-screen-lock-function-icon\"></a>Enable Manual Screen Lock function/icon</h4>\r\n\r\n<p>This flag allows the user the ability to lock the screen manually by providing a lock icon on the Hamburger menu.</p>\r\n\r\n<p>The configuration is coupled with a user grant&nbsp;which is used to hide/unhide the lock icon on the Hamburger menu.&nbsp;</p>\r\n\r\n<p>The default value of the flag&nbsp;is False.</p>\r\n\r\n<h4><a name=\"timer-to-automatically-lock-screen-seconds\" id=\"timer-to-automatically-lock-screen-seconds\"></a>Timer To Automatically Lock Screen (Seconds)</h4>\r\n\r\n<p>The &quot;Inactivity Timeout to Lock Screen (Seconds)&quot; attribute in Store Common Configuration / Store Common Configuration&nbsp;UI defines if the screen is locked automatically after a period of inactivity.</p>\r\n\r\n<p>Customers can configure a specific time after which the application is locked out, if no actions are taken for that configured time.&nbsp;</p>\r\n\r\n<h4><a name=\"automatically-lock-after-pos-transaction-lock-screen-after-jump-to\" id=\"automatically-lock-after-pos-transaction-lock-screen-after-jump-to\"></a>Automatically lock after POS transaction - Lock Screen After Jump To</h4>\r\n\r\n<p>This configuration allows the customer to auto-lock the screen (after being navigated to the configured &quot;afterTransactionJumpTo&quot; specific screen) upon completion of a transaction.</p>\r\n\r\n<p>It works in conjunction with a related business flag, &quot;After Transaction Jump To&quot;, which&nbsp;currently has three values - Cart, Catalog and Login - and must be configured for one of the three.</p>\r\n\r\n<p>If the new Lock Screen after Jump To switch is enabled,</p>\r\n\r\n<ul>\r\n\t<li>If a related switch After Transaction Jump To&nbsp;value is set to Cart or Catalog, the user is navigated&nbsp;to the respective cart/catalog screen <strong>and the Screen Lock is applied on top of the screen.</strong></li>\r\n\t<li>If a related switch After Transaction Jump To&nbsp;value is set to Login, the Screen Lock is irrelevant&nbsp;because the user navigates to the main login page ending the existing user session.</li>\r\n</ul>\r\n\r\n<h3><a name=\"resource-ids\" id=\"resource-ids\"></a>Resource IDs</h3>\r\n\r\n<p>The below resource is required to perform the manual screen lock functionality.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\">Resource</th>\r\n\t\t\t<th scope=\"col\">Purpose</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>ui::storecommon::screenlock</td>\r\n\t\t\t<td>The resource allows the display of the lock icon on the Hamburger menu.</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3><a name=\"services\" id=\"services\"></a>Services</h3>\r\n\r\n<p>The&nbsp;APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:1000px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\">Service</th>\r\n\t\t\t<th scope=\"col\">Component</th>\r\n\t\t\t<th scope=\"col\">Group</th>\r\n\t\t\t<th scope=\"col\">Service Endpoint</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Unlocks the User</td>\r\n\t\t\t<td>Storefacade</td>\r\n\t\t\t<td>User Pin</td>\r\n\t\t\t<td>/storefacade/api/storefacade/unLockUser</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 20589,
  "scraped_at": "2025-08-09T22:36:32.871696"
}