{
  "id": "2771598",
  "permalink": "sdd",
  "title": "Same Day Delivery",
  "type": "topic",
  "level": 5,
  "path": "Manhattan Active® Omni/Store/Process & Configuration Guides/Store Inventory & Fulfillment/Store Order Fulfillment/Same Day Delivery",
  "raw_item": {
    "id": "2771598",
    "text": "Same Day Delivery",
    "title": "Same Day Delivery",
    "permalink": "sdd",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "134021",
    "parent": "f;134021",
    "created_date": "1620048583",
    "modified_date": "1751907698",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "16"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158410\" href=\"/store\" class=\"breadcrumb-links\">Store Inventory & Fulfillment</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158852\" href=\"/store-fulfillment\" class=\"breadcrumb-links\">Store Order Fulfillment</a></li><li> <span>››</span>Same Day Delivery</li></ul>  \t\r\n\t\t<h2>Same Day Delivery</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/sdd$overview\">Overview</a></li><li><a href=\"/sdd$same-day-delivery-in-store-fulfillment\">Same Day Delivery in Store Fulfillment</a><ul><li><a href=\"/sdd$processing-of-same-day-delivery-fulfillments\">Processing of Same Day Delivery Fulfillments</a></li><li><a href=\"/sdd$prepare-pickups\">Prepare Pickups</a></li><li><a href=\"/sdd$staging\">Staging</a></li><li><a href=\"/sdd$reprint-pickup-slip\">Reprint Pickup Slip</a></li><li><a href=\"/sdd$contact-customer-confirm-pickup-and-curbside-pickups\">Contact Customer, Confirm Pickup, and Curbside Pickups</a></li><li><a href=\"/sdd$curbside-pickup\">Curbside Pickup</a></li><li><a href=\"/sdd$substitution-during-picking\">Substitution during Picking</a></li><li><a href=\"/sdd$fulfillment-outbound-and-events\">Fulfillment Outbound and Events</a></li><li><a href=\"/sdd$completed-shipments\">Completed Shipments</a></li></ul></li><li><a href=\"/sdd$configuration\">Configuration</a><ul><li><a href=\"/sdd$store-fulfillment-configuration\">Store Fulfillment Configuration</a><ul><li><a href=\"/sdd$same-day-delivery-carriers\">Same Day Delivery Carriers</a></li><li><a href=\"/sdd$push-notification-new-same-day-delivery-orders\">Push Notification - New Same Day Delivery Orders</a></li><li><a href=\"/sdd$push-notification-driver-on-the-way\">Push Notification - Driver On The Way</a></li><li><a href=\"/sdd$push-notification-driver-arrived\">Push Notification - Driver Arrived</a></li><li><a href=\"/sdd$excluding-virtual-packages-from-shipping-job-scheduler\">Excluding Virtual Packages From Shipping Job Scheduler</a></li></ul></li></ul></li><li><a href=\"/sdd$feature-scope\">Feature Scope</a></li><li><a href=\"/sdd$rfid\">RFID</a></li><li><a href=\"/sdd$uis-and-entities\">UIs and Entities</a></li><li><a href=\"/sdd$services\">Services</a></li><li><a href=\"/sdd$troubleshooting\">Troubleshooting</a></li></ul></div>\r\n\r\n<h3><a name=\"overview\" id=\"overview\"></a>Overview</h3>\r\n\r\n<p>Manhattan&nbsp;Active® Omni (MAO) same day delivery option allows customers to place orders to get them delivered on the same day or the next day when they are placed after the cutoff time. Such orders can be placed using any source such as a web store, kiosk in a store, call center etc.. with shipping method\\carrier-service level&nbsp;mapped to same day delivery service. Store Inventory & Fulfillment (SIF) supports&nbsp;fulfilling same day delivery orders allocated to the stores.</p>\r\n\r\n<p>Here's how it works:</p>\r\n\r\n<ul>\r\n\t<li>A customer places a&nbsp;‘Ship To Address’ order with shipping method or carrier-service level&nbsp;mapped to the same day delivery option</li>\r\n\t<li>The order is released to a store for&nbsp;processing.</li>\r\n\t<li>The SIF application determines that the order needs delivery on the same day and changes the delivery method of the fulfillment to&nbsp;'Pick Up At Store' as it resembles Pickups flow</li>\r\n\t<li>Stores are notified that a new same day delivery order has been created.</li>\r\n\t<li>A store associate picks the ordered items.</li>\r\n\t<li>The system gets a shipping label from the carrier&nbsp;and prints it. It's also a signal to the delivery carrier to broadcast a request to its pool of drivers.</li>\r\n\t<li>The delivery carrier&nbsp;assigns a driver who accepts the request to deliver the order to the destination address.</li>\r\n\t<li>The assigned driver arrives either&nbsp;in a store&nbsp;or a curbside pick-up area and provides the customer information&nbsp;to pickup the order</li>\r\n\t<li>A store associate&nbsp;finds the order placed by the specified customer, hands over the ordered items to the driver,&nbsp;and confirms the pick-up</li>\r\n\t<li>Order is updated as fulfilled</li>\r\n</ul>\r\n\r\n<p>This guide gives an overview of the same day delivery processing in&nbsp;Manhattan&nbsp;Active® Omni's Store Inventory & Fulfillment application.</p>\r\n\r\n<div class=\"warning\">Parcel:Carrier:UserExit:Ship should be implemented to get tracking number and shipping label from the same day delivery carrier. There are no same day delivery carriers&nbsp;supported out&nbsp;of the box.</div>\r\n\r\n<div class=\"warning\">Return labels are not supported within the same day delivery flow.</div>\r\n\r\n<h3><a name=\"same-day-delivery-in-store-fulfillment\" id=\"same-day-delivery-in-store-fulfillment\"></a>Same Day Delivery in Store Fulfillment</h3>\r\n\r\n<h4><a name=\"processing-of-same-day-delivery-fulfillments\" id=\"processing-of-same-day-delivery-fulfillments\"></a>Processing of Same Day Delivery Fulfillments</h4>\r\n\r\n<p>The same day&nbsp;delivery orders&nbsp;are processed by stores similar to pickup orders. The only difference is that the BOPIS orders are picked up by the customers and the same day delivery orders are picked up by the drivers. Also, the packing step is not performed on the same day delivery orders, unlike regular shipments. So, the same day delivery fulfillments are converted to pickup fulfillments by changing the&nbsp;delivery method of the fulfillment to Pick Up At Store. Additionally, the value of the IsSameDayDelivery attribute is set to true to differentiate between regular pickups and same day delivery fulfillments.&nbsp;In order for SIF to recognize a fulfillment as a same day delivery order,&nbsp;the carrier and service level used to ship should match the configured values&nbsp;in SIF. Refer to the <a href=\"/sdd$Same Day Delivery Carriers Configuration\">configuration&nbsp;section</a> for additional details.</p>\r\n\r\n<p>A push notification can be sent to the devices in a store saying that a new same day delivery fulfillment has been created. Refer to how to <a href=\"/sdd$New SDD orders push notification\">setup push notification template</a> for additional details.</p>\r\n\r\n<p>The Save Fulfillment service can be used if the Manhattan Active® Order is not licensed.</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> Store Fulfillment Tag Rules related to same day delivery should be setup under the PickUpAtStore tag group.</div>\r\n\r\n<h4><a name=\"prepare-pickups\" id=\"prepare-pickups\"></a>Prepare Pickups</h4>\r\n\r\n<p>Since the delivery method on the same day delivery&nbsp;is updated to PickUpAtStore, the fulfillment is listed on the Prepare Pickups list and not on the Prepare Shipments list. The same day delivery indicator is shown to differentiate between regular pickup and same day delivery fulfillments. Both regular pickups and same day delivery fulfillments can be picked together.&nbsp;</p>\r\n\r\n<div class=\"warning\">Up to 25 same day delivery fulfillments are supported on a picklist when the carrier provides a shipping label. This number can differ&nbsp;based on the device capabilities, whether a carrier provides shipping label or not, network latency etc.</div>\r\n\r\n<p>After the picking is completed, the carrier is contacted to get the shipping label and tracking number for the same day delivery fulfillment. Since these are shipment orders in reality, a virtual package is automatically created and the 'get tracking number' API is invoked. The Create Virtual Package and Get Tracking Number service is used for the same.&nbsp;</p>\r\n\r\n<p>The following are some of the package attributes and how they are populated by the system.</p>\r\n\r\n<ul>\r\n\t<li>Package Type: Package type configured as in&nbsp;the <a href=\"/sdd$Same Day Delivery Carriers Configuration\">configuration&nbsp;section</a></li>\r\n\t<li>Package Weight: Sum of unit weights of each unit picked. If the sum is 0 or not specified, 1 unit is used as the weight</li>\r\n\t<li>Package Details: A line is added for each fulfillment line with picked quantity &gt; 0</li>\r\n\t<li>Status: Built (2000.000)</li>\r\n</ul>\r\n\r\n<p>Since creating package and getting tracking number and shipping label takes time, a popover is shown in the SIF UI that shows progress for each same day delivery fulfillment. The failed fulfillments can be retried immediately or later using stage order printing\\reprint pickup slip option. Store associates should stage failed fulfillments separately so that they can use fulfillment Id on the delivery slip to reprint. The popover is shown only when the picklist has atleast one same day delivery fulfillment and was picked.</p>\r\n\r\n<p>The following documents may be printed after the successful creation of a virtual package.&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>The<strong> Delivery Slip</strong> is printed instead of a pickup slip that has customer information, shipping address, tracking number, order information, items to be delivered, and the financials related to the order.&nbsp;</li>\r\n\t<li>A<strong> Shipping Label</strong> is printed if the carrier provides one. It typically has the customer&nbsp;and ship-to information.</li>\r\n</ul>\r\n\r\n<p>The following are the conditions in which one or both documents are printed.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 916px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<td scope=\"row\">&nbsp;</td>\r\n\t\t\t<th scope=\"col\" style=\"width: 248px;\">Carrier provides shipping label</th>\r\n\t\t\t<th scope=\"col\" style=\"width: 237px;\">Carrier doesn't provide shipping label</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"row\" style=\"width: 389px;\">Call to get tracking # succeeded for same day delivery fulfillment</th>\r\n\t\t\t<td style=\"width: 246px;\">The delivery slip followed by the shipping label provided by the carrier is printed</td>\r\n\t\t\t<td style=\"width: 234px;\">Delivery Slip with tracking # alone is printed</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"row\" style=\"width: 389px;\">Call to get tracking # failed&nbsp;for same day delivery fulfillment</th>\r\n\t\t\t<td colspan=\"2\" rowspan=\"1\" style=\"width: 496px;\">Delivery Slip without a tracking number is printed</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"row\" style=\"width: 389px;\">Regular pickup&nbsp;picked along with the same day delivery fulfillments</th>\r\n\t\t\t<td colspan=\"2\" rowspan=\"1\" style=\"width: 496px;\">Pickup slip is printed</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> If both regular pickup&nbsp;and same day delivery fulfillments are picked in the same picklist, pickup slips are printed for the regular pickups and delivery slips with or without shipping labels are printed for same day delivery fulfillments.</div>\r\n\r\n<h4><a name=\"staging\" id=\"staging\"></a>Staging</h4>\r\n\r\n<p>When staging is performed after picking is completed,&nbsp;the same day delivery fulfillments are highlighted with an&nbsp;indicator. Both the listing and details page have an indicator. When printing is performed on the details page for a same day delivery fulfillment, the delivery slip is printed along with a shipping label when the carrier provides one.</p>\r\n\r\n<div class=\"tip\"><strong>Note: </strong>If the call to get a tracking number after completion of picking fails, it's reattempted by the reprint service.</div>\r\n\r\n<h4><a name=\"reprint-pickup-slip\" id=\"reprint-pickup-slip\"></a>Reprint Pickup Slip</h4>\r\n\r\n<p>If a reprint pickup slip is attempted,&nbsp;the same day delivery fulfillments are highlighted with an&nbsp;indicator. Both the listing and details page have an indicator. When printing is performed on the details page for a same day delivery fulfillment, the delivery slip is printed along with the shipping label when the carrier provides one.</p>\r\n\r\n<div class=\"tip\"><strong>Note: </strong>If the call to get a tracking number after completion of picking fails, it's reattempted by the reprint service.</div>\r\n\r\n<h4><a name=\"contact-customer-confirm-pickup-and-curbside-pickups\" id=\"contact-customer-confirm-pickup-and-curbside-pickups\"></a>Contact Customer, Confirm Pickup, and Curbside Pickups</h4>\r\n\r\n<p>When fulfillments are listed in Contact Customer, Confirm Pickup or Curbside Pickups,&nbsp;the same day delivery fulfillments are highlighted with an indicator. Order details are also highlighted by an indicator for same day delivery fulfillments. The virtual package and same day delivery fulfillment are marked as shipped after the driver picks up the order. However, the fulfillment status remains at 6000.000 (picked up).</p>\r\n\r\n<h4><a name=\"curbside-pickup\" id=\"curbside-pickup\"></a>Curbside Pickup</h4>\r\n\r\n<p>Since the fulfillment has been modeled as a pickup order, curbside pick up by drivers is applicable for same day delivery orders as well. Carriers can use Update Fulfillment and Notify&nbsp;service to indicate the driver's actions. The push notification messages can be setup using the notification templates. Refer to&nbsp;<a href=\"/sdd$Driver arrived push notification\">Arrived </a>and <a href=\"/sdd$Driver on the way push notification\">On The Way</a> configuration sections for additional details.&nbsp;&nbsp;</p>\r\n\r\n<h4><a name=\"substitution-during-picking\" id=\"substitution-during-picking\"></a>Substitution during Picking</h4>\r\n\r\n<p>In the event that a store associate is unable to fulfill an item ordered as part of a same-day delivery order, they can substitute it with a like or closely resembling alternative if substitution is enabled in their respective store. A substitution can be performed if the store associate fails to find the ordered item in their store due to an incorrect enterprise inventory picture or if the ordered item is found but is not in a sellable condition, thereby reducing order cancellations, protecting store and retailer revenue, and improving customer service.</p>\r\n\r\n<p>When an item is substituted, it shows up as “Substitute item (substituted for ordered item)” in the Item value of the out-of-the-box Delivery Slip. For example, if A is the originally ordered item, and it’s substituted by B, it's displayed as “B (substituted for A)”. No unit price and subtotal are displayed for substitute items. Also, the order totals at the bottom of the slip are displayed as blank when an order involved substitution.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: The Item value in the Delivery Slip needs to be limited to 45 characters, including the “substituted for” item details. Non adherence to this limit runs the risk of the item details spilling to the next column.</div>\r\n\r\n<p>For more details on substitution in stores, refer to its documentation <a href=\"https://omni.helpdocsonline.com/substitution-during-fulfillment$substitution-in-stores\">here</a>.</p>\r\n\r\n<h4><a name=\"fulfillment-outbound-and-events\" id=\"fulfillment-outbound-and-events\"></a>Fulfillment Outbound and Events</h4>\r\n\r\n<p>The following are the instances when the fulfillment outbounds and events are raised.</p>\r\n\r\n<ul>\r\n\t<li>When a tracking number is received from the carrier, a packed event is raised and an outbound is sent.\r\n\t<ul>\r\n\t\t<li>Delivery method Id is flipped back to ShipToAddress</li>\r\n\t\t<li>Fulfillment status would be 3000.000 (picked)</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>When pick up by driver is confirmed, a shipped event is raised and an outbound is sent.\r\n\t<ul>\r\n\t\t<li>Delivery method Id is flipped back to ShipToAddress</li>\r\n\t\t<li>Fulfillment status would be 6000.000 (picked up)</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<h4><a name=\"completed-shipments\" id=\"completed-shipments\"></a>Completed Shipments</h4>\r\n\r\n<p>Since virtual packages are created by the system and cannot be mapped to physical packaging, the Completed Shipments function&nbsp;does not list them. It's also recommended that the packages are not considered by the shipping job to ship them. Refer to the&nbsp;<a href=\"/sdd$Shipping job\">configuration section</a> for additional details.</p>\r\n\r\n<h3><a name=\"configuration\" id=\"configuration\"></a><a id=\"Configuration\" name=\"Configuration\"></a>Configuration</h3>\r\n\r\n<p>Below is a&nbsp;checklist of all configuration and&nbsp;interface mapping changes required to enable same day delivery.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"row\">Store Fulfillment</th>\r\n\t\t\t<td>\r\n\t\t\t<ul>\r\n\t\t\t\t<li>Map the same day delivery carriers and service levels&nbsp;in the Store Fulfillment Parameters UI</li>\r\n\t\t\t\t<li>Update<a href=\"https://omni.helpdocsonline.com/shipping-configuration$fulfillment-outbound-event-configuration\">fulfillment outbound configuration</a> if required</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h4><a name=\"store-fulfillment-configuration\" id=\"store-fulfillment-configuration\"></a>Store Fulfillment Configuration</h4>\r\n\r\n<p>Work with the services team to&nbsp;install the latest mobile application to use this feature.</p>\r\n\r\n<h5><a name=\"same-day-delivery-carriers\" id=\"same-day-delivery-carriers\"></a><a id=\"Same Day Delivery Carriers Configuration\" name=\"Same Day Delivery Carriers Configuration\"></a>Same Day Delivery Carriers</h5>\r\n\r\n<p>Configuration&nbsp;in the Same day Delivery Carriers tab within Store Fulfillment Parameters defines which of the carrier and its&nbsp;service level provides delivery on the same day. No value&nbsp;in this configuration disables the same day delivery operations within SIF. When a&nbsp;matching value is found in this configuration for ship via or carrier\\service level specified on the&nbsp;order, the fulfillment has to be processed as same day delivery order. The following attributes are found in the configuration:</p>\r\n\r\n<ul>\r\n\t<li><strong>Carrier</strong>: Must be a valid carrier defined in MAO. It's mandatory to provide the values for the Carrier Mapping Code and Provider while setting up carriers in the system. If Configuration UI is used, all configured carriers are listed to choose one.</li>\r\n\t<li><strong>Service level</strong>: Must be a valid service level defined in MAO and mapped to the selected carrier. Service level mapping code should be provided while setting up service levels in the system. If Configuration UI is used, all configured service levels, irrespective of the carrier selected, are listed to choose one. The selected service level must belong to the selected carrier, otherwise it is not allowed to save.</li>\r\n\t<li><strong>Provides shipping label</strong>: Indicates whether the selected same day delivery carrier provides shipping label along with tracking number or&nbsp;not. If set to false, the system generates delivery slip using the tracking number provided by the carrier. If the value is set to false and the carrier provides a shipping label, it's ignored.</li>\r\n\t<li><strong>Package type for virtual package</strong>: Must be a valid package type defined in MAO and mapped to the selected carrier.&nbsp;The selected package type must belong to the selected carrier, otherwise it's not allowed to be saved.</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note:</strong> Carrier Facility Accounts or Upgraded&nbsp;Facility Accounts should be setup for each store for same day delivery carriers.&nbsp;</div>\r\n\r\n<div class=\"tip\">Either the configuration UI or the below API can be used to setup this configuration.</div>\r\n\r\n<div class=\"computer_code\"><b>POST&nbsp;API Name: </b>{{url}}/fulfillment/api/fulfillment/fulfillmentParameters/save</div>\r\n\r\n<div class=\"computer_code\">{<br>\r\n&nbsp; .....<br>\r\n&nbsp; .....<br>\r\n&nbsp; \"FulfillmentParameterId\": \"Default_Fulfillment_Parameters\",<br>\r\n&nbsp; \"SameDayDeliveryCarriers\": [<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"ServiceLevel\": \"same day\",<br>\r\n&nbsp; &nbsp; &nbsp; \"ProvidesShippingLabel\": false,<br>\r\n&nbsp; &nbsp; &nbsp; \"PackageType\": \"virtual\",<br>\r\n&nbsp; &nbsp; &nbsp; \"Carrier\": \"Neighborhood Delivery\"<br>\r\n&nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"ServiceLevel\": \"same day\",<br>\r\n&nbsp; &nbsp; &nbsp; \"ProvidesShippingLabel\": true,<br>\r\n&nbsp; &nbsp; &nbsp; \"PackageType\": \"virtual\",<br>\r\n&nbsp; &nbsp; &nbsp; \"Carrier\": \"Local Delivery\"<br>\r\n&nbsp; &nbsp; }<br>\r\n&nbsp; ],<br>\r\n&nbsp; .....<br>\r\n&nbsp; .....<br>\r\n}</div>\r\n\r\n<h5><a name=\"push-notification-new-same-day-delivery-orders\" id=\"push-notification-new-same-day-delivery-orders\"></a><a id=\"New SDD orders push notification\" name=\"New SDD orders push notification\"></a>Push Notification - New Same Day Delivery Orders</h5>\r\n\r\n<p>A notification template must be setup in order to push the notification that same day delivery orders have been created to the devices of fulfilling&nbsp;store. New Pickup Orders notification is disabled&nbsp;for same day delivery fulfillments to avoid duplicate notifications. The following is the base template which can be modified.</p>\r\n\r\n<div class=\"computer_code\"><strong>POST API Name:&nbsp;</strong>{URL}/fulfillment/api/fulfillment/notificationTemplate/save</div>\r\n\r\n<div class=\"computer_code\">{<br>\r\n&nbsp; \"NotificationTemplateId\": \"PushNotificationForSameDayFulfillmentCreation\",<br>\r\n&nbsp; \"Name\": \"PushNotificationForSameDayFulfillmentCreation\",<br>\r\n&nbsp; \"TopicName\": \"common-notification.&lt;#if StackName??&gt;${StackName}.&lt;#else&gt;&lt;/#if&gt;${OrgId}.${ShipFromLocationId?replace(\\\":\\\",\\\"\\\")}\",<br>\r\n&nbsp; \"Description\": \"Push notification template for Same Day Fulfillment\",<br>\r\n&nbsp; \"NotificationTitle\": \"New same day delivery orders\",<br>\r\n&nbsp; \"ConditionalExpression\": \"DeliveryMethodId == \\\"PickUpAtStore\\\" && IsSameDayDelivery == true && MinStatusId == \\\"1000.000\\\" && MaxStatusId == \\\"1000.000\\\"\",<br>\r\n&nbsp; \"NotificationSound\": \"defaultnotificationsound.mp3\",<br>\r\n&nbsp; \"NotificationPriority\": \"High\",<br>\r\n&nbsp; \"NotificationPayload\": [<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"NotificationBody\": \"New same day delivery orders\",<br>\r\n&nbsp; &nbsp; &nbsp; \"PageId\": \"work-default-list\",<br>\r\n&nbsp; &nbsp; &nbsp; \"LocalizeLabelKey\": \"newSameDayDeliveryOrderLocalisedLabel\",<br>\r\n&nbsp; &nbsp; &nbsp; \"PagePayload\": [<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;\"PayloadValue\": true<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadKey\": \"workFlow\",<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadValue\": \"pick\"<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadKey\": \"toastCSS\",<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadValue\": \"pick\"<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; }<br>\r\n&nbsp; &nbsp; &nbsp; ]<br>\r\n&nbsp; &nbsp; }<br>\r\n&nbsp; ]<br>\r\n}</div>\r\n\r\n<div class=\"computer_code\"></div>\r\n\r\n<p>The following is the outbound queue&nbsp;that needs to be set</p>\r\n\r\n<div class=\"computer_code\"><strong>POST API Name:</strong>&nbsp;{URL}/fulfillment/api/ServiceDefinition/outBoundMessageType/import</div>\r\n\r\n<div class=\"computer_code\">{<br>\r\n&nbsp; \"MessageType\": \"PushNotificationMSGType\",<br>\r\n&nbsp; \"Transactional\": false,<br>\r\n&nbsp; \"PersistMessageToMsgStore\": false,<br>\r\n&nbsp; \"OutBoundQueues\": {<br>\r\n&nbsp; &nbsp; \"QueueName\": \"queue.PushNotification\"<br>\r\n&nbsp; }<br>\r\n}</div>\r\n\r\n<p>Extension point to message type mapping should be set as below.</p>\r\n\r\n<div class=\"computer_code\"><strong>POST API Name:&nbsp;</strong>{URL}/fulfillment/api/ServiceDefinition/extPointToMessageType/import</div>\r\n\r\n<div class=\"computer_code\">{<br>\r\n&nbsp; \"ExtensionPointId\": \"PushNotification\",<br>\r\n&nbsp; \"MessageType\": \"PushNotificationMSGType\"<br>\r\n}</div>\r\n\r\n<h5>&nbsp;</h5>\r\n\r\n<h5><a name=\"push-notification-driver-on-the-way\" id=\"push-notification-driver-on-the-way\"></a><a id=\"Driver on the way push notification\" name=\"Driver on the way push notification\"></a>Push Notification - Driver On The Way</h5>\r\n\r\n<p>A notification template must be setup in order to push the notification that a driver is on the way to pick up the same day delivery order&nbsp;to the devices of fulfilling store. The following is the base template which can be modified.</p>\r\n\r\n<div class=\"computer_code\"><strong>POST API Name:&nbsp;</strong>{URL}/fulfillment/api/fulfillment/notificationTemplate/save</div>\r\n\r\n<div class=\"computer_code\">{<br>\r\n&nbsp; \"NotificationTemplateId\": \"SameDayDeliveryDriverOnTheWayTemplate\",<br>\r\n&nbsp; \"Name\": \"SameDayDeliveryDriverOnTheWayTemplate\",<br>\r\n&nbsp; \"TopicName\": \"common-notification.&lt;#if StackName??&gt;${StackName}.&lt;#else&gt;&lt;/#if&gt;${OrgId}.${ShipFromLocationId?replace(\\\":\\\",\\\"\\\")}\",<br>\r\n&nbsp; \"Description\": \"Push notification template for Same Day Delivery Curbside Order whose driver is on the way\",<br>\r\n&nbsp; \"NotificationTitle\": \"Curbside pickup driver is on the way\",<br>\r\n&nbsp; \"ConditionalExpression\": \"DeliveryMethodId == \\\"PickUpAtStore\\\" && DeliveryMethodSubType == \\\"Curbside\\\" && IsSameDayDelivery == true && PickupArrivalDateTime == null && IsCustomerOnTheWay == true\",<br>\r\n&nbsp; \"NotificationSound\": \"curbsidenotificationsound.mp3\",<br>\r\n&nbsp; \"NotificationPriority\": \"High\",<br>\r\n&nbsp; \"NotificationPayload\": [<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"NotificationBody\": \"Curbside pickup driver is on the way\",<br>\r\n&nbsp; &nbsp; &nbsp; \"PageId\": \"work-default-list\",<br>\r\n&nbsp; &nbsp; &nbsp; \"LocalizeLabelKey\": \"sameDayDeliveryDriverOnTheWayLocalisedLabel\",<br>\r\n&nbsp; &nbsp; &nbsp; \"PagePayload\": [<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadKey\": \"toastCSS\",<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadValue\": \"curbside-on-the-way\"<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadValue\": true<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadKey\": \"workFlow\",<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadValue\": \"curbsidePickups\"<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; }<br>\r\n&nbsp; &nbsp; &nbsp; ]<br>\r\n&nbsp; &nbsp; }<br>\r\n&nbsp; ]<br>\r\n}</div>\r\n\r\n<div class=\"computer_code\"></div>\r\n\r\n<div class=\"warning\"><span style=\"color:#e74c3c;\">If the&nbsp;</span><a href=\"/sdd$New SDD orders push notification\"><span style=\"color:#e74c3c;\">Push Notification 'New Same day Delivery Orders' is not configured</span></a><span style=\"color:#e74c3c;\">, then configure the extension point to message type mapping and the outbound queue&nbsp;mentioned, as they are mandatory for the template-based push notifications to work.&nbsp;</span></div>\r\n\r\n<h5><a name=\"push-notification-driver-arrived\" id=\"push-notification-driver-arrived\"></a><a id=\"Driver arrived push notification\" name=\"Driver arrived push notification\"></a>Push Notification - Driver Arrived</h5>\r\n\r\n<p>A notification template must be setup in order to push the notification that a driver has arrived to pick up the same day delivery order for the day. The following is the base template which can be modified.</p>\r\n\r\n<div class=\"computer_code\"><strong>POST API Name:&nbsp;</strong>{URL}/fulfillment/api/fulfillment/notificationTemplate/save</div>\r\n\r\n<div class=\"computer_code\">{<br>\r\n&nbsp; \"NotificationTemplateId\": \"SameDayDeliveryDriverArrivedTemplate\",<br>\r\n&nbsp; \"Name\": \"SameDayDeliveryDriverArrivedTemplate\",<br>\r\n&nbsp; \"TopicName\": \"common-notification.&lt;#if StackName??&gt;${StackName}.&lt;#else&gt;&lt;/#if&gt;${OrgId}.${ShipFromLocationId?replace(\\\":\\\",\\\"\\\")}\",<br>\r\n&nbsp; \"Description\": \"Push notification template for Same Day Delivery Curbside Order whose driver has arrived\",<br>\r\n&nbsp; \"NotificationTitle\": \"Curbside pickup driver has arrived\",<br>\r\n&nbsp; \"ConditionalExpression\": \"DeliveryMethodId == \\\"PickUpAtStore\\\" && DeliveryMethodSubType == \\\"Curbside\\\" && IsSameDayDelivery == true && PickupArrivalDateTime != null\",<br>\r\n&nbsp; \"NotificationSound\": \"curbsidenotificationsound.mp3\",<br>\r\n&nbsp; \"NotificationPriority\": \"High\",<br>\r\n&nbsp; \"NotificationPayload\": [<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"NotificationBody\": \"Curbside pickup driver has arrived\",<br>\r\n&nbsp; &nbsp; &nbsp; \"PageId\": \"work-default-list\",<br>\r\n&nbsp; &nbsp; &nbsp; \"LocalizeLabelKey\": \"sameDayDeliveryDriverArrivedLocalisedLabel\",<br>\r\n&nbsp; &nbsp; &nbsp; \"PagePayload\": [<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadKey\": \"toastCSS\",<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadValue\": \"curbside\"<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadValue\": true<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadKey\": \"workFlow\",<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; \"PayloadValue\": \"curbsidePickups\"<br>\r\n&nbsp; &nbsp; &nbsp; &nbsp; }<br>\r\n&nbsp; &nbsp; &nbsp; ]<br>\r\n&nbsp; &nbsp; }<br>\r\n&nbsp; ]<br>\r\n}</div>\r\n\r\n<div class=\"computer_code\"></div>\r\n\r\n<div class=\"warning\">If the&nbsp;<a href=\"/sdd$New SDD orders push notification\"><span style=\"color:#e74c3c;\">Push Notification 'New Same Day Delivery Orders' is not configured</span></a>, then configure the extension point to message type mapping and the outbound queue mentioned, as they are mandatory for the template-based push notifications to work.&nbsp;&nbsp;</div>\r\n\r\n<h5><a name=\"excluding-virtual-packages-from-shipping-job-scheduler\" id=\"excluding-virtual-packages-from-shipping-job-scheduler\"></a><a id=\"Shipping job\" name=\"Shipping job\"></a>Excluding Virtual Packages From Shipping Job Scheduler</h5>\r\n\r\n<p>Virtual packages are marked as shipped when the assigned driver picks up the order in store or on the curbside. The following example shows how to exclude such packages from the shipping job</p>\r\n\r\n<div class=\"computer_code\">{<br>\r\n&nbsp; \"JobScheduleId\": \"trackAndShipPackagesJob1\",<br>\r\n&nbsp; \"JobTypeId\": \"trackAndShipPackagesJob\",<br>\r\n&nbsp; \"CronExpression\": \"0 0/15 * * * ?\",<br>\r\n&nbsp; \"TriggerKey\": \"trackAndShipPackagesTrigger1\",<br>\r\n&nbsp; \"JobParameters\": [<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"InputKey\": \"QueryString\",<br>\r\n&nbsp; &nbsp; &nbsp; \"InputValue\": \"SELECT DISTINCT fulfillment.fulfillmentId FROM FulfillmentEntity fulfillment JOIN fulfillment.packagesList packages WHERE fulfillment.shipFromLocationId in (:FacilityIds) AND fulfillment.minStatusId=':MinStatus' AND fulfillment.orgId=':OrgId' AND fulfillment.deliveryMethodId = ':DeliveryMethodId' AND fulfillment.isSameDayDelivery = false AND fulfillment.fulfillmentId=packages.fulfillmentId AND packages.packageStatus.packageStatusId=':PackageStatus' AND packages.trackingNumber IS NOT NULL AND packages.createdTimestamp &gt;= SQL('? - interval :NumberOfHours hour', CURRENT_TIMESTAMP)\"<br>\r\n&nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"InputKey\": \"PackageStatus\",<br>\r\n&nbsp; &nbsp; &nbsp; \"InputValue\": \"2000.000\"<br>\r\n&nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"InputKey\": \"FacilityIds\",<br>\r\n&nbsp; &nbsp; &nbsp; \"InputValue\": \"'FC3'\"<br>\r\n&nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"InputKey\": \"DeliveryMethodId\",<br>\r\n&nbsp; &nbsp; &nbsp; \"InputValue\": \"ShipToAddress\"<br>\r\n&nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"InputValue\": \"4000.000\",<br>\r\n&nbsp; &nbsp; &nbsp; \"InputKey\": \"MinStatus\"<br>\r\n&nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"InputKey\": \"NumberOfHours\",<br>\r\n&nbsp; &nbsp; &nbsp; \"InputValue\": \"48\"<br>\r\n&nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"InputKey\": \"AddSecurityCriteria\",<br>\r\n&nbsp; &nbsp; &nbsp; \"InputValue\": \"false\"<br>\r\n&nbsp; &nbsp; },<br>\r\n&nbsp; &nbsp; {<br>\r\n&nbsp; &nbsp; &nbsp; \"InputKey\": \"OrgId\",<br>\r\n&nbsp; &nbsp; &nbsp; \"InputValue\": \"dummyOrg\"<br>\r\n&nbsp; &nbsp; }<br>\r\n&nbsp; ]<br>\r\n}</div>\r\n\r\n<h3><a name=\"feature-scope\" id=\"feature-scope\"></a>Feature Scope</h3>\r\n\r\n<ul type=\"disc\">\r\n\t<li>Getting shipping document and tracking number from same day delivery carriers is not supported out&nbsp;of the box.&nbsp;Parcel:Carrier:UserExit:Ship&nbsp;should be implemented to communicate with carriers and get tracking number and shipping label</li>\r\n\t<li>Return labels are not printed for same day delivery fulfillments</li>\r\n\t<li>Only one shipping label\\delivery slip is printed for the entire fulfillment</li>\r\n\t<li>As driver information is not with the stores, they have to rely on the order information shared by the drivers to verify their authenticity.</li>\r\n\t<li>Delivery Instructions aren't shown on the delivery slip but are available for customization.</li>\r\n\t<li>Same day delivery fulfillments for which a generation of tracking number / shipping label had failed are not listed separately or flagged in existing functions.&nbsp;</li>\r\n\t<li>\r\n\t<p>Team-based picking is not supported for the same day delivery fulfillments</p>\r\n\t</li>\r\n</ul>\r\n\r\n<h3><a name=\"rfid\" id=\"rfid\"></a>RFID</h3>\r\n\r\n<p>Store associates can now fulfill Same Day Delivery orders by reading its unit-level RFID tags using an RFID reader. When the RFID flow is enabled for Same Day Delivery&nbsp;orders, immediately after an order is picked, its tags can be systemically captured and submitted using the&nbsp;<a href=\"https://omni.helpdocsonline.com/capture-rfid-tags\">RFID Tag Capture</a>&nbsp;process.</p>\r\n\r\n<p>Please refer to the&nbsp;<a href=\"https://omni.helpdocsonline.com/storerfid\">Store RFID guide</a>&nbsp;for more information on the RFID support available in Stores.</p>\r\n\r\n<h3><a name=\"uis-and-entities\" id=\"uis-and-entities\"></a>UIs and Entities</h3>\r\n\r\n<p>The configuration UIs mentioned in this document are listed in the following table,&nbsp;along with information to&nbsp;navigate&nbsp;to the API documentation.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><strong>UI Name</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Component</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Group</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Seed Data Present?</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Seed Data Profile</strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Store Fulfillment Parameters</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>FulfillmentParameter&nbsp;services</td>\r\n\t\t\t<td>Yes</td>\r\n\t\t\t<td>Base</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3><a name=\"services\" id=\"services\"></a>Services</h3>\r\n\r\n<p>The&nbsp;APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><strong><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service</font></strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Component</strong></th>\r\n\t\t\t<th scope=\"col\"><strong>Group</strong></th>\r\n\t\t\t<th scope=\"col\"><strong><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service Endpoint</font></strong></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Save Fulfillment</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>Fulfillment Services</td>\r\n\t\t\t<td>/fulfillment/api/fulfillment/fulfillment/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Create Virtual Package and Get Tracking Number</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>Fulfillment Process Services</td>\r\n\t\t\t<td>/fulfillment/api/fulfillment/createVirtualPackageAndGetTrackingNumber</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Update Fulfillment and Notify</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>Fulfillment Process Services</td>\r\n\t\t\t<td>/fulfillment/api/fulfillment/fulfillment/updatePickupFulfillmentsAndNotify</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h3><a name=\"troubleshooting\" id=\"troubleshooting\"></a>Troubleshooting</h3>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\">Issue</th>\r\n\t\t\t<th scope=\"col\">Troubleshooting Tip</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p>Fulfillment created doesn't have</p>\r\n\r\n\t\t\t<ul>\r\n\t\t\t\t<li>delivery method as PickUpAtStore</li>\r\n\t\t\t\t<li>isSameDayDelivery as False</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Check the following</p>\r\n\r\n\t\t\t<ul>\r\n\t\t\t\t<li>If Ship Via on the order (mapped as shipping method)&nbsp;or stand-alone fulfillment is mentioned, carrier and service level corresponding to ship via are mentioned&nbsp;in the Same day Delivery Carriers tab within Store Fulfillment Parameters&nbsp;</li>\r\n\t\t\t\t<li>If Ship Via on the order or fulfillment is not mentioned, the carrier and service level mentioned on the order or fulfillment&nbsp;are mentioned in the Same day Delivery Carriers tab within Store Fulfillment Parameters</li>\r\n\t\t\t\t<li>The Carrier configuration has provider and carrier mapping code&nbsp;specified</li>\r\n\t\t\t\t<li>The Service Level configuration has a service-level mapping code&nbsp;specified</li>\r\n\t\t\t\t<li>Carrier Package Type mentioned against&nbsp;carrier, service level in Same day Delivery Carriers tab within Store Fulfillment Parameters has carrier package type Id specified</li>\r\n\t\t\t\t<li>The parcel cache has been cleared</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Shipping label generation is failing</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Check the following</p>\r\n\r\n\t\t\t<ul>\r\n\t\t\t\t<li>Parcel:Carrier:UserExit:Ship user exit has been implemented</li>\r\n\t\t\t\t<li>The custom implementation is discoverable by MAO\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Fulfillment Service Definition should have a valid entry for&nbsp;ComponentId = Parcel and&nbsp;ServiceId = ParcelShipUE</li>\r\n\t\t\t\t\t<li>Extension handler has registered extension point for&nbsp;Parcel:Carrier:UserExit:Ship</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t</li>\r\n\t\t\t\t<li>The parcel cache has been cleared</li>\r\n\t\t\t</ul>\r\n\r\n\t\t\t<div class=\"tip\"><strong>Tip:</strong> Even if these configurations are valid, there can still be validation failures on the carrier side. Follow the error message to correct the data. For time out issues, try to simplify logic within custom component and try to set a SLA with carriers.</div>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>The shipping label is not printed but the delivery slip with tracking # is printed.</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Check the following</p>\r\n\r\n\t\t\t<ul>\r\n\t\t\t\t<li>Provides Shipping Label is checked (True)&nbsp;against&nbsp;carrier, service level in Same day Delivery Carriers tab within Store Fulfillment Parameters</li>\r\n\t\t\t</ul>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<div id=\"\" style=\"left: 15px; top: 9536.36px;\">&nbsp;</div>\r\n\r\n<div id=\"\" style=\"left: 15px; top: 9536.36px;\">&nbsp;</div>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 38895,
  "scraped_at": "2025-08-09T22:04:34.441538",
  "content_clean": "Home ››Manhattan Active® Omni››Store››Process & Configuration Guides››Store Inventory & Fulfillment››Store Order Fulfillment ››Same Day Delivery Same Day Delivery OverviewSame Day Delivery in Store FulfillmentProcessing of Same Day Delivery FulfillmentsPrepare PickupsStagingReprint Pickup SlipContact Customer, Confirm Pickup, and Curbside PickupsCurbside PickupSubstitution during PickingFulfillment Outbound and EventsCompleted ShipmentsConfigurationStore Fulfillment ConfigurationSame Day Delivery CarriersPush Notification - New Same Day Delivery OrdersPush Notification - Driver On The WayPush Notification - Driver ArrivedExcluding Virtual Packages From Shipping Job SchedulerFeature ScopeRFIDUIs and EntitiesServicesTroubleshooting Overview Manhattan Active® Omni (MAO) same day delivery option allows customers to place orders to get them delivered on the same day or the next day when they are placed after the cutoff time. Such orders can be placed using any source such as a web store, kiosk in a store, call center etc.. with shipping method\\carrier-service level mapped to same day delivery service. Store Inventory & Fulfillment (SIF) supports fulfilling same day delivery orders allocated to the stores. Here's how it works: A customer places a ‘Ship To Address’ order with shipping method or carrier-service level mapped to the same day delivery option The order is released to a store for processing. The SIF application determines that the order needs delivery on the same day and changes the delivery method of the fulfillment to 'Pick Up At Store' as it resembles Pickups flow Stores are notified that a new same day delivery order has been created. A store associate picks the ordered items. The system gets a shipping label from the carrier and prints it. It's also a signal to the delivery carrier to broadcast a request to its pool of drivers. The delivery carrier assigns a driver who accepts the request to deliver the order to the destination address. The assigned driver arrives either in a store or a curbside pick-up area and provides the customer information to pickup the order A store associate finds the order placed by the specified customer, hands over the ordered items to the driver, and confirms the pick-up Order is updated as fulfilled This guide gives an overview of the same day delivery processing in Manhattan Active® Omni's Store Inventory & Fulfillment application. Parcel:Carrier:UserExit:Ship should be implemented to get tracking number and shipping label from the same day delivery carrier. There are no same day delivery carriers supported out of the box. Return labels are not supported within the same day delivery flow. Same Day Delivery in Store Fulfillment Processing of Same Day Delivery Fulfillments The same day delivery orders are processed by stores similar to pickup orders. The only difference is that the BOPIS orders are picked up by the customers and the same day delivery orders are picked up by the drivers. Also, the packing step is not performed on the same day delivery orders, unlike regular shipments. So, the same day delivery fulfillments are converted to pickup fulfillments by changing the delivery method of the fulfillment to Pick Up At Store. Additionally, the value of the IsSameDayDelivery attribute is set to true to differentiate between regular pickups and same day delivery fulfillments. In order for SIF to recognize a fulfillment as a same day delivery order, the carrier and service level used to ship should match the configured values in SIF. Refer to the configuration section for additional details. A push notification can be sent to the devices in a store saying that a new same day delivery fulfillment has been created. Refer to how to setup push notification template for additional details. The Save Fulfillment service can be used if the Manhattan Active® Order is not licensed. Note: Store Fulfillment Tag Rules related to same day delivery should be setup under the PickUpAtStore tag group. Prepare Pickups Since the delivery method on the same day delivery is updated to PickUpAtStore, the fulfillment is listed on the Prepare Pickups list and not on the Prepare Shipments list. The same day delivery indicator is shown to differentiate between regular pickup and same day delivery fulfillments. Both regular pickups and same day delivery fulfillments can be picked together. Up to 25 same day delivery fulfillments are supported on a picklist when the carrier provides a shipping label. This number can differ based on the device capabilities, whether a carrier provides shipping label or not, network latency etc. After the picking is completed, the carrier is contacted to get the shipping label and tracking number for the same day delivery fulfillment. Since these are shipment orders in reality, a virtual package is automatically created and the 'get tracking number' API is invoked. The Create Virtual Package and Get Tracking Number service is used for the same. The following are some of the package attributes and how they are populated by the system. Package Type: Package type configured as in the configuration section Package Weight: Sum of unit weights of each unit picked. If the sum is 0 or not specified, 1 unit is used as the weight Package Details: A line is added for each fulfillment line with picked quantity > 0 Status: Built (2000.000) Since creating package and getting tracking number and shipping label takes time, a popover is shown in the SIF UI that shows progress for each same day delivery fulfillment. The failed fulfillments can be retried immediately or later using stage order printing\\reprint pickup slip option. Store associates should stage failed fulfillments separately so that they can use fulfillment Id on the delivery slip to reprint. The popover is shown only when the picklist has atleast one same day delivery fulfillment and was picked. The following documents may be printed after the successful creation of a virtual package. The Delivery Slip is printed instead of a pickup slip that has customer information, shipping address, tracking number, order information, items to be delivered, and the financials related to the order. A Shipping Label is printed if the carrier provides one. It typically has the customer and ship-to information. The following are the conditions in which one or both documents are printed. Carrier provides shipping label Carrier doesn't provide shipping label Call to get tracking # succeeded for same day delivery fulfillment The delivery slip followed by the shipping label provided by the carrier is printed Delivery Slip with tracking # alone is printed Call to get tracking # failed for same day delivery fulfillment Delivery Slip without a tracking number is printed Regular pickup picked along with the same day delivery fulfillments Pickup slip is printed Note: If both regular pickup and same day delivery fulfillments are picked in the same picklist, pickup slips are printed for the regular pickups and delivery slips with or without shipping labels are printed for same day delivery fulfillments. Staging When staging is performed after picking is completed, the same day delivery fulfillments are highlighted with an indicator. Both the listing and details page have an indicator. When printing is performed on the details page for a same day delivery fulfillment, the delivery slip is printed along with a shipping label when the carrier provides one. Note: If the call to get a tracking number after completion of picking fails, it's reattempted by the reprint service. Reprint Pickup Slip If a reprint pickup slip is attempted, the same day delivery fulfillments are highlighted with an indicator. Both the listing and details page have an indicator. When printing is performed on the details page for a same day delivery fulfillment, the delivery slip is printed along with the shipping label when the carrier provides one. Note: If the call to get a tracking number after completion of picking fails, it's reattempted by the reprint service. Contact Customer, Confirm Pickup, and Curbside Pickups When fulfillments are listed in Contact Customer, Confirm Pickup or Curbside Pickups, the same day delivery fulfillments are highlighted with an indicator. Order details are also highlighted by an indicator for same day delivery fulfillments. The virtual package and same day delivery fulfillment are marked as shipped after the driver picks up the order. However, the fulfillment status remains at 6000.000 (picked up). Curbside Pickup Since the fulfillment has been modeled as a pickup order, curbside pick up by drivers is applicable for same day delivery orders as well. Carriers can use Update Fulfillment and Notify service to indicate the driver's actions. The push notification messages can be setup using the notification templates. Refer to Arrived and On The Way configuration sections for additional details. Substitution during Picking In the event that a store associate is unable to fulfill an item ordered as part of a same-day delivery order, they can substitute it with a like or closely resembling alternative if substitution is enabled in their respective store. A substitution can be performed if the store associate fails to find the ordered item in their store due to an incorrect enterprise inventory picture or if the ordered item is found but is not in a sellable condition, thereby reducing order cancellations, protecting store and retailer revenue, and improving customer service. When an item is substituted, it shows up as “Substitute item (substituted for ordered item)” in the Item value of the out-of-the-box Delivery Slip. For example, if A is the originally ordered item, and it’s substituted by B, it's displayed as “B (substituted for A)”. No unit price and subtotal are displayed for substitute items. Also, the order totals at the bottom of the slip are displayed as blank when an order involved substitution. Note: The Item value in the Delivery Slip needs to be limited to 45 characters, including the “substituted for” item details. Non adherence to this limit runs the risk of the item details spilling to the next column. For more details on substitution in stores, refer to its documentation here. Fulfillment Outbound and Events The following are the instances when the fulfillment outbounds and events are raised. When a tracking number is received from the carrier, a packed event is raised and an outbound is sent. Delivery method Id is flipped back to ShipToAddress Fulfillment status would be 3000.000 (picked) When pick up by driver is confirmed, a shipped event is raised and an outbound is sent. Delivery method Id is flipped back to ShipToAddress Fulfillment status would be 6000.000 (picked up) Completed Shipments Since virtual packages are created by the system and cannot be mapped to physical packaging, the Completed Shipments function does not list them. It's also recommended that the packages are not considered by the shipping job to ship them. Refer to the configuration section for additional details. Configuration Below is a checklist of all configuration and interface mapping changes required to enable same day delivery. Store Fulfillment Map the same day delivery carriers and service levels in the Store Fulfillment Parameters UI Updatefulfillment outbound configuration if required Store Fulfillment Configuration Work with the services team to install the latest mobile application to use this feature. Same Day Delivery Carriers Configuration in the Same day Delivery Carriers tab within Store Fulfillment Parameters defines which of the carrier and its service level provides delivery on the same day. No value in this configuration disables the same day delivery operations within SIF. When a matching value is found in this configuration for ship via or carrier\\service level specified on the order, the fulfillment has to be processed as same day delivery order. The following attributes are found in the configuration: Carrier: Must be a valid carrier defined in MAO. It's mandatory to provide the values for the Carrier Mapping Code and Provider while setting up carriers in the system. If Configuration UI is used, all configured carriers are listed to choose one. Service level: Must be a valid service level defined in MAO and mapped to the selected carrier. Service level mapping code should be provided while setting up service levels in the system. If Configuration UI is used, all configured service levels, irrespective of the carrier selected, are listed to choose one. The selected service level must belong to the selected carrier, otherwise it is not allowed to save. Provides shipping label: Indicates whether the selected same day delivery carrier provides shipping label along with tracking number or not. If set to false, the system generates delivery slip using the tracking number provided by the carrier. If the value is set to false and the carrier provides a shipping label, it's ignored. Package type for virtual package: Must be a valid package type defined in MAO and mapped to the selected carrier. The selected package type must belong to the selected carrier, otherwise it's not allowed to be saved. Note: Carrier Facility Accounts or Upgraded Facility Accounts should be setup for each store for same day delivery carriers. Either the configuration UI or the below API can be used to setup this configuration. POST API Name: {{url}}/fulfillment/api/fulfillment/fulfillmentParameters/save { ..... ..... \"FulfillmentParameterId\": \"Default_Fulfillment_Parameters\", \"SameDayDeliveryCarriers\": [ { \"ServiceLevel\": \"same day\", \"ProvidesShippingLabel\": false, \"PackageType\": \"virtual\", \"Carrier\": \"Neighborhood Delivery\" }, { \"ServiceLevel\": \"same day\", \"ProvidesShippingLabel\": true, \"PackageType\": \"virtual\", \"Carrier\": \"Local Delivery\" } ], ..... ..... } Push Notification - New Same Day Delivery Orders A notification template must be setup in order to push the notification that same day delivery orders have been created to the devices of fulfilling store. New Pickup Orders notification is disabled for same day delivery fulfillments to avoid duplicate notifications. The following is the base template which can be modified. POST API Name: {URL}/fulfillment/api/fulfillment/notificationTemplate/save { \"NotificationTemplateId\": \"PushNotificationForSameDayFulfillmentCreation\", \"Name\": \"PushNotificationForSameDayFulfillmentCreation\", \"TopicName\": \"common-notification.<#if StackName??>${StackName}.<#else></#if>${OrgId}.${ShipFromLocationId?replace(\\\":\\\",\\\"\\\")}\", \"Description\": \"Push notification template for Same Day Fulfillment\", \"NotificationTitle\": \"New same day delivery orders\", \"ConditionalExpression\": \"DeliveryMethodId == \\\"PickUpAtStore\\\" && IsSameDayDelivery == true && MinStatusId == \\\"1000.000\\\" && MaxStatusId == \\\"1000.000\\\"\", \"NotificationSound\": \"defaultnotificationsound.mp3\", \"NotificationPriority\": \"High\", \"NotificationPayload\": [ { \"NotificationBody\": \"New same day delivery orders\", \"PageId\": \"work-default-list\", \"LocalizeLabelKey\": \"newSameDayDeliveryOrderLocalisedLabel\", \"PagePayload\": [ { \"PayloadValue\": true }, { \"PayloadKey\": \"workFlow\", \"PayloadValue\": \"pick\" }, { \"PayloadKey\": \"toastCSS\", \"PayloadValue\": \"pick\" } ] } ] } The following is the outbound queue that needs to be set POST API Name: {URL}/fulfillment/api/ServiceDefinition/outBoundMessageType/import { \"MessageType\": \"PushNotificationMSGType\", \"Transactional\": false, \"PersistMessageToMsgStore\": false, \"OutBoundQueues\": { \"QueueName\": \"queue.PushNotification\" } } Extension point to message type mapping should be set as below. POST API Name: {URL}/fulfillment/api/ServiceDefinition/extPointToMessageType/import { \"ExtensionPointId\": \"PushNotification\", \"MessageType\": \"PushNotificationMSGType\" } Push Notification - Driver On The Way A notification template must be setup in order to push the notification that a driver is on the way to pick up the same day delivery order to the devices of fulfilling store. The following is the base template which can be modified. POST API Name: {URL}/fulfillment/api/fulfillment/notificationTemplate/save { \"NotificationTemplateId\": \"SameDayDeliveryDriverOnTheWayTemplate\", \"Name\": \"SameDayDeliveryDriverOnTheWayTemplate\", \"TopicName\": \"common-notification.<#if StackName??>${StackName}.<#else></#if>${OrgId}.${ShipFromLocationId?replace(\\\":\\\",\\\"\\\")}\", \"Description\": \"Push notification template for Same Day Delivery Curbside Order whose driver is on the way\", \"NotificationTitle\": \"Curbside pickup driver is on the way\", \"ConditionalExpression\": \"DeliveryMethodId == \\\"PickUpAtStore\\\" && DeliveryMethodSubType == \\\"Curbside\\\" && IsSameDayDelivery == true && PickupArrivalDateTime == null && IsCustomerOnTheWay == true\", \"NotificationSound\": \"curbsidenotificationsound.mp3\", \"NotificationPriority\": \"High\", \"NotificationPayload\": [ { \"NotificationBody\": \"Curbside pickup driver is on the way\", \"PageId\": \"work-default-list\", \"LocalizeLabelKey\": \"sameDayDeliveryDriverOnTheWayLocalisedLabel\", \"PagePayload\": [ { \"PayloadKey\": \"toastCSS\", \"PayloadValue\": \"curbside-on-the-way\" }, { \"PayloadValue\": true }, { \"PayloadKey\": \"workFlow\", \"PayloadValue\": \"curbsidePickups\" } ] } ] } If the Push Notification 'New Same day Delivery Orders' is not configured, then configure the extension point to message type mapping and the outbound queue mentioned, as they are mandatory for the template-based push notifications to work. Push Notification - Driver Arrived A notification template must be setup in order to push the notification that a driver has arrived to pick up the same day delivery order for the day. The following is the base template which can be modified. POST API Name: {URL}/fulfillment/api/fulfillment/notificationTemplate/save { \"NotificationTemplateId\": \"SameDayDeliveryDriverArrivedTemplate\", \"Name\": \"SameDayDeliveryDriverArrivedTemplate\", \"TopicName\": \"common-notification.<#if StackName??>${StackName}.<#else></#if>${OrgId}.${ShipFromLocationId?replace(\\\":\\\",\\\"\\\")}\", \"Description\": \"Push notification template for Same Day Delivery Curbside Order whose driver has arrived\", \"NotificationTitle\": \"Curbside pickup driver has arrived\", \"ConditionalExpression\": \"DeliveryMethodId == \\\"PickUpAtStore\\\" && DeliveryMethodSubType == \\\"Curbside\\\" && IsSameDayDelivery == true && PickupArrivalDateTime != null\", \"NotificationSound\": \"curbsidenotificationsound.mp3\", \"NotificationPriority\": \"High\", \"NotificationPayload\": [ { \"NotificationBody\": \"Curbside pickup driver has arrived\", \"PageId\": \"work-default-list\", \"LocalizeLabelKey\": \"sameDayDeliveryDriverArrivedLocalisedLabel\", \"PagePayload\": [ { \"PayloadKey\": \"toastCSS\", \"PayloadValue\": \"curbside\" }, { \"PayloadValue\": true }, { \"PayloadKey\": \"workFlow\", \"PayloadValue\": \"curbsidePickups\" } ] } ] } If the Push Notification 'New Same Day Delivery Orders' is not configured, then configure the extension point to message type mapping and the outbound queue mentioned, as they are mandatory for the template-based push notifications to work. Excluding Virtual Packages From Shipping Job Scheduler Virtual packages are marked as shipped when the assigned driver picks up the order in store or on the curbside. The following example shows how to exclude such packages from the shipping job { \"JobScheduleId\": \"trackAndShipPackagesJob1\", \"JobTypeId\": \"trackAndShipPackagesJob\", \"CronExpression\": \"0 0/15 * * * ?\", \"TriggerKey\": \"trackAndShipPackagesTrigger1\", \"JobParameters\": [ { \"InputKey\": \"QueryString\", \"InputValue\": \"SELECT DISTINCT fulfillment.fulfillmentId FROM FulfillmentEntity fulfillment JOIN fulfillment.packagesList packages WHERE fulfillment.shipFromLocationId in (:FacilityIds) AND fulfillment.minStatusId=':MinStatus' AND fulfillment.orgId=':OrgId' AND fulfillment.deliveryMethodId = ':DeliveryMethodId' AND fulfillment.isSameDayDelivery = false AND fulfillment.fulfillmentId=packages.fulfillmentId AND packages.packageStatus.packageStatusId=':PackageStatus' AND packages.trackingNumber IS NOT NULL AND packages.createdTimestamp >= SQL('? - interval :NumberOfHours hour', CURRENT_TIMESTAMP)\" }, { \"InputKey\": \"PackageStatus\", \"InputValue\": \"2000.000\" }, { \"InputKey\": \"FacilityIds\", \"InputValue\": \"'FC3'\" }, { \"InputKey\": \"DeliveryMethodId\", \"InputValue\": \"ShipToAddress\" }, { \"InputValue\": \"4000.000\", \"InputKey\": \"MinStatus\" }, { \"InputKey\": \"NumberOfHours\", \"InputValue\": \"48\" }, { \"InputKey\": \"AddSecurityCriteria\", \"InputValue\": \"false\" }, { \"InputKey\": \"OrgId\", \"InputValue\": \"dummyOrg\" } ] } Feature Scope Getting shipping document and tracking number from same day delivery carriers is not supported out of the box. Parcel:Carrier:UserExit:Ship should be implemented to communicate with carriers and get tracking number and shipping label Return labels are not printed for same day delivery fulfillments Only one shipping label\\delivery slip is printed for the entire fulfillment As driver information is not with the stores, they have to rely on the order information shared by the drivers to verify their authenticity. Delivery Instructions aren't shown on the delivery slip but are available for customization. Same day delivery fulfillments for which a generation of tracking number / shipping label had failed are not listed separately or flagged in existing functions. Team-based picking is not supported for the same day delivery fulfillments RFID Store associates can now fulfill Same Day Delivery orders by reading its unit-level RFID tags using an RFID reader. When the RFID flow is enabled for Same Day Delivery orders, immediately after an order is picked, its tags can be systemically captured and submitted using the RFID Tag Capture process. Please refer to the Store RFID guide for more information on the RFID support available in Stores. UIs and Entities The configuration UIs mentioned in this document are listed in the following table, along with information to navigate to the API documentation. UI Name Component Group Seed Data Present? Seed Data Profile Store Fulfillment Parameters Fulfillment FulfillmentParameter services Yes Base Services The APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on each service. Service Component Group Service Endpoint Save Fulfillment Fulfillment Fulfillment Services /fulfillment/api/fulfillment/fulfillment/save Create Virtual Package and Get Tracking Number Fulfillment Fulfillment Process Services /fulfillment/api/fulfillment/createVirtualPackageAndGetTrackingNumber Update Fulfillment and Notify Fulfillment Fulfillment Process Services /fulfillment/api/fulfillment/fulfillment/updatePickupFulfillmentsAndNotify Troubleshooting Issue Troubleshooting Tip Fulfillment created doesn't have delivery method as PickUpAtStore isSameDayDelivery as False Check the following If Ship Via on the order (mapped as shipping method) or stand-alone fulfillment is mentioned, carrier and service level corresponding to ship via are mentioned in the Same day Delivery Carriers tab within Store Fulfillment Parameters If Ship Via on the order or fulfillment is not mentioned, the carrier and service level mentioned on the order or fulfillment are mentioned in the Same day Delivery Carriers tab within Store Fulfillment Parameters The Carrier configuration has provider and carrier mapping code specified The Service Level configuration has a service-level mapping code specified Carrier Package Type mentioned against carrier, service level in Same day Delivery Carriers tab within Store Fulfillment Parameters has carrier package type Id specified The parcel cache has been cleared Shipping label generation is failing Check the following Parcel:Carrier:UserExit:Ship user exit has been implemented The custom implementation is discoverable by MAO Fulfillment Service Definition should have a valid entry for ComponentId = Parcel and ServiceId = ParcelShipUE Extension handler has registered extension point for Parcel:Carrier:UserExit:Ship The parcel cache has been cleared Tip: Even if these configurations are valid, there can still be validation failures on the carrier side. Follow the error message to correct the data. For time out issues, try to simplify logic within custom component and try to set a SLA with carriers. The shipping label is not printed but the delivery slip with tracking # is printed. Check the following Provides Shipping Label is checked (True) against carrier, service level in Same day Delivery Carriers tab within Store Fulfillment Parameters"
}