{
  "id": "1939275",
  "permalink": "storecustomerengagementprocessguide",
  "title": "Store Customer Engagement Process Guide",
  "type": "topic",
  "level": 7,
  "path": "Manhattan Active® Omni/Store/Process & Configuration Guides/Point of Sale/POS Classic Guides/Store Customer Engagement/Store Customer Engagement/Process",
  "raw_item": {
    "id": "1939275",
    "text": "Process",
    "title": "Process",
    "permalink": "storecustomerengagementprocessguide",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "193676",
    "parent": "f;193676",
    "created_date": "1510726727",
    "modified_date": "1711362103",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "1"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158737\" href=\"/point-of-sale\" class=\"breadcrumb-links\">Point of Sale</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2225114\" href=\"/process-configuration-guides-4\" class=\"breadcrumb-links\">POS Classic Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2672968\" href=\"/store-customer-engagement-2\" class=\"breadcrumb-links\">Store Customer Engagement</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158560\" href=\"/store-customer-engagement\" class=\"breadcrumb-links\">Store Customer Engagement</a></li><li> <span>››</span>Store Customer Engagement Process Guide</li></ul>  \t\r\n\t\t<h2>&nbsp;Store Customer Engagement</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/storecustomerengagementprocessguide$overview\">Overview</a></li><li><a href=\"/storecustomerengagementprocessguide$feature-summary-nbsp-nbsp\">Feature Summary&nbsp;&nbsp;</a></li><li><a href=\"/storecustomerengagementprocessguide$dashboard\">Dashboard</a><ul><li><a href=\"/storecustomerengagementprocessguide$social-media\">Social Media</a></li><li><a href=\"/storecustomerengagementprocessguide$customer-purchases\">Customer Purchases</a><ul><li><a href=\"/storecustomerengagementprocessguide$order-details\">Order Details:</a></li></ul></li><li><a href=\"/storecustomerengagementprocessguide$cases\">Cases</a><ul><li><a href=\"/storecustomerengagementprocessguide$viewing-open-order-cases\">Viewing Open Order Cases:</a></li></ul></li><li><a href=\"/storecustomerengagementprocessguide$activity\">Activity</a><ul><li><a href=\"/storecustomerengagementprocessguide$appointments-nbsp\">Appointments&nbsp;</a></li><li><a href=\"/storecustomerengagementprocessguide$tasks\">Tasks</a></li><li><a href=\"/storecustomerengagementprocessguide$phone-log\">Phone Log</a></li><li><a href=\"/storecustomerengagementprocessguide$email-log\">Email Log</a></li><li><a href=\"/storecustomerengagementprocessguide$notes\">Notes</a></li></ul></li><li><a href=\"/storecustomerengagementprocessguide$wishlist\">Wishlist</a></li><li><a href=\"/storecustomerengagementprocessguide$workspace\">Workspace</a></li><li><a href=\"/storecustomerengagementprocessguide$loyalty\">Loyalty</a><ul><li><a href=\"/storecustomerengagementprocessguide$loyalty-status\">Loyalty Status</a></li></ul></li><li><a href=\"/storecustomerengagementprocessguide$interactions\">Interactions</a><ul><li><a href=\"/storecustomerengagementprocessguide$opt-in-out\">Opt-In/Out</a></li></ul></li><li><a href=\"/storecustomerengagementprocessguide$profile\">Profile</a></li><li><a href=\"/storecustomerengagementprocessguide$active-customer-drop-down\">Active Customer Drop-down</a></li><li><a href=\"/storecustomerengagementprocessguide$waiting-room\">Waiting Room</a></li><li><a href=\"/storecustomerengagementprocessguide$lookbook\">Lookbook</a><ul><li><a href=\"/storecustomerengagementprocessguide$lookbook-nbsp-global-configuration-and-grants\">Lookbook&nbsp;global configuration and grants</a></li><li><a href=\"/storecustomerengagementprocessguide$creating-a-new-lookbook\">Creating a new lookbook</a></li><li><a href=\"/storecustomerengagementprocessguide$sharing-a-lookbook-nbsp-with-customer\">Sharing a lookbook&nbsp;with customer</a></li><li><a href=\"/storecustomerengagementprocessguide$accessing-lookbooks-on-user-customer-nbsp-menu\">Accessing lookbooks on user/customer&nbsp;menu</a></li><li><a href=\"/storecustomerengagementprocessguide$editing-and-deleting-nbsp-lookbooks\">Editing and deleting&nbsp;lookbooks</a></li></ul></li><li><a href=\"/storecustomerengagementprocessguide$services\">Services</a></li><li><a href=\"/storecustomerengagementprocessguide$profile-purpose\">Profile Purpose</a></li></ul></li></ul></div>\r\n\r\n<h3><a name=\"overview\" id=\"overview\"></a>Overview</h3>\r\n\r\n<p>Store Customer Engagement provides retailers and their employees an enhanced view of their customers.&nbsp; Retailers can now use Store Customer Engagement to view information about the customer such as shipping and contact preferences, social media influence, and open cases logged by the call center agents against an order. In the past, Call Center Customer Engagement has been used by call center agents to better serve the customers who call in to place orders or ask for information. With Store Customer Engagement in stores, retailers can now use this similar information to provide a better in-store experience for their customers. Users can have a quick overview of the customers they are currently working with in the store. Also, they can use this information to prepare for an upcoming customer visit.&nbsp; This feature requires additional licensing beyond the standard POS License.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h3><a name=\"feature-summary-nbsp-nbsp\" id=\"feature-summary-nbsp-nbsp\"></a>Feature Summary&nbsp;&nbsp;</h3>\r\n\r\n<p>Store Customer Engagement includes all the functionality of our standard POS Engagement feature plus the following:</p>\r\n\r\n<ul type=\"disc\">\r\n\t<li>Configurable customer dashboard:</li>\r\n\t<li>Configurable customer sub-header:Customer cases:</li>\r\n\t<li>Enhanced customer email:</li>\r\n\t<li>Enhanced order details:</li>\r\n</ul>\r\n\r\n<h3><a name=\"dashboard\" id=\"dashboard\"></a><a id=\"Dashboard\" name=\"Dashboard\"></a><span style=\"font-size:20px;\">Dashboard</span></h3>\r\n\r\n<p>The customer dashboard is the landing page when navigating to a customer record. It provides a high level overview of the customer to allow better customer service by the store associates.</p>\r\n\r\n<p>When the Dashboard is configured, the user will see various purchase metrics as well as preferences.&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>If the customer dashboard is enabled, it will be the landing page when navigating to the customer record. The customers&#39; lifetime purchases, returns, and exchanges are visible and graphed.</li>\r\n\t<li>If the retailer has configured additional attributes to be displayed, it appears to the right of the graph.\r\n\t<ul>\r\n\t\t<li>The retailer can choose the order in which these attributes are displayed.</li>\r\n\t\t<li>Based on the user&#39;s UI grants, the information displayed is filtered.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p><a id=\"customer dashboard\" name=\"customer dashboard\"></a>A new version of the dashboard is available via <a hqid=\"3092761\" href=\"/behaviorchange\">Change in Behavior</a>. This new dashboard will overwrite the existing one.&nbsp; Within the new dashboard, the user will see an activity feed as well as the customer closet.</p>\r\n\r\n<p>The activity feed provides a quick view of the customer&#39;s purchases, as well as notes associated with the customer. Customer closet has been designed with the aim of providing users with the ability to take an easy and quick look at the items that a customer has purchased, without having to go to the complete purchase detail.The closet view allows a user to understand a high-level overview of the kind of items that the customer purchases. This is helpful in providing a personalized shopping experience within the store. It is a quick tool to upsell, with large size data of item types, sizes, and dates displayed.The closet view, which is available on all form factors featured under &ldquo;Dashboard&rdquo;, is a collage display of items based on the customer&rsquo;s purchase history. The closet displays the items (with images) purchased in a reverse chronological order and is expandable to a full-screen view with the same functionality.</p>\r\n\r\n<ul>\r\n\t<li>An activity feed with the following:\r\n\t<ul>\r\n\t\t<li>Customer purchases in reverse chronological order - users can tap on a purchase and will be navigated to the order details screen.</li>\r\n\t\t<li>Customer notes\r\n\t\t<ul>\r\n\t\t\t<li>Notes can now be pinned so they will remain at the top of the activity feed for ease of access.</li>\r\n\t\t</ul>\r\n\t\t</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>A purchase collage (closet):\r\n\t<ul>\r\n\t\t<li>Customer purchases with item images, sizing and month/year of purchase in reverse chronological order</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<div class=\"tip\">\r\n<p><strong>Note</strong>: The handheld dashboard carousel is scrollable. Here, the closet appears on the second pane of the scrollable carousel owing to screen space constraints.</p>\r\n</div>\r\n\r\n<p>Closet Navigation:&nbsp; &nbsp;</p>\r\n\r\n<p>When a customer taps on an item image from the collage, they are brought to the corresponding item details page. Subsequently, on the item details screen, the item image, color, and size attributes are pre-selected based on the specific sku or item sold. The functionality for the extended attributes (if configured) such as fit and pattern will be similar.</p>\r\n\r\n<p>From the item details UI, should the customer wish to go back to the collage view, at the press of &ldquo;BACK&rdquo; button, they are taken to the purchase collage/closet with that collage item still in view, which was chosen by the customer. This functionality helps avoid the effort/need to scroll up/down to go&nbsp;back to the item initially chosen from the collage.</p>\r\n\r\n<p>Like in the catalogue, here, this functionality works in the same manner when the user clicks on &ldquo;Add to&rdquo; on the item details screen.</p>\r\n\r\n<p><a id=\"expandedcloset\" name=\"expandedcloset\"></a>Expanded Closet View:</p>\r\n\r\n<p>The embedded collage view can be expanded to a full-screen view by clicking on the &ldquo;VIEW ALL&rdquo; button placed above the collage. Similarly, the full-screen view can be closed to get back to the dashboard with the embedded collage view.</p>\r\n\r\n<div class=\"tip\">\r\n<p><strong>Note: </strong>The item details&rsquo; navigation functionality is retained in the collage&rsquo;s expanded view. It mirrors the function of the embedded view.</p>\r\n</div>\r\n\r\n<p><br />\r\n<a id=\"Customer Sub-header\" name=\"Customer Sub-header\"></a>Customer Sub-header</p>\r\n\r\n<p>When the user navigates to the customer record, there is a new customer engagement sub-header.&nbsp;Just like the Dashboard, the sub-header is visible through business flags, configurations, and UI grants.</p>\r\n\r\n<ul>\r\n\t<li>If the customer sub-header is enabled, it appears below the customer title bar in the customer record.&nbsp;\r\n\t<ul>\r\n\t\t<li>The sub-header is visible on all tabs of the customer record.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>The retailer can configure various attributes to be displayed to the users.\r\n\t<ul>\r\n\t\t<li>If more than 4 attributes are configured, the sub-header is scrollable on the tablet form factor.</li>\r\n\t\t<li>The sub-header on the small handheld form factor can expand and collapse to allow the user to see additional information.</li>\r\n\t\t<li>Based on the user&#39;s UI grants, the information displayed is filtered.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<h4><a name=\"social-media\" id=\"social-media\"></a><a id=\"Social Media\" name=\"Social Media\"></a>Social Media</h4>\r\n\r\n<p>Customer Engagement integrates with the retailer&rsquo;s social media sites through configuration. The application is currently capable of integration with the retailer&rsquo;s Facebook and Twitter sites.</p>\r\n\r\n<p>Social listening gives the following abilities :</p>\r\n\r\n<ul>\r\n\t<li>Integrate with social media sites such as Facebook and Twitter.</li>\r\n\t<li>Read the social user data from the media sites.</li>\r\n\t<li>Social metrics give visibility of the volume of customer posts.</li>\r\n\t<li>View the social messages posted on a retailer&rsquo;s public page/account by the social community.</li>\r\n\t<li>Link the social user to customer using &quot;attach customer&quot; functionality.</li>\r\n\t<li>Display the social user data on the customer sub-header.</li>\r\n</ul>\r\n\r\n<h4><a name=\"customer-purchases\" id=\"customer-purchases\"></a><a id=\"Customer Purchases\" name=\"Customer Purchases\"></a>Customer Purchases</h4>\r\n\r\n<p>Customer Engagement in Stores provides a consolidated view of customer&#39;s purchases and returns across channels on the Purchases&nbsp;screen. For this to happen, the customer ID used across channels should be the same.&nbsp;If the same customer shops both&nbsp;online and at the same retailer&#39;s store, it is better to have a common ID.&nbsp;</p>\r\n\r\n<p>Users can sort the Order data by date or the order value. The system allows the user to get a view of Purchases and Returns distinctly through a filter option.&nbsp;If the order has a combination of sales and returns, it gets listed under Purchases.&nbsp;Key information&nbsp;provided here is Order ID, Order Total, Tax amount, item, price at which it was bought, Store ID and so on.</p>\r\n\r\n<p>The purchases screen provides&nbsp;customer services like initiating a return for a purchase or reprinting the receipt.</p>\r\n\r\n<div class=\"tip\"><span style=\"color:#000000;\"><strong>Note</strong>: Exchanges will only show even exchanges that occur. Since POS does not have an even exchange option, the item brought back to the store will show in returns, and the item received will show in sales.</span></div>\r\n\r\n<p>The purchase history data of a customer will be displayed in reverse chronological order. This data can include purchases made in the form of Store, eCommerce, or Customer service (CS) orders.</p>\r\n\r\n<p>The customer purchase data is shown within a tile which has the following components included:</p>\r\n\r\n<ul>\r\n\t<li>Sale channel title &ndash; This would be highlighted with an icon and a label (Instore, Ecomm/Web or CS)</li>\r\n\t<li>Number of items purchased</li>\r\n\t<li>Total amount spent</li>\r\n\t<li>Purchase date</li>\r\n\t<li>Number of days since last purchase</li>\r\n</ul>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>The user can tap on the order &ldquo;tile&rdquo; to go to the order details screen of a specific order. Upon pressing back, the user is taken back to the activity feed with the selected order&rsquo;s &ldquo;tile&rdquo; visible and highlighted.</p>\r\n\r\n<h5><a name=\"order-details\" id=\"order-details\"></a>Order Details:</h5>\r\n\r\n<p>Users can access additional details about a customer&#39;s order by selecting the order in Purchases, or via Global Order Search &gt; Select the order or swipe to view More.</p>\r\n\r\n<p>The additional details displayed are :</p>\r\n\r\n<ul>\r\n\t<li>Item fulfillment status: In Progress, Picked, Packed, Fulfilled, Returned, Back Ordered are some examples.</li>\r\n\t<li>Item shipment status: Open, In Progress or Completed</li>\r\n\t<li>ETA for ship to address orders.\r\n\t<ul>\r\n\t\t<li>If the carrier does not have this available, then ETA is the earliest allocation date for the order.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Additional items within the shipment</li>\r\n\t<li>Tracking details button\r\n\t<ul>\r\n\t\t<li>When selected, the tracking view opens to provide detailed tracking information provided by the carrier.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Payment Methods\r\n\t<ul>\r\n\t\t<li>For any tender that is authorized but not yet settled, there will be an indication stating &quot;authorized&quot;. All other tenders will be settled.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<h4><a name=\"cases\" id=\"cases\"></a><a id=\"Cases\" name=\"Cases\"></a>Cases</h4>\r\n\r\n<p>A Case is a repository of interactions: questions, feedback, service request or grievance, details of action taken and other related details - between a&nbsp; customer service representative and the customer, via different communication channels such as Phone, E-mail, Chat, Facebook and Twitter. Cases are created automatically or manually by the CSR. Cases can be used by store employees to deliver better customer service.&nbsp;By providing information on open cases, employees can help resolve an issue relating to a customer&#39;s order.</p>\r\n\r\n<h5><a name=\"viewing-open-order-cases\" id=\"viewing-open-order-cases\"></a>Viewing Open Order Cases:</h5>\r\n\r\n<ol>\r\n\t<li>Navigate to the customer record Purchases tab.</li>\r\n\t<li>Tap the Case icon on the order header.</li>\r\n\t<li>Case information is displayed in a pop-up.</li>\r\n\t<li>If there is more than one open case on a single order, the user can use the navigation arrows in the pop-up to advance to the next case for that order.</li>\r\n\t<li>Tapping outside of the pop-up will dismiss it.</li>\r\n</ol>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Only orders with an open case display the Case icon and indicator badge with the number of open cases.&nbsp;Once a case is closed, the user cannot see the icon on the order.</div>\r\n\r\n<h4><a name=\"activity\" id=\"activity\"></a><a id=\"Activity\" name=\"Activity\"></a>Activity</h4>\r\n\r\n<h5><a name=\"appointments-nbsp\" id=\"appointments-nbsp\"></a>Appointments&nbsp;</h5>\r\n\r\n<p>Within the application, users can create appointments with the customer.&nbsp;Use cases driving this are:</p>\r\n\r\n<p>a) Outbound Marketing: Store associates get involved in preparing the schedule to call up customers to explain the newly added items, items got back in stock which the customer wished to buy and so on.</p>\r\n\r\n<p>b) If the customer is visiting the store to check out items personally, the store associate can fix the appointment to provide personalized assistance.</p>\r\n\r\n<p>Users can edit the appointment to update the date /time or the purpose.&nbsp;Once the appointment is complete, the same can be reflected in the system against the relevant record by setting the status to &quot;Completed&quot;.&nbsp;</p>\r\n\r\n<p>The Appointment screen under Customer Activity has two available views: calendar and list. The list view displays key information like date, time, and current status.&nbsp;Users can sort this list by &quot;created date&quot; and &quot;time&quot;. Users can also filter the appointment by their completion status. The Calendar view gives a view of appointments for the current month.&nbsp;Users can select a date with an appointment and navigate to view, edit or delete the appointment, or a user can select a date without an appointment and create one. Users can choose to switch between the two views from a drop down menu selection.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: If Calendar duration is enabled, then the user needs to enter only the start time of the appointment or task, and set the duration.&nbsp;The end time is automatically calculated for the user.</div>\r\n\r\n<h5><a name=\"tasks\" id=\"tasks\"></a>Tasks</h5>\r\n\r\n<p>Tasks can be created within customer engagement by associating the customer to cater to some of the specific requirements, such as,&nbsp;a customer is expected at&nbsp;the store and the associate wants to keep things ready to serve the customer.&nbsp;To ensure this happens and for tracking purposes, tasks are created.</p>\r\n\r\n<p>Like appointments, tasks can be modified to change the time or the purpose.&nbsp;Once the task is complete, the same can be updated in the system by marking it &quot;Completed&quot;.</p>\r\n\r\n<p>The Tasks screen within Customer Activity lists the tasks created for the customer along with their current status.&nbsp;Users can filter tasks by status and sort by date too.</p>\r\n\r\n<p>Additionally, tasks also have a calendar and a list view that behaves in an identical way to the appointments.</p>\r\n\r\n<h5><a name=\"phone-log\" id=\"phone-log\"></a>Phone Log</h5>\r\n\r\n<p>Typically, store associates log their telephonic correspondence with the customer, which is referred to as a Phone Log.&nbsp;This can be used for auditing and reporting purposes.&nbsp;A Phone log can be created prior to the actual call, if it is planned in advance, or&nbsp;after completion.&nbsp;</p>\r\n\r\n<p>A phone log, similar to task and appointment, can be scheduled.&nbsp;This is created if the store associate is planning a telephonic call for marketing purposes, informing about new arrivals and so on.&nbsp;Users can edit the phone log to change the time or purpose.&nbsp;Users can sort the list based on the status and created date time.</p>\r\n\r\n<h5><a name=\"email-log\" id=\"email-log\"></a>Email Log</h5>\r\n\r\n<p>A store associate, who invests time with the customer explaining item features, may wish to email the details so that the customer can refer to them even after exiting the store.&nbsp;This enhances the customer experience and sales potential.&nbsp;Thus,&nbsp;Email logs are the records of email communication with the customer.&nbsp;Most often it consists of item details and images.&nbsp;If the customer is activated, the registered email ID is selected automatically for emailing purposes.&nbsp;Users can add more to the list too.</p>\r\n\r\n<p>For the purpose of sending emails, users have to create the email templates under Masterdatafacade&gt;&gt;Clienteling Configurations&gt;&gt;Email Templates. Example: New Arrival, Back In stock Notification, Birthday Wishes and so on. Templates thus created get listed on the New Email screen. The user needs to select one of them to load the predefined template.</p>\r\n\r\n<h5><a name=\"notes\" id=\"notes\"></a>Notes</h5>\r\n\r\n<p>Notes, created with the customer associated,&nbsp;are brief notes created to keep track of the customer&#39;s preferences, additional&nbsp;information that helps in better service.&nbsp;An associate can create Notes as Public or Private ones.&nbsp;Public Notes can be accessed by all users who have permission to do so, whereas Private Notes can be accessed only by the user who has created them.&nbsp;Users can create, edit, delete, filter and sort notes from the Notes screen.</p>\r\n\r\n<h4><a name=\"wishlist\" id=\"wishlist\"></a><a id=\"Wishlist\" name=\"Wishlist\"></a>Wishlist</h4>\r\n\r\n<p>Customer engagement within Active Omni provides the ability to get the consolidated&nbsp; wishlist of the customer, across all channels.&nbsp;An item can be added to the active customer&#39;s wishlist from Item Details screen.&nbsp;Item from the wishlist can be moved to Cart if the customer decides to buy them.</p>\r\n\r\n<h4><a name=\"workspace\" id=\"workspace\"></a><a id=\"Workspace\" name=\"Workspace\"></a>Workspace</h4>\r\n\r\n<p>Workspace provides the scratch pad functionality where one or more items can be added from the different categories. Workspace now provides the ability to share the item details over email or text.</p>\r\n\r\n<p>Retailers can&nbsp;share single or multiple items with the customer over email. These item details are sent over the email as embedded images with additional item details. Retailers can add as many items as they want and share over email. These items are shared using&nbsp;specific templates which are configurable. The email triggered from Workspace creates an interaction record.&nbsp;</p>\r\n\r\n<h4><a name=\"loyalty\" id=\"loyalty\"></a><a id=\"Loyalty\" name=\"Loyalty\"></a>Loyalty</h4>\r\n\r\n<p>Customer Loyalty exhibits the consolidated view of business done by the customer, with the retailer&#39;s brand, across sales channels.&nbsp;It provides the purchases and return value for the current and previous calendar year.&nbsp;It is read-only data.</p>\r\n\r\n<h5><a name=\"loyalty-status\" id=\"loyalty-status\"></a>Loyalty Status</h5>\r\n\r\n<p>Retailer can assign loyalty status to each customer, based on their own internal criteria such as&nbsp;past purchase, value of items purchase/returns by customer and so on, or, can use any 3rd party application to determine the status. For example, customers could be assigned Bronze, Silver, Platinum.&nbsp;In addition, each status can be associated to a graphic indicator &quot;emoji&quot;, in addition to the status text.&nbsp;This&nbsp;emoji is displayed at various cart screens next to the customer name to help the store associates to understand the customer and serve them better.</p>\r\n\r\n<p>User can choose to associate the emoji images to status descriptions via the statusImageUrl field in&nbsp;customerStatus service&nbsp;via&nbsp;script.</p>\r\n\r\n<p>If the retailer does not wish to use this feature, they should not associate Loyalty Status to any image.&nbsp;This is not a required association.</p>\r\n\r\n<h4><a name=\"interactions\" id=\"interactions\"></a><a id=\"Interactions\" name=\"Interactions\"></a>Interactions</h4>\r\n\r\n<p>Interactions between a retailer and a customer are no longer restricted to an in store purchase. More and more retailers are using various communication methods to interact with their customers for various reasons. The Interactions tab in the customer record provides store personnel the ability to view these various communications between the retailer and the customer, as well as initiate communications.&nbsp;&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>From the Store application, user may generate outbound Emails from a variety of screens and Text Messages from the Interaction screens.&nbsp; &nbsp;These Emails and Text messages are always generated on behalf of the Location (Store), via a storewide email address or text from a common store &quot;phone number&quot;.&nbsp; &nbsp;They are not personalized to the associate.</li>\r\n\t<li>Interactions of different types can be made available/unavailable&nbsp;based on configurations, as well as user resourceIDs and grants.</li>\r\n\t<li>Outbound: Email and Text&nbsp;interactions are created from various locations within the application: Global Add, Interactions Menu, Workspace, Activity, and Item details.&nbsp;&nbsp;</li>\r\n\t<li>User can add attachments to both Emails and Text Messages.&nbsp; These are currently limited to item images and descriptions.&nbsp; &nbsp;In order to attach, the items must be present in the Workspace.</li>\r\n\t<li>Inbound: If a text or email interaction is Inbound to the store, as could occur for example if a recipient replies to an outbound Email or Text, Store application will link the sender&#39;s information to a customerID record whenever possible.&nbsp; &nbsp;If this is successful, the interaction is displayed on that customer&#39;s Interaction tab.&nbsp; Otherwise the inbound interaction is considered an &#39;anonymous&#39; communication and is not available in any customer view.</li>\r\n</ul>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Customer interactions will show all interactions for the customer, regardless of the location with which the customer has interacted.&nbsp; Example: Store 001 will see interactions that Customer A had with Store 001, Store 002 as well as Contact Center, and so on.</div>\r\n\r\n<h5><a name=\"opt-in-out\" id=\"opt-in-out\"></a>Opt-In/Out</h5>\r\n\r\n<p>With increasing communication regulations, customers will have the ability to choose whether or not they would like to opt-in or out of receiving different communications. Based on this selection, the application will either allow, or prevent, a user from sending communications to a customer.&nbsp;</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: The Opt-in/out selection will only be used for on-demand communications such as email and text.&nbsp; This selection will not affect emailed receipts or order status updates.&nbsp; No automated message is sent as a result of changing a customer&#39;s Optin preferences - for example, &quot;Type STOP to unsubscribe&quot;.&nbsp;&nbsp;</div>\r\n\r\n<h4><a name=\"profile\" id=\"profile\"></a><a id=\"Profile\" name=\"Profile\"></a>Profile</h4>\r\n\r\n<p>Stores are evolving to be more customer-centric facilities. This is the channel where customers; actual or potential, make their visit to purchase items. Customers may&nbsp;also physically visit the store for other services, such as return the items purchased across channels, change of address, contact details and so on.&nbsp;Hence, it is important that the store associate have the ability to add new customer data, modify existing ones, and&nbsp;view the current data to provide better service.&nbsp;&nbsp;</p>\r\n\r\n<ul>\r\n\t<li>Within the store application, user can add customers, modify current details, and search.</li>\r\n\t<li>While adding or editing the customer, retailer can choose to verify the address provided by the customer.&nbsp;This is driven by configuration under POSServices&gt;&gt;commonConfig&gt;&gt;isAddressVerificationRequired.&nbsp;</li>\r\n\t<li>As part of customer creation, Billing and Shipping addresses are captured.&nbsp;For the purpose of re-use and convenience user can select one of the addresses as default, which would be used during order creation&nbsp;and can be overridden, if required.</li>\r\n\t<li>Customers walking into the store may wish to change their contact number or address, in which case the store associate can pull up the current details through search to update the required information.&nbsp;&nbsp;</li>\r\n</ul>\r\n\r\n<h4><a name=\"active-customer-drop-down\" id=\"active-customer-drop-down\"></a><a id=\"Active Customer Drop-down\" name=\"Active Customer Drop-down\"></a>Active Customer Drop-down</h4>\r\n\r\n<p>When a customer is made active in POS, the user has the ability to tap the customer name in the sub-header to navigate to the various tabs within the customer record. With customer engagement, the user will now be able to not only navigate to the customer record tabs, but will also view the customer sub-header and customer dashboard information based on the configurations enabled by the retailer.&nbsp;</p>\r\n\r\n<h4><a name=\"waiting-room\" id=\"waiting-room\"></a><a id=\"Waiting Room\" name=\"Waiting Room\"></a>Waiting Room</h4>\r\n\r\n<p>Waiting Room within POS application indicates the list of customers who is&nbsp;not actively interacting with the store associate currently.&nbsp; The two most common scenarios in which the customer is placed in waiting room are:</p>\r\n\r\n<ul>\r\n\t<li>Store associate prepares the list of item for an appointment with a customer, activates the customer and add one or more items to the workspace and place this customer into a waiting room.&nbsp;During the appointment, this customer is retrieved from the waiting room, thus restoring all workspace items. This way, store associate can effectively utilize customer&#39;s time while in store.</li>\r\n\t<li>Store associate working with a customer, some items in workspace, some in the cart.&nbsp;Customer leaves the transaction in the middle to check out some more items or to a fitting room. In such scenario, workspace items and the transaction in progress is placed in waiting&nbsp;room to be retrieved&nbsp;later.&nbsp;Store associate can work with another customer in the meanwhile.</li>\r\n</ul>\r\n\r\n<p>Waiting Room records are associated with particular store associated, who is the employee of the organization and can be locked or unlocked.&nbsp;If locked, only the original associate can retrieve this customer from waiting room.&nbsp;If the waiting room in not locked, then any user can retrieve.</p>\r\n\r\n<p>In progress order that is placed in waiting room is put on&nbsp;hold.&nbsp;When retrieved, the hold is resolved and new order ID is created.&nbsp;Details of the current order gets copied to the new order.</p>\r\n\r\n<p>Deleting record from waiting room: If the user has &quot;ui::clienteling::note::deletenote&quot; ui grant, then the user will have an&nbsp;option to see delete icon. User can select waiting room record created by him/her and delete the records. User cannot delete&nbsp;waiting room record created by other users.</p>\r\n\r\n<div class=\"info\">The menu count on the waiting room&nbsp;does not have polling, i.e. Menu count is not refreshed unless clicked. User need to click atleast once to poll the records and the menu count is appear for that session.</div>\r\n\r\n<h4><a name=\"lookbook\" id=\"lookbook\"></a><a id=\"Lookbook\" name=\"Lookbook\"></a>Lookbook</h4>\r\n\r\n<p>More and more, retailers are working to create an enhanced experience when a customer shops with them.&nbsp;This leaves the customer with a strong feeling of value, therefore increasing the likelihood that they will not only continue to shop with the retailer, but will also recommend them to friends and family.&nbsp;Part of this experience involves engaging with the customers by creating lookbooks.&nbsp;A lookbook is part of a customizable shopping experience. These lookbooks combine items that the customer has already purchased from the retailer, and combines them with new items to make a tailor-made look for the customer. Customers can use these lookbooks to find favorite items, discover new items, and get inspired. The key benefits to marketing with lookbooks&nbsp;is that they fire up human sense, which is an important driver behind buying decisions.</p>\r\n\r\n<p>Some common use cases of lookbook are&nbsp;listed below:</p>\r\n\r\n<ul>\r\n\t<li>High end retailers or personal shoppers can use lookbooks to send new and updated looks to their customers prior to them entering the store.&nbsp;This can help the customer determine what items they may want to look at in more detail when they visit the store, saving them time and money.</li>\r\n\t<li>Retailers can provide different combinations of items to appeal to customers with different style preferences.&nbsp;This allows the retailer to get creative and display their products in new ways. A well-photographed and well-marketed lookbooks can inspire shoppers to buy.</li>\r\n</ul>\r\n\r\n<h5><a name=\"lookbook-nbsp-global-configuration-and-grants\" id=\"lookbook-nbsp-global-configuration-and-grants\"></a>Lookbook&nbsp;global configuration and grants</h5>\r\n\r\n<p>There is a global configuration to enable&nbsp;lookbook&nbsp;feature&nbsp;on POS application. Users&nbsp;can&nbsp;access this configuration&nbsp;from the&nbsp;Config&nbsp;UI&nbsp;under &quot;Manage POS Configuration&quot; &gt; &quot;Lookbook&nbsp;Configuration&quot;. To enable lookbook, update&nbsp;&quot;Display Lookbook&quot; to true.&nbsp;</p>\r\n\r\n<p>The lower level grants to control lookbook&nbsp;feature for specific operations across the POS application are listed&nbsp;below:</p>\r\n\r\n<ul>\r\n\t<li>To view lookbook&nbsp;on the User and Customer screen -<em> ui::lookbook::user::lookbookview</em></li>\r\n\t<li>To create a lookbook - <em>ui::lookbook::customer::lookbookcreate</em></li>\r\n\t<li>To edit a lookbook - <em>ui::lookbook::customer::lookbookedit</em></li>\r\n\t<li>To delete a lookbook - <em>ui::lookbook::customer::lookbookdelete</em></li>\r\n\t<li>To share lookbook via email - <em>ui::lookbook::customer::lookbookshare::sendemail</em></li>\r\n\t<li>To share lookbook on customer profile - <em>ui::lookbook::customer::lookbookshare::customer</em></li>\r\n</ul>\r\n\r\n<h5><a name=\"creating-a-new-lookbook\" id=\"creating-a-new-lookbook\"></a>Creating a new lookbook</h5>\r\n\r\n<p>Any user with specific grants as explained above can create a new&nbsp;lookbook from below screens:</p>\r\n\r\n<ul>\r\n\t<li>User menu - Lookbook tab.</li>\r\n\t<li>Customer screen&nbsp;&nbsp;- Profile tab - Lookbook&nbsp;sub tab.</li>\r\n\t<li>Global cart screen, using <img alt=\"\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/Screen%20Shot%202018-12-05%20at%204_36_45%20PM.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL1NjcmVlbiUyMFNob3QlMjAyMDE4LTEyLTA1JTIwYXQlMjA0XzM2XzQ1JTIwUE0ucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUyMTI2fX19XX0_&Signature=JuMSzyzCG-YyGtI4E0mnAQVAYKNXMAmNkRe9y-BZs7IiPlY-cUugMFJrWVv57trY5~WlxfSQpLZ9mGYoufA9VGqszO-yL2O-8M1b8FrJxM6IET9Ql8jYT497ApaHQKO6Oi2LlYghGZYMFUOqJwh9F8qACiGw2jwlrY640wlfJo3koJu23f2swsMbmKXJemXgje4~l7iVmoILfEipzUSDc3XzuHCCAKGQ63DL~j08IuR4FUEEvWic-ujpm1APkfI-TW1h1O94gbCwSVSJD9tNcAbQMshDvs57Hh9beFfKFZrg5O-F~B4nrHfk5SB-RP1aHypxqm3Mf9qn~jDZfogmMg__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 33px; height: 34px;\" />&nbsp;icon&nbsp;</li>\r\n</ul>\r\n\r\n<p>When user is on the New Lookbook&nbsp;screen, user can choose products for the new lookbook&nbsp;from different sources like catalog, workspace and if customer is active or new lookbook is triggered from customer screen then few more sources like past purchases and wishlist. User can just drag products from source to target to create a new look, user can choose positions of the products&nbsp;as required to create a look. Also, can create multiple pages for this look within the target that&nbsp;consist&nbsp;of&nbsp;different products. Each page in a lookbook&nbsp;should have atleast one product to spin new pages. Once user is done creating the look, can choose to save the lookbook. Remember that lookbook&nbsp;name should be unique, no two lookbooks can have same name. The&nbsp;saved lookbooks are available on User Menu &gt; Lookbooks tab.&nbsp;</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Lookbook creation is restricted to tablet only.&nbsp; Users may only use a small for factor (iPod, iPhone) to view lookbooks which were previously created.</div>\r\n\r\n<h5><a name=\"sharing-a-lookbook-nbsp-with-customer\" id=\"sharing-a-lookbook-nbsp-with-customer\"></a>Sharing a lookbook&nbsp;with customer</h5>\r\n\r\n<p>Once a lookbook is created, user can choose to share&nbsp;it with the customers from the New Lookbook&nbsp;screen itself or later from User and Customer menu as well. Below are different interfaces to share a lookbook&nbsp;to the customer.</p>\r\n\r\n<ul>\r\n\t<li>New lookbook&nbsp;screen, share button</li>\r\n\t<li>User menu or Customer menu &gt; Lookbook&nbsp;tab &gt; lookbook&nbsp;list &gt; share icon&nbsp;<img alt=\"\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/Screen%20Shot%202018-12-05%20at%204_36_22%20PM(1).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL1NjcmVlbiUyMFNob3QlMjAyMDE4LTEyLTA1JTIwYXQlMjA0XzM2XzIyJTIwUE0oMSkucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUyMTI2fX19XX0_&Signature=HnE0twJwDXyRc~kWmqwIuIFZtvRXeMOaFHoeqlwJAdNck2-DAmjzpeLQWzVbQ4R5b4~8ffa7LFBTNDCTq8gZnpPMgD79a6p4WmRpgcfX4BgyRo5iDoOCZ5Fa8nRXTgcFjeOkrh8TeSjLKTVpCpnle9EL9uw~F7d-LTlOQ65fTj7lTguoSK6eoj1GgNHvEHN4-mGw4rAnQ6AJvtaTtcPZreKh5dFLp6FebLz7lms1m6RTBeEWkl-uaEifLSjW6SQbXPicpz~jYeQZT~p~COV0XS~586N0bXujUUs2a-EoftXUsXOYRWOg-SftNCZhsYexESCnEnW0ZKwveFuS2JIWFQ__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 33px; height: 34px;\" /></li>\r\n\t<li>User menu or Customer menu &gt; Lookbook&nbsp;tab &gt; lookbook details &gt; share icon&nbsp;<img alt=\"\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/Screen%20Shot%202018-12-05%20at%204_36_22%20PM(1).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL1NjcmVlbiUyMFNob3QlMjAyMDE4LTEyLTA1JTIwYXQlMjA0XzM2XzIyJTIwUE0oMSkucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUyMTI2fX19XX0_&Signature=HnE0twJwDXyRc~kWmqwIuIFZtvRXeMOaFHoeqlwJAdNck2-DAmjzpeLQWzVbQ4R5b4~8ffa7LFBTNDCTq8gZnpPMgD79a6p4WmRpgcfX4BgyRo5iDoOCZ5Fa8nRXTgcFjeOkrh8TeSjLKTVpCpnle9EL9uw~F7d-LTlOQ65fTj7lTguoSK6eoj1GgNHvEHN4-mGw4rAnQ6AJvtaTtcPZreKh5dFLp6FebLz7lms1m6RTBeEWkl-uaEifLSjW6SQbXPicpz~jYeQZT~p~COV0XS~586N0bXujUUs2a-EoftXUsXOYRWOg-SftNCZhsYexESCnEnW0ZKwveFuS2JIWFQ__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 33px; height: 34px;\" /></li>\r\n\t<li>User menu or Customer menu &gt; Lookbook&nbsp;tab &gt;&nbsp;lookbook&nbsp;details maximized screen &gt; share icon&nbsp;<img alt=\"\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/Screen%20Shot%202018-12-05%20at%204_36_22%20PM(1).png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL1NjcmVlbiUyMFNob3QlMjAyMDE4LTEyLTA1JTIwYXQlMjA0XzM2XzIyJTIwUE0oMSkucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUyMTI2fX19XX0_&Signature=HnE0twJwDXyRc~kWmqwIuIFZtvRXeMOaFHoeqlwJAdNck2-DAmjzpeLQWzVbQ4R5b4~8ffa7LFBTNDCTq8gZnpPMgD79a6p4WmRpgcfX4BgyRo5iDoOCZ5Fa8nRXTgcFjeOkrh8TeSjLKTVpCpnle9EL9uw~F7d-LTlOQ65fTj7lTguoSK6eoj1GgNHvEHN4-mGw4rAnQ6AJvtaTtcPZreKh5dFLp6FebLz7lms1m6RTBeEWkl-uaEifLSjW6SQbXPicpz~jYeQZT~p~COV0XS~586N0bXujUUs2a-EoftXUsXOYRWOg-SftNCZhsYexESCnEnW0ZKwveFuS2JIWFQ__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 33px; height: 34px;\" /></li>\r\n</ul>\r\n\r\n<p>There are currently two modes of sharing lookbook&nbsp;with the customer, one is sharing with customer profile and sharing via email.</p>\r\n\r\n<p><strong>Sharing via customer profile</strong>: User can choose to share a particular lookbook&nbsp;to a customer or multiple customer in one shot from Share &gt; Customers option. User can choose the customer with whom the lookbook&nbsp;needs to be&nbsp;shared with. After sharing the lookbook&nbsp;using this option, this lookbook is available to all the customers on all their customer profile within POS application. This option of sharing is usually used&nbsp;when user wants to first assign a particular lookbook&nbsp;to customer profile first and then choose to ultimately share via email. This type of sharing lookbook is only possible with&nbsp;register customers.</p>\r\n\r\n<p><strong>Sharing via email to customers</strong>: This option of sharing is via email which actually sends the lookbooks&nbsp;to customer email address, customer can view the lookbooks from their&nbsp;email inbox. This operation can be triggered from Share &gt; email option and can send lookbook&nbsp;via email to a single or multiple customer in one shot. User can send lookbook&nbsp;to unregistered/anonymous&nbsp;customers also using the email id directly. At any given time only one lookbook&nbsp;can be sent. Once the lookbook&nbsp;is shared via email, this lookbook&nbsp;cannot be further edited.&nbsp;</p>\r\n\r\n<h5><a name=\"accessing-lookbooks-on-user-customer-nbsp-menu\" id=\"accessing-lookbooks-on-user-customer-nbsp-menu\"></a>Accessing lookbooks on user/customer&nbsp;menu</h5>\r\n\r\n<p>Lookbooks saved on the system can be viewed from user menu and if it is shared to customers via share customer profile or share email, then it can be accessed on customer profile also.</p>\r\n\r\n<p>User menu: All the lookbooks&nbsp;created by the user can be accessed from the user menu. Users can also use different filter options to load lookbooks such as lookbooks&nbsp;created across the organization or lookbooks&nbsp;created as public. For more details refer <a hqid=\"1959896\" href=\"/storeengagement-process\">Employee Process Guide</a>. User can view the details of the lookbook&nbsp;by selecting individual lookbooks. The detail screen displays all information/pages in that&nbsp;lookbook, user can swipe left or right&nbsp;to view more pages. User can choose to&nbsp;maximize using this icon&nbsp;&nbsp;<img alt=\"\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/Screen%20Shot%202018-12-05%20at%206_59_57%20PM.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL1NjcmVlbiUyMFNob3QlMjAyMDE4LTEyLTA1JTIwYXQlMjA2XzU5XzU3JTIwUE0ucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUyMTI2fX19XX0_&Signature=OSxtV5oJZ6Qbkfj2Jj3ZMSpKhjjyV8RTgkYO45C5so-c1AB4sxcFC0LvWemv1kfGuPq85aIzHmfiuDFN6j6iReWU2p9zBxYmqWZLw6Isbl4iQpAIpIN8aWoQLaYtKcBE2qIVJUiBSIN0ujTcMyrpVV69ijofDhBX8YTcVL5t~LhBjmf5YPcIjAifwyAGbQKeYQ68GAUsWZ3dQaTPFsA0PN82Kgu4h2l5q6nSBDJPfFDOCNfeL974uYZgm205CyEDUruzlZV5fWehADmJbBJkAppQlDRWzjt6gd2cwMF4kupJTQNehywor-~DFHMGPyruhNOpy6au7wEp7fZoKmZU4Q__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 32.9972px; height: 33.9773px;\" />&nbsp; to view in lookbook in full screen. User can perform edit and delete operation also from this screen.</p>\r\n\r\n<p>Customer menu: The lookbooks&nbsp;shared to customer profiles can be accessed by going to individual customer profile under the profile tab.&nbsp;User can view the details of the&nbsp;lookbook&nbsp;by selecting individual&nbsp;lookbooks. The detail screen displays all information/pages in that&nbsp;lookbook, user can swipe left or right to view more pages.&nbsp;User can choose to&nbsp;maximize using this&nbsp;icon&nbsp;&nbsp;<img alt=\"\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/Screen%20Shot%202018-12-05%20at%206_59_57%20PM.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL1NjcmVlbiUyMFNob3QlMjAyMDE4LTEyLTA1JTIwYXQlMjA2XzU5XzU3JTIwUE0ucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUyMTI2fX19XX0_&Signature=OSxtV5oJZ6Qbkfj2Jj3ZMSpKhjjyV8RTgkYO45C5so-c1AB4sxcFC0LvWemv1kfGuPq85aIzHmfiuDFN6j6iReWU2p9zBxYmqWZLw6Isbl4iQpAIpIN8aWoQLaYtKcBE2qIVJUiBSIN0ujTcMyrpVV69ijofDhBX8YTcVL5t~LhBjmf5YPcIjAifwyAGbQKeYQ68GAUsWZ3dQaTPFsA0PN82Kgu4h2l5q6nSBDJPfFDOCNfeL974uYZgm205CyEDUruzlZV5fWehADmJbBJkAppQlDRWzjt6gd2cwMF4kupJTQNehywor-~DFHMGPyruhNOpy6au7wEp7fZoKmZU4Q__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 32.9972px; height: 33.9773px;\" />&nbsp; to view in&nbsp;lookbook&nbsp;in full screen.&nbsp;User&nbsp;can&nbsp;perform edit and delete operation also from this screen.</p>\r\n\r\n<h5><a name=\"editing-and-deleting-nbsp-lookbooks\" id=\"editing-and-deleting-nbsp-lookbooks\"></a>Editing and deleting&nbsp;lookbooks</h5>\r\n\r\n<p><strong>Editing lookbooks</strong>: Lookbooks&nbsp;saved on the system can be edited from user menu or customer menu, it will be available for editing based on the shared via status. If a lookbook is already&nbsp;shared via email then the lookbook cannot be edited. But if it is shared to only&nbsp;customer profiles then it can be edited. An editable lookbook&nbsp;can be edited from the user menu or customer profiles using the edit icon&nbsp;&nbsp;<img alt=\"\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/Screen%20Shot%202018-12-05%20at%206_40_08%20PM.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL1NjcmVlbiUyMFNob3QlMjAyMDE4LTEyLTA1JTIwYXQlMjA2XzQwXzA4JTIwUE0ucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUyMTI2fX19XX0_&Signature=XaqOxlpdzno-2-UPOxirhafHB7fCXZdzTwg25yE9aq-Sw21J1igSa~iiQnuy0WJ2zAQubvFo~g17pUQ~Es1~i0YQa3ZMQNVNvUvh-6ZeiiAYlsVSWMA7RkwQjA8unW-g-FJxN2govoIxoYXCank5Gk4pT7rJ-Lw9dfPXCs6cl59awAn2faFURChGlUHhpl2DRKSr-icq3iRqwdAJEQSJ0DCpgYnZmspdPqwXsIiIjmGOQi2CX3r3facUnSwR530b9ACXnlw4Gs7CS7RjsdVyHuu7LXzpFLwEncod5oLbw-2p3T-21Lc6aLS5zEyQYiAufTszYgiba2c~Ih3VxBdHtA__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 43.9915px; height: 40.9943px;\" />&nbsp; on each listed&nbsp;lookbook. In edit mode user can edit all the aspects of the lookbook&nbsp;such as Lookbook name, adding/deleting or re-positioning items in lookbooks, create new pages, edit page names and so on&nbsp;and save them.</p>\r\n\r\n<p>If a lookbook is non editable, then the Save button on the edit lookbook is disabled. User can choose to use the &quot;Save As&quot; option and provide a new unique name, this creates a copy of the lookbook. User can edit this instance of lookbook.</p>\r\n\r\n<p><strong>Deleting lookbooks:&nbsp;</strong>Lookbooks&nbsp;saved on the system can be deleted from user menu or customer menu using the delete&nbsp;<img alt=\"\" src=\"https://dzf8vqv24eqhg.cloudfront.net/userfiles/4665/7671/ckfinder/images/Screen%20Shot%202018-12-05%20at%206_39_47%20PM.png?Policy=eyJTdGF0ZW1lbnQiOlt7IlJlc291cmNlIjoiaHR0cHM6Ly9kemY4dnF2MjRlcWhnLmNsb3VkZnJvbnQubmV0L3VzZXJmaWxlcy80NjY1Lzc2NzEvY2tmaW5kZXIvaW1hZ2VzL1NjcmVlbiUyMFNob3QlMjAyMDE4LTEyLTA1JTIwYXQlMjA2XzM5XzQ3JTIwUE0ucG5nIiwiQ29uZGl0aW9uIjp7IkRhdGVMZXNzVGhhbiI6eyJBV1M6RXBvY2hUaW1lIjoxNzU0NzUyMTI2fX19XX0_&Signature=HJG6qsCxwX9q9upSCej0fhiGGsY9QGDcxoQZO4Vwltou-ic5a8SbBYl~9mFDMJrE-5k1FOj-yqo-NXHPIDF03Dk8yghLwAYFD0WFnEyTnmYJEZwi5kWCCWroNLJy8mSECvgasAdA0XVoUWeNWtJFP-TZtZRnTyG7Vb8BCqLZM89yY4RoQEfZrW~QyiLhgOnUpXf87B0ci54wtP8HFX4WpELT-QEgWKgoXHgIS9Knn6w5NUSmkCXDCglemIC45El2eyRWywxXqGt2-1j7F5wmY0wV-5Ch~EFglCZ-MNfJLtNUgjLqvfH0wYJac3M3d5k13efRyldIxGmxzIAt8vUWwg__&Key-Pair-Id=K2TK3EG287XSFC\" style=\"width: 32.9972px; height: 33.9773px;\" />&nbsp; icon , all lookbooks&nbsp;are available for deleting based on the user grants.</p>\r\n\r\n<p>From user menu: If a lookbook is deleted from user menu, then the entire lookbook is deleted. Which means if that lookbook&nbsp;is shared to customers, then it&nbsp;gets deleted from customer profiles as well.</p>\r\n\r\n<p>From Customer menu:&nbsp;If a&nbsp;lookbook&nbsp;is deleted from customer menu, then&nbsp;only that instances of&nbsp;lookbook&nbsp;is deleted. Which means it gets deleted only for that customers, and if it was shared to other customers then it will still be available on their profile. And also, it will still be available on user menu.</p>\r\n\r\n<h4><a name=\"services\" id=\"services\"></a><a id=\"Services\" name=\"Services\"></a>Services</h4>\r\n\r\n<p>The following APIs are the key APIs related to features listed above.&nbsp;Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\">Service</th>\r\n\t\t\t<th scope=\"col\">Component</th>\r\n\t\t\t<th scope=\"col\">Service Endpoint</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Search customer</td>\r\n\t\t\t<td>Search</td>\r\n\t\t\t<td>/storefacade/api/storefacade/search/customer</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Add customer</td>\r\n\t\t\t<td>Customer</td>\r\n\t\t\t<td>/storefacade/api/storefacade/posservice/customer/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Open Order Cases </font></td>\r\n\t\t\t<td><font face=\"Open Sans, Arial, Helvetica, sans-serif\">posService</font></td>\r\n\t\t\t<td><font face=\"Open Sans, Arial, Helvetica, sans-serif\">api/posservice/order/getPastPurchasesWithCases</font></td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Customer Dashboard Configuration</font></td>\r\n\t\t\t<td><font face=\"Open Sans, Arial, Helvetica, sans-serif\">posService</font></td>\r\n\t\t\t<td>api/posservice/customerDashboardConfig</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Customer Sub-header Configuration</td>\r\n\t\t\t<td><font face=\"Open Sans, Arial, Helvetica, sans-serif\">posService</font></td>\r\n\t\t\t<td>api/posservice/customerSubheaderConfig</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Order list</td>\r\n\t\t\t<td>Search</td>\r\n\t\t\t<td>/storefacade/api/storefacade/posservice/order/getPastPurchases</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Add/Edit appointment</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/appointmentTaskDetail/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Delete Activity</td>\r\n\t\t\t<td>posserivice</td>\r\n\t\t\t<td>/storefacade/api/storefacade/posservice/override/command/delete_activity</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Add/Edit task</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/appointmentTaskDetail/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Add/Edit phone log</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/phoneLogs/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Phone log list</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/phoneLogs&nbsp;</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Email log list</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/emailLogs</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Notes list</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/note/getNotes</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Add/Edit Note</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/note/getNotes</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Delete Note</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/note/{noteId}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Wish list items</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/wishlist/getCustomerWishlist</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Item details</td>\r\n\t\t\t<td>posservice</td>\r\n\t\t\t<td>\r\n\t\t\t<p>/storefacade/api/storefacade/posservice/itembyid /storefacade/api/storefacade/posservice/itemDetails</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Item image</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>storefacade/api/storefacade/fulfillment/additionalImageURIs/{itemId}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Add item to wish list</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/wishlist/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Remove item from wish list</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/wishlist/{wishListId}/wishlistItem/{wishListItemId}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Loyalty Status - fields for Status description and URL for associated Status Emoji if any</td>\r\n\t\t\t<td>Customer</td>\r\n\t\t\t<td>customer/api/customer/customerStatus</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Loyalty</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/getCustomerLoyaltyDetails</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Waiting room</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/waitingRoom/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Get waiting room</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/waitingRoom/{waitingroomId}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Delete waiting room</td>\r\n\t\t\t<td>Clienteling</td>\r\n\t\t\t<td>/storefacade/api/storefacade/clienteling/waitingRoom/{PK}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Activate waiting room</td>\r\n\t\t\t<td>posservice</td>\r\n\t\t\t<td>/storefacade/api/storefacade/posservice/order/resume</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Create/Edit/Save As&nbsp;lookbook</td>\r\n\t\t\t<td>lookbook</td>\r\n\t\t\t<td>/storefacade/api/storefacade/lookbook/lookbooks/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Save As - lookbook</td>\r\n\t\t\t<td>lookbook</td>\r\n\t\t\t<td>/storefacade/api/storefacade/lookbook/lookbooks/save</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Delete lookbook&nbsp;- user menu</td>\r\n\t\t\t<td>lookbook</td>\r\n\t\t\t<td>DELETE /storefacade/api/storefacade/lookbook/lookbooks/{lookbook&nbsp;pk}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Delete lookbook - customer menu</td>\r\n\t\t\t<td>lookbook</td>\r\n\t\t\t<td>DELETE /storefacade/api/storefacade/lookbook/lookbooksSharedDtl/{lookbookSharedDtl pk}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Get&nbsp;lookbook&nbsp;list</td>\r\n\t\t\t<td>lookbook</td>\r\n\t\t\t<td>/storefacade/api/storefacade/lookbook/getLookbooksSharedinfo</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Share lookbook&nbsp;to&nbsp;customer profiles</td>\r\n\t\t\t<td>lookbook</td>\r\n\t\t\t<td>/storefacade/api/storefacade/lookbook/lookbooksSharedDtl/import</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Share lookbook&nbsp;to customer email</td>\r\n\t\t\t<td>lookbook</td>\r\n\t\t\t<td>/storefacade/api/storefacade/lookbook/sendLookbookemail</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"profile-purpose\" id=\"profile-purpose\"></a>Profile Purpose</h4>\r\n\r\n<p>The profile purposes of all the configuration entities are listed below. The default profile would be <b>base</b>&nbsp;for this profile purpose.</p>\r\n\r\n<ul>\r\n\t<li>lkb::lookbooksConfig</li>\r\n</ul>\r\n\r\n<h3>&nbsp;</h3>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 54751,
  "scraped_at": "2025-08-09T22:03:47.057651",
  "content_clean": "Home ››Manhattan Active® Omni››Store››Process & Configuration Guides››Point of Sale››POS Classic Guides››Store Customer Engagement››Store Customer Engagement ››Store Customer Engagement Process Guide Store Customer Engagement OverviewFeature Summary  DashboardSocial MediaCustomer PurchasesOrder Details:CasesViewing Open Order Cases:ActivityAppointments TasksPhone LogEmail LogNotesWishlistWorkspaceLoyaltyLoyalty StatusInteractionsOpt-In/OutProfileActive Customer Drop-downWaiting RoomLookbookLookbook global configuration and grantsCreating a new lookbookSharing a lookbook with customerAccessing lookbooks on user/customer menuEditing and deleting lookbooksServicesProfile Purpose Overview Store Customer Engagement provides retailers and their employees an enhanced view of their customers.  Retailers can now use Store Customer Engagement to view information about the customer such as shipping and contact preferences, social media influence, and open cases logged by the call center agents against an order. In the past, Call Center Customer Engagement has been used by call center agents to better serve the customers who call in to place orders or ask for information. With Store Customer Engagement in stores, retailers can now use this similar information to provide a better in-store experience for their customers. Users can have a quick overview of the customers they are currently working with in the store. Also, they can use this information to prepare for an upcoming customer visit.  This feature requires additional licensing beyond the standard POS License. Feature Summary Store Customer Engagement includes all the functionality of our standard POS Engagement feature plus the following: Configurable customer dashboard: Configurable customer sub-header:Customer cases: Enhanced customer email: Enhanced order details: Dashboard The customer dashboard is the landing page when navigating to a customer record. It provides a high level overview of the customer to allow better customer service by the store associates. When the Dashboard is configured, the user will see various purchase metrics as well as preferences. If the customer dashboard is enabled, it will be the landing page when navigating to the customer record. The customers' lifetime purchases, returns, and exchanges are visible and graphed. If the retailer has configured additional attributes to be displayed, it appears to the right of the graph. The retailer can choose the order in which these attributes are displayed. Based on the user's UI grants, the information displayed is filtered. A new version of the dashboard is available via Change in Behavior. This new dashboard will overwrite the existing one.  Within the new dashboard, the user will see an activity feed as well as the customer closet. The activity feed provides a quick view of the customer's purchases, as well as notes associated with the customer. Customer closet has been designed with the aim of providing users with the ability to take an easy and quick look at the items that a customer has purchased, without having to go to the complete purchase detail.The closet view allows a user to understand a high-level overview of the kind of items that the customer purchases. This is helpful in providing a personalized shopping experience within the store. It is a quick tool to upsell, with large size data of item types, sizes, and dates displayed.The closet view, which is available on all form factors featured under “Dashboard”, is a collage display of items based on the customer’s purchase history. The closet displays the items (with images) purchased in a reverse chronological order and is expandable to a full-screen view with the same functionality. An activity feed with the following: Customer purchases in reverse chronological order - users can tap on a purchase and will be navigated to the order details screen. Customer notes Notes can now be pinned so they will remain at the top of the activity feed for ease of access. A purchase collage (closet): Customer purchases with item images, sizing and month/year of purchase in reverse chronological order Note: The handheld dashboard carousel is scrollable. Here, the closet appears on the second pane of the scrollable carousel owing to screen space constraints. Closet Navigation: When a customer taps on an item image from the collage, they are brought to the corresponding item details page. Subsequently, on the item details screen, the item image, color, and size attributes are pre-selected based on the specific sku or item sold. The functionality for the extended attributes (if configured) such as fit and pattern will be similar. From the item details UI, should the customer wish to go back to the collage view, at the press of “BACK” button, they are taken to the purchase collage/closet with that collage item still in view, which was chosen by the customer. This functionality helps avoid the effort/need to scroll up/down to go back to the item initially chosen from the collage. Like in the catalogue, here, this functionality works in the same manner when the user clicks on “Add to” on the item details screen. Expanded Closet View: The embedded collage view can be expanded to a full-screen view by clicking on the “VIEW ALL” button placed above the collage. Similarly, the full-screen view can be closed to get back to the dashboard with the embedded collage view. Note: The item details’ navigation functionality is retained in the collage’s expanded view. It mirrors the function of the embedded view. Customer Sub-header When the user navigates to the customer record, there is a new customer engagement sub-header. Just like the Dashboard, the sub-header is visible through business flags, configurations, and UI grants. If the customer sub-header is enabled, it appears below the customer title bar in the customer record. The sub-header is visible on all tabs of the customer record. The retailer can configure various attributes to be displayed to the users. If more than 4 attributes are configured, the sub-header is scrollable on the tablet form factor. The sub-header on the small handheld form factor can expand and collapse to allow the user to see additional information. Based on the user's UI grants, the information displayed is filtered. Social Media Customer Engagement integrates with the retailer’s social media sites through configuration. The application is currently capable of integration with the retailer’s Facebook and Twitter sites. Social listening gives the following abilities : Integrate with social media sites such as Facebook and Twitter. Read the social user data from the media sites. Social metrics give visibility of the volume of customer posts. View the social messages posted on a retailer’s public page/account by the social community. Link the social user to customer using \"attach customer\" functionality. Display the social user data on the customer sub-header. Customer Purchases Customer Engagement in Stores provides a consolidated view of customer's purchases and returns across channels on the Purchases screen. For this to happen, the customer ID used across channels should be the same. If the same customer shops both online and at the same retailer's store, it is better to have a common ID. Users can sort the Order data by date or the order value. The system allows the user to get a view of Purchases and Returns distinctly through a filter option. If the order has a combination of sales and returns, it gets listed under Purchases. Key information provided here is Order ID, Order Total, Tax amount, item, price at which it was bought, Store ID and so on. The purchases screen provides customer services like initiating a return for a purchase or reprinting the receipt. Note: Exchanges will only show even exchanges that occur. Since POS does not have an even exchange option, the item brought back to the store will show in returns, and the item received will show in sales. The purchase history data of a customer will be displayed in reverse chronological order. This data can include purchases made in the form of Store, eCommerce, or Customer service (CS) orders. The customer purchase data is shown within a tile which has the following components included: Sale channel title – This would be highlighted with an icon and a label (Instore, Ecomm/Web or CS) Number of items purchased Total amount spent Purchase date Number of days since last purchase The user can tap on the order “tile” to go to the order details screen of a specific order. Upon pressing back, the user is taken back to the activity feed with the selected order’s “tile” visible and highlighted. Order Details: Users can access additional details about a customer's order by selecting the order in Purchases, or via Global Order Search > Select the order or swipe to view More. The additional details displayed are : Item fulfillment status: In Progress, Picked, Packed, Fulfilled, Returned, Back Ordered are some examples. Item shipment status: Open, In Progress or Completed ETA for ship to address orders. If the carrier does not have this available, then ETA is the earliest allocation date for the order. Additional items within the shipment Tracking details button When selected, the tracking view opens to provide detailed tracking information provided by the carrier. Payment Methods For any tender that is authorized but not yet settled, there will be an indication stating \"authorized\". All other tenders will be settled. Cases A Case is a repository of interactions: questions, feedback, service request or grievance, details of action taken and other related details - between a  customer service representative and the customer, via different communication channels such as Phone, E-mail, Chat, Facebook and Twitter. Cases are created automatically or manually by the CSR. Cases can be used by store employees to deliver better customer service. By providing information on open cases, employees can help resolve an issue relating to a customer's order. Viewing Open Order Cases: Navigate to the customer record Purchases tab. Tap the Case icon on the order header. Case information is displayed in a pop-up. If there is more than one open case on a single order, the user can use the navigation arrows in the pop-up to advance to the next case for that order. Tapping outside of the pop-up will dismiss it. Note: Only orders with an open case display the Case icon and indicator badge with the number of open cases. Once a case is closed, the user cannot see the icon on the order. Activity Appointments Within the application, users can create appointments with the customer. Use cases driving this are: a) Outbound Marketing: Store associates get involved in preparing the schedule to call up customers to explain the newly added items, items got back in stock which the customer wished to buy and so on. b) If the customer is visiting the store to check out items personally, the store associate can fix the appointment to provide personalized assistance. Users can edit the appointment to update the date /time or the purpose. Once the appointment is complete, the same can be reflected in the system against the relevant record by setting the status to \"Completed\". The Appointment screen under Customer Activity has two available views: calendar and list. The list view displays key information like date, time, and current status. Users can sort this list by \"created date\" and \"time\". Users can also filter the appointment by their completion status. The Calendar view gives a view of appointments for the current month. Users can select a date with an appointment and navigate to view, edit or delete the appointment, or a user can select a date without an appointment and create one. Users can choose to switch between the two views from a drop down menu selection. Note: If Calendar duration is enabled, then the user needs to enter only the start time of the appointment or task, and set the duration. The end time is automatically calculated for the user. Tasks Tasks can be created within customer engagement by associating the customer to cater to some of the specific requirements, such as, a customer is expected at the store and the associate wants to keep things ready to serve the customer. To ensure this happens and for tracking purposes, tasks are created. Like appointments, tasks can be modified to change the time or the purpose. Once the task is complete, the same can be updated in the system by marking it \"Completed\". The Tasks screen within Customer Activity lists the tasks created for the customer along with their current status. Users can filter tasks by status and sort by date too. Additionally, tasks also have a calendar and a list view that behaves in an identical way to the appointments. Phone Log Typically, store associates log their telephonic correspondence with the customer, which is referred to as a Phone Log. This can be used for auditing and reporting purposes. A Phone log can be created prior to the actual call, if it is planned in advance, or after completion. A phone log, similar to task and appointment, can be scheduled. This is created if the store associate is planning a telephonic call for marketing purposes, informing about new arrivals and so on. Users can edit the phone log to change the time or purpose. Users can sort the list based on the status and created date time. Email Log A store associate, who invests time with the customer explaining item features, may wish to email the details so that the customer can refer to them even after exiting the store. This enhances the customer experience and sales potential. Thus, Email logs are the records of email communication with the customer. Most often it consists of item details and images. If the customer is activated, the registered email ID is selected automatically for emailing purposes. Users can add more to the list too. For the purpose of sending emails, users have to create the email templates under Masterdatafacade>>Clienteling Configurations>>Email Templates. Example: New Arrival, Back In stock Notification, Birthday Wishes and so on. Templates thus created get listed on the New Email screen. The user needs to select one of them to load the predefined template. Notes Notes, created with the customer associated, are brief notes created to keep track of the customer's preferences, additional information that helps in better service. An associate can create Notes as Public or Private ones. Public Notes can be accessed by all users who have permission to do so, whereas Private Notes can be accessed only by the user who has created them. Users can create, edit, delete, filter and sort notes from the Notes screen. Wishlist Customer engagement within Active Omni provides the ability to get the consolidated  wishlist of the customer, across all channels. An item can be added to the active customer's wishlist from Item Details screen. Item from the wishlist can be moved to Cart if the customer decides to buy them. Workspace Workspace provides the scratch pad functionality where one or more items can be added from the different categories. Workspace now provides the ability to share the item details over email or text. Retailers can share single or multiple items with the customer over email. These item details are sent over the email as embedded images with additional item details. Retailers can add as many items as they want and share over email. These items are shared using specific templates which are configurable. The email triggered from Workspace creates an interaction record. Loyalty Customer Loyalty exhibits the consolidated view of business done by the customer, with the retailer's brand, across sales channels. It provides the purchases and return value for the current and previous calendar year. It is read-only data. Loyalty Status Retailer can assign loyalty status to each customer, based on their own internal criteria such as past purchase, value of items purchase/returns by customer and so on, or, can use any 3rd party application to determine the status. For example, customers could be assigned Bronze, Silver, Platinum. In addition, each status can be associated to a graphic indicator \"emoji\", in addition to the status text. This emoji is displayed at various cart screens next to the customer name to help the store associates to understand the customer and serve them better. User can choose to associate the emoji images to status descriptions via the statusImageUrl field in customerStatus service via script. If the retailer does not wish to use this feature, they should not associate Loyalty Status to any image. This is not a required association. Interactions Interactions between a retailer and a customer are no longer restricted to an in store purchase. More and more retailers are using various communication methods to interact with their customers for various reasons. The Interactions tab in the customer record provides store personnel the ability to view these various communications between the retailer and the customer, as well as initiate communications. From the Store application, user may generate outbound Emails from a variety of screens and Text Messages from the Interaction screens.   These Emails and Text messages are always generated on behalf of the Location (Store), via a storewide email address or text from a common store \"phone number\".   They are not personalized to the associate. Interactions of different types can be made available/unavailable based on configurations, as well as user resourceIDs and grants. Outbound: Email and Text interactions are created from various locations within the application: Global Add, Interactions Menu, Workspace, Activity, and Item details. User can add attachments to both Emails and Text Messages.  These are currently limited to item images and descriptions.   In order to attach, the items must be present in the Workspace. Inbound: If a text or email interaction is Inbound to the store, as could occur for example if a recipient replies to an outbound Email or Text, Store application will link the sender's information to a customerID record whenever possible.   If this is successful, the interaction is displayed on that customer's Interaction tab.  Otherwise the inbound interaction is considered an 'anonymous' communication and is not available in any customer view. Note: Customer interactions will show all interactions for the customer, regardless of the location with which the customer has interacted.  Example: Store 001 will see interactions that Customer A had with Store 001, Store 002 as well as Contact Center, and so on. Opt-In/Out With increasing communication regulations, customers will have the ability to choose whether or not they would like to opt-in or out of receiving different communications. Based on this selection, the application will either allow, or prevent, a user from sending communications to a customer. Note: The Opt-in/out selection will only be used for on-demand communications such as email and text.  This selection will not affect emailed receipts or order status updates.  No automated message is sent as a result of changing a customer's Optin preferences - for example, \"Type STOP to unsubscribe\". Profile Stores are evolving to be more customer-centric facilities. This is the channel where customers; actual or potential, make their visit to purchase items. Customers may also physically visit the store for other services, such as return the items purchased across channels, change of address, contact details and so on. Hence, it is important that the store associate have the ability to add new customer data, modify existing ones, and view the current data to provide better service. Within the store application, user can add customers, modify current details, and search. While adding or editing the customer, retailer can choose to verify the address provided by the customer. This is driven by configuration under POSServices>>commonConfig>>isAddressVerificationRequired. As part of customer creation, Billing and Shipping addresses are captured. For the purpose of re-use and convenience user can select one of the addresses as default, which would be used during order creation and can be overridden, if required. Customers walking into the store may wish to change their contact number or address, in which case the store associate can pull up the current details through search to update the required information. Active Customer Drop-down When a customer is made active in POS, the user has the ability to tap the customer name in the sub-header to navigate to the various tabs within the customer record. With customer engagement, the user will now be able to not only navigate to the customer record tabs, but will also view the customer sub-header and customer dashboard information based on the configurations enabled by the retailer. Waiting Room Waiting Room within POS application indicates the list of customers who is not actively interacting with the store associate currently.  The two most common scenarios in which the customer is placed in waiting room are: Store associate prepares the list of item for an appointment with a customer, activates the customer and add one or more items to the workspace and place this customer into a waiting room. During the appointment, this customer is retrieved from the waiting room, thus restoring all workspace items. This way, store associate can effectively utilize customer's time while in store. Store associate working with a customer, some items in workspace, some in the cart. Customer leaves the transaction in the middle to check out some more items or to a fitting room. In such scenario, workspace items and the transaction in progress is placed in waiting room to be retrieved later. Store associate can work with another customer in the meanwhile. Waiting Room records are associated with particular store associated, who is the employee of the organization and can be locked or unlocked. If locked, only the original associate can retrieve this customer from waiting room. If the waiting room in not locked, then any user can retrieve. In progress order that is placed in waiting room is put on hold. When retrieved, the hold is resolved and new order ID is created. Details of the current order gets copied to the new order. Deleting record from waiting room: If the user has \"ui::clienteling::note::deletenote\" ui grant, then the user will have an option to see delete icon. User can select waiting room record created by him/her and delete the records. User cannot delete waiting room record created by other users. The menu count on the waiting room does not have polling, i.e. Menu count is not refreshed unless clicked. User need to click atleast once to poll the records and the menu count is appear for that session. Lookbook More and more, retailers are working to create an enhanced experience when a customer shops with them. This leaves the customer with a strong feeling of value, therefore increasing the likelihood that they will not only continue to shop with the retailer, but will also recommend them to friends and family. Part of this experience involves engaging with the customers by creating lookbooks. A lookbook is part of a customizable shopping experience. These lookbooks combine items that the customer has already purchased from the retailer, and combines them with new items to make a tailor-made look for the customer. Customers can use these lookbooks to find favorite items, discover new items, and get inspired. The key benefits to marketing with lookbooks is that they fire up human sense, which is an important driver behind buying decisions. Some common use cases of lookbook are listed below: High end retailers or personal shoppers can use lookbooks to send new and updated looks to their customers prior to them entering the store. This can help the customer determine what items they may want to look at in more detail when they visit the store, saving them time and money. Retailers can provide different combinations of items to appeal to customers with different style preferences. This allows the retailer to get creative and display their products in new ways. A well-photographed and well-marketed lookbooks can inspire shoppers to buy. Lookbook global configuration and grants There is a global configuration to enable lookbook feature on POS application. Users can access this configuration from the Config UI under \"Manage POS Configuration\" > \"Lookbook Configuration\". To enable lookbook, update \"Display Lookbook\" to true. The lower level grants to control lookbook feature for specific operations across the POS application are listed below: To view lookbook on the User and Customer screen - ui::lookbook::user::lookbookview To create a lookbook - ui::lookbook::customer::lookbookcreate To edit a lookbook - ui::lookbook::customer::lookbookedit To delete a lookbook - ui::lookbook::customer::lookbookdelete To share lookbook via email - ui::lookbook::customer::lookbookshare::sendemail To share lookbook on customer profile - ui::lookbook::customer::lookbookshare::customer Creating a new lookbook Any user with specific grants as explained above can create a new lookbook from below screens: User menu - Lookbook tab. Customer screen  - Profile tab - Lookbook sub tab. Global cart screen, using  icon When user is on the New Lookbook screen, user can choose products for the new lookbook from different sources like catalog, workspace and if customer is active or new lookbook is triggered from customer screen then few more sources like past purchases and wishlist. User can just drag products from source to target to create a new look, user can choose positions of the products as required to create a look. Also, can create multiple pages for this look within the target that consist of different products. Each page in a lookbook should have atleast one product to spin new pages. Once user is done creating the look, can choose to save the lookbook. Remember that lookbook name should be unique, no two lookbooks can have same name. The saved lookbooks are available on User Menu > Lookbooks tab. Note: Lookbook creation is restricted to tablet only.  Users may only use a small for factor (iPod, iPhone) to view lookbooks which were previously created. Sharing a lookbook with customer Once a lookbook is created, user can choose to share it with the customers from the New Lookbook screen itself or later from User and Customer menu as well. Below are different interfaces to share a lookbook to the customer. New lookbook screen, share button User menu or Customer menu > Lookbook tab > lookbook list > share icon User menu or Customer menu > Lookbook tab > lookbook details > share icon User menu or Customer menu > Lookbook tab > lookbook details maximized screen > share icon There are currently two modes of sharing lookbook with the customer, one is sharing with customer profile and sharing via email. Sharing via customer profile: User can choose to share a particular lookbook to a customer or multiple customer in one shot from Share > Customers option. User can choose the customer with whom the lookbook needs to be shared with. After sharing the lookbook using this option, this lookbook is available to all the customers on all their customer profile within POS application. This option of sharing is usually used when user wants to first assign a particular lookbook to customer profile first and then choose to ultimately share via email. This type of sharing lookbook is only possible with register customers. Sharing via email to customers: This option of sharing is via email which actually sends the lookbooks to customer email address, customer can view the lookbooks from their email inbox. This operation can be triggered from Share > email option and can send lookbook via email to a single or multiple customer in one shot. User can send lookbook to unregistered/anonymous customers also using the email id directly. At any given time only one lookbook can be sent. Once the lookbook is shared via email, this lookbook cannot be further edited. Accessing lookbooks on user/customer menu Lookbooks saved on the system can be viewed from user menu and if it is shared to customers via share customer profile or share email, then it can be accessed on customer profile also. User menu: All the lookbooks created by the user can be accessed from the user menu. Users can also use different filter options to load lookbooks such as lookbooks created across the organization or lookbooks created as public. For more details refer Employee Process Guide. User can view the details of the lookbook by selecting individual lookbooks. The detail screen displays all information/pages in that lookbook, user can swipe left or right to view more pages. User can choose to maximize using this icon    to view in lookbook in full screen. User can perform edit and delete operation also from this screen. Customer menu: The lookbooks shared to customer profiles can be accessed by going to individual customer profile under the profile tab. User can view the details of the lookbook by selecting individual lookbooks. The detail screen displays all information/pages in that lookbook, user can swipe left or right to view more pages. User can choose to maximize using this icon    to view in lookbook in full screen. User can perform edit and delete operation also from this screen. Editing and deleting lookbooks Editing lookbooks: Lookbooks saved on the system can be edited from user menu or customer menu, it will be available for editing based on the shared via status. If a lookbook is already shared via email then the lookbook cannot be edited. But if it is shared to only customer profiles then it can be edited. An editable lookbook can be edited from the user menu or customer profiles using the edit icon    on each listed lookbook. In edit mode user can edit all the aspects of the lookbook such as Lookbook name, adding/deleting or re-positioning items in lookbooks, create new pages, edit page names and so on and save them. If a lookbook is non editable, then the Save button on the edit lookbook is disabled. User can choose to use the \"Save As\" option and provide a new unique name, this creates a copy of the lookbook. User can edit this instance of lookbook. Deleting lookbooks: Lookbooks saved on the system can be deleted from user menu or customer menu using the delete   icon , all lookbooks are available for deleting based on the user grants. From user menu: If a lookbook is deleted from user menu, then the entire lookbook is deleted. Which means if that lookbook is shared to customers, then it gets deleted from customer profiles as well. From Customer menu: If a lookbook is deleted from customer menu, then only that instances of lookbook is deleted. Which means it gets deleted only for that customers, and if it was shared to other customers then it will still be available on their profile. And also, it will still be available on user menu. Services The following APIs are the key APIs related to features listed above. Refer to the API documentation for additional details on each service. Service Component Service Endpoint Search customer Search /storefacade/api/storefacade/search/customer Add customer Customer /storefacade/api/storefacade/posservice/customer/save Open Order Cases posService api/posservice/order/getPastPurchasesWithCases Customer Dashboard Configuration posService api/posservice/customerDashboardConfig Customer Sub-header Configuration posService api/posservice/customerSubheaderConfig Order list Search /storefacade/api/storefacade/posservice/order/getPastPurchases Add/Edit appointment Clienteling /storefacade/api/storefacade/clienteling/appointmentTaskDetail/save Delete Activity posserivice /storefacade/api/storefacade/posservice/override/command/delete_activity Add/Edit task Clienteling /storefacade/api/storefacade/clienteling/appointmentTaskDetail/save Add/Edit phone log Clienteling /storefacade/api/storefacade/clienteling/phoneLogs/save Phone log list Clienteling /storefacade/api/storefacade/clienteling/phoneLogs Email log list Clienteling /storefacade/api/storefacade/clienteling/emailLogs Notes list Clienteling /storefacade/api/storefacade/clienteling/note/getNotes Add/Edit Note Clienteling /storefacade/api/storefacade/clienteling/note/getNotes Delete Note Clienteling /storefacade/api/storefacade/clienteling/note/{noteId} Wish list items Clienteling /storefacade/api/storefacade/clienteling/wishlist/getCustomerWishlist Item details posservice /storefacade/api/storefacade/posservice/itembyid /storefacade/api/storefacade/posservice/itemDetails Item image Fulfillment storefacade/api/storefacade/fulfillment/additionalImageURIs/{itemId} Add item to wish list Clienteling /storefacade/api/storefacade/clienteling/wishlist/save Remove item from wish list Clienteling /storefacade/api/storefacade/clienteling/wishlist/{wishListId}/wishlistItem/{wishListItemId} Loyalty Status - fields for Status description and URL for associated Status Emoji if any Customer customer/api/customer/customerStatus Loyalty Clienteling /storefacade/api/storefacade/clienteling/getCustomerLoyaltyDetails Waiting room Clienteling /storefacade/api/storefacade/clienteling/waitingRoom/save Get waiting room Clienteling /storefacade/api/storefacade/clienteling/waitingRoom/{waitingroomId} Delete waiting room Clienteling /storefacade/api/storefacade/clienteling/waitingRoom/{PK} Activate waiting room posservice /storefacade/api/storefacade/posservice/order/resume Create/Edit/Save As lookbook lookbook /storefacade/api/storefacade/lookbook/lookbooks/save Save As - lookbook lookbook /storefacade/api/storefacade/lookbook/lookbooks/save Delete lookbook - user menu lookbook DELETE /storefacade/api/storefacade/lookbook/lookbooks/{lookbook pk} Delete lookbook - customer menu lookbook DELETE /storefacade/api/storefacade/lookbook/lookbooksSharedDtl/{lookbookSharedDtl pk} Get lookbook list lookbook /storefacade/api/storefacade/lookbook/getLookbooksSharedinfo Share lookbook to customer profiles lookbook /storefacade/api/storefacade/lookbook/lookbooksSharedDtl/import Share lookbook to customer email lookbook /storefacade/api/storefacade/lookbook/sendLookbookemail Profile Purpose The profile purposes of all the configuration entities are listed below. The default profile would be base for this profile purpose. lkb::lookbooksConfig"
}