{
  "id": "2263416",
  "permalink": "store-initiated-transfers-process",
  "title": "Store-Initiated Transfer Process",
  "type": "topic",
  "level": 6,
  "path": "Manhattan Active® Omni/Store/Process & Configuration Guides/Store Inventory & Fulfillment/Store Inventory Management/Store-Initiated Transfers/Store-Initiated Transfer Process",
  "raw_item": {
    "id": "2263416",
    "text": "Store-Initiated Transfer Process",
    "title": "Store-Initiated Transfer Process",
    "permalink": "store-initiated-transfers-process",
    "leaf": false,
    "droppable": true,
    "expanded": true,
    "closed": true,
    "visible": true,
    "editable": true,
    "type": "topic",
    "topicType": "0",
    "status": "1",
    "iconCls": "icon-topic",
    "cls": "",
    "folder_id": "221313",
    "parent": "f;221313",
    "created_date": "1565080329",
    "modified_date": "1753087296",
    "instructor_id": null,
    "loaded": true,
    "haschildren": false,
    "callout": "0",
    "order": "1"
  },
  "success": true,
  "content": "\r\n\r\n\r\n<div class=\"hiq-page-wrap\">\r\n<div class=\"hiq-t-wrap\">\r\n\t\t\r\n  \t  <div class=\"hiq-t \">\r\n\t\t\t\t<ul class=\"breadcrumbs\"><li><a class=\"breadcrumb-links\" hqid=\"1788908\"  href=\"/home\">Home</a></li> <li><span>&rsaquo;&rsaquo;</span><a hqid=\"3500940\" href=\"/omni\" class=\"breadcrumb-links\">Manhattan Active® Omni</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"3426481\" href=\"/store-3\" class=\"breadcrumb-links\">Store</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158412\" href=\"/process-configuration-guides-3\" class=\"breadcrumb-links\">Process & Configuration Guides</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2158410\" href=\"/store\" class=\"breadcrumb-links\">Store Inventory & Fulfillment</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2166732\" href=\"/store-inventory\" class=\"breadcrumb-links\">Store Inventory Management</a></li><li><span>&rsaquo;&rsaquo;</span><a hqid=\"2286517\" href=\"/store-initiated-transfers\" class=\"breadcrumb-links\">Store-Initiated Transfers</a></li><li> <span>››</span>Store-Initiated Transfer Process</li></ul>  \t\r\n\t\t<h2><a name=\"store-initiated-transfer-process\" id=\"store-initiated-transfer-process\"></a>Store-Initiated Transfer Process</h2>\r\n\r\n<p></p>\r\n\r\n<div class=\"info\"><ul><li><a href=\"/store-initiated-transfers-process$store-initiated-transfer-process\">Store-Initiated Transfer Process</a><ul><li><a href=\"/store-initiated-transfers-process$transfer-order-creation\">Transfer Order Creation</a></li><li><a href=\"/store-initiated-transfers-process$transfer-types\">Transfer Types</a></li><li><a href=\"/store-initiated-transfers-process$transfers-across-organizations\">Transfers across Organizations</a></li><li><a href=\"/store-initiated-transfers-process$transfer-nbsp-orders-list\">Transfer&nbsp;Orders List</a></li><li><a href=\"/store-initiated-transfers-process$picking\">Picking</a></li><li><a href=\"/store-initiated-transfers-process$packing\">Packing</a><ul><li><a href=\"/store-initiated-transfers-process$maximum-quantity-per-item\">Maximum Quantity per Item</a></li><li><a href=\"/store-initiated-transfers-process$remove-packed-units-from-availability\">Remove Packed Units from Availability</a></li><li><a href=\"/store-initiated-transfers-process$exceptions\">Exceptions</a></li><li><a href=\"/store-initiated-transfers-process$updates\">Updates</a></li></ul></li><li><a href=\"/store-initiated-transfers-process$rfid\">RFID</a><ul><li><a href=\"/store-initiated-transfers-process$pack-tagged-and-non-tagged-units\">Pack tagged and non-tagged units</a></li><li><a href=\"/store-initiated-transfers-process$exceptions\">Exceptions</a></li><li><a href=\"/store-initiated-transfers-process$updates\">Updates</a></li><li><a href=\"/store-initiated-transfers-process$cross-organization\">Cross-Organization</a></li></ul></li><li><a href=\"/store-initiated-transfers-process$close-order\">Close Order</a><ul><li><a href=\"/store-initiated-transfers-process$obsolete-orders\">Obsolete Orders</a></li><li><a href=\"/store-initiated-transfers-process$non-parcel\">Non-parcel</a></li></ul></li><li><a href=\"/store-initiated-transfers-process$troubleshooting\">Troubleshooting</a></li><li><a href=\"/store-initiated-transfers-process$services\">Services</a></li></ul></li></ul></div>\r\n\r\n<p>Manhattan Active Store now allows stores to initiate inventory transfers to another location in order for the store to quickly respond to adhoc transfer requests. For example, if a district manager sees that one store in the region has a low inventory level for a popular promotional item while another store has a much higher inventory level, the store with excess inventory can now create a store-initiated transfer to replenish the other store. Store-initiated transfers allow stores to be self-sufficient by directly creating transfer orders without the need for the corporate office to manage and initiate the process.&nbsp;Once the shipping store is notified of the request, (i.e., through in person, phone, e-mail, spreadsheet, etc.) a store associate can transfer inventory.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>:&nbsp;In this document, the term 'transfer' refers to store-initiated transfers. For corporate-initiated transfers, refer to the <a hqid=\"2053967\" href=\"/pullbacks-transfers-process\">Pullback & Transfers process flow</a>.</div>\r\n\r\n<div class=\"tip\">To know more on the&nbsp; store-initiated process&nbsp;activity during offline mode, please refer to the&nbsp;<a hqid=\"3324298\" href=\"/store-inventory-and-fulfillment-offline-support\">Store Offline Support</a>&nbsp;page.</div>\r\n\r\n<h4><a name=\"transfer-order-creation\" id=\"transfer-order-creation\"></a><a id=\"Transfer Order Creation\" name=\"Transfer Order Creation\"></a>Transfer Order Creation</h4>\r\n\r\n<p>A transfer order can be created&nbsp;by a store associate in&nbsp;the shipping location. To create a transfer order, the list of operational stores will be automatically displayed for the store associates, which aids in choosing the required ship to location&nbsp;(which can be any location in the store's organization) as well as the carrier and service level to ship with. Both parcel and non-parcel carriers are supported. Please refer to Transfer Types section to know more about how specific locations for a transfer type can also be created. A fulfillment header is then created with no lines. Notable attribute values are listed below:</p>\r\n\r\n<ul>\r\n\t<li>Order Type Id = \"StoreInitiated\"</li>\r\n\t<li>Delivery Method Id = \"ShipToLocation\"</li>\r\n\t<li>Doc Type Id = \"RetailOrder\"</li>\r\n\t<li>Ship To Location Id =&nbsp;Location chosen/specified by user. (<strong><u>Note:</u> </strong>Ship to location's status must be \"Operational\" and if the status is \"Non-Operational\",&nbsp;then the location won't be shown in the location search result).</li>\r\n\t<li>Shipping Due date = Current date</li>\r\n\t<li>Is Return Label Required = False</li>\r\n\t<li>Min and Max Status Id = Created</li>\r\n</ul>\r\n\r\n<p>The Create Transfer service is used to create a store-initiated transfer order.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: FulfillmentId is a system generated nextup number, with prefix \"F\".&nbsp;Store initiated transfer order (such as FulfillmentId) uniqueness must be maintained when&nbsp;bridged into the system. The project team must implement User Exit if it is required to&nbsp;generate a custom FulfillmentId.</div>\r\n\r\n<h4><a name=\"transfer-types\" id=\"transfer-types\"></a><a id=\"TransferTypes\" name=\"TransferTypes\"></a>Transfer Types</h4>\r\n\r\n<p>Transfer types indicate&nbsp;the reason for transfer, such as returning damaged goods to DC, store-to-store transfer or returning goods to a vendor. By configuring transfer types, transfer orders can be easily created by store associates. Transfer types&nbsp;contain pre-configured details related to the transfer which are used when an associate creates a transfer,&nbsp;reducing decisions and inputs needed by the store associate.&nbsp;The store disposition (supply type), eligible locations types/locations,&nbsp;package receipt type, default carrier and service level are defined for the transfer type. A maximum quantity to pack can also be specified.</p>\r\n\r\n<p>To create a transfer order, the associate first selects a&nbsp;transfer type. If a default transfer type is configured, it is pre-selected. The store associate can change this default value based on permission. If the associate has permission, the list of available transfer types is sorted based on a configuration sort sequence. If only one transfer type is available, it is automatically selected.&nbsp; Once the transfer type is selected, the store disposition configured for the transfer type is displayed.</p>\r\n\r\n<p>Next, the&nbsp;associate enters the ship to location. The ship to locations which the associate can select are based on configuration in the transfer type. The transfer type can be limited to a specific list of location ID(s), one or more location type(s), or any location in the organization. If at least one location ID is configured for the transfer type, then that location list takes precedence and defines the valid list of locations which the transfer type can be sent to. If no location IDs are defined, then the location type(s) list defines which location are allowed. If neither&nbsp;are defined, the transfer type is valid for any location in the organization.&nbsp;Refer to the <a href=\"https://omni.helpdocsonline.com/store-initiated-transfers-config$eligible-transfer-locations\">Configuration guide</a> for additional details on configuring the eligible transfer locations.</p>\r\n\r\n<div class=\"tip\"><strong>Note: </strong>A maximum of 50 location IDs is supported.&nbsp;If more are configured, only the first 50 can be selected by the&nbsp;store associate.</div>\r\n\r\n<p>If the default carrier and service level are configured for the transfer type, those values are pre-selected during the transfer order creation. If the associate has permission to change carrier and/or service level, then they can change the default selection. Both parcel and non-parcel carriers are supported.&nbsp;A Fulfillment Header is then created with no lines as mentioned in the Transfer Order section.</p>\r\n\r\n<p>The store associate can optionally enter the comments specific to the transfer type. Comments are saved as Fulfillment Instructions.</p>\r\n\r\n<p>Store-initiated transfer order creation by transfer type is enabled by the Store Fulfillment Parameter&nbsp;“Enable transfer type selection during store-initiated transfer” flag. Refer to the <a hqid=\"2276791\" href=\"/store-initiated-transfers-config\">Configuration guide</a> for additional details.</p>\r\n\r\n<h4><a name=\"transfers-across-organizations\" id=\"transfers-across-organizations\"></a><a id=\"cross-org-transfers\" name=\"cross-org-transfers\"></a>Transfers across Organizations</h4>\r\n\r\n<p>Retailers can allow stores to transfer inventory across&nbsp;organizations based&nbsp;on the \"Allow Store Initiated Transfer across organizations\" flag for the&nbsp;transfer type. In addition, the location type(s) which the transfer type supports and the list of organizations that can be transferred to&nbsp;must be configured. Based on these configurations, associates can specify a valid destination when creating a store-initiated transfer. In order to create the transfer, the associate must have access to the destination's organization (not required to assign a&nbsp;role).&nbsp;Refer to the <a hqid=\"2276791\" href=\"/store-initiated-transfers-config\">Configuration guide</a> for additional details.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Cross-organization transfers are supported for transfers created using transfer types.</div>\r\n\r\n<p>Take an example of where the store belongs to the organization GMP-US:</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 617px;\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Transfer Type</td>\r\n\t\t\t<td>Allow Store Initiated Transfer across organizations</td>\r\n\t\t\t<td>Location Type</td>\r\n\t\t\t<td>Allowed Destinations</td>\r\n\t\t\t<td style=\"width: 196px;\">Store-Initiated Transfer Process-&gt;Select Destinations flow</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Return damaged goods</td>\r\n\t\t\t<td>Y</td>\r\n\t\t\t<td>DC</td>\r\n\t\t\t<td>GMP (parent org)</td>\r\n\t\t\t<td style=\"width: 196px;\">Displays locations of type \"Distribution Center\" belonging to the organization GMP and GMP-US (store's organization)</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Replenish Inventory</td>\r\n\t\t\t<td>Y</td>\r\n\t\t\t<td>Store</td>\r\n\t\t\t<td>GMP-Canada</td>\r\n\t\t\t<td style=\"width: 196px;\">Displays locations of type \"Store\" belonging to the organization GMP-Canada and GMP-US (store's organization)</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Store to Store Transfer&nbsp;</td>\r\n\t\t\t<td>N</td>\r\n\t\t\t<td>Store</td>\r\n\t\t\t<td>N/A</td>\r\n\t\t\t<td style=\"width: 196px;\">Displays locations of type \"Store\" belonging to the organization GMP-US (store's organization)</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<h4><a name=\"transfer-nbsp-orders-list\" id=\"transfer-nbsp-orders-list\"></a>Transfer&nbsp;Orders List</h4>\r\n\r\n<p>While store-initiated transfer orders are often created, packed and shipped in one continuous flow, the functionality also supports&nbsp;handing off the packing (of different packages) to other associate(s).&nbsp;If any created transfer&nbsp;is not yet closed and is not currently being packed by another associate, the associate can choose to pack it, or create a new one. The following information is presented for each order:</p>\r\n\r\n<ul>\r\n\t<li>Fulfillment Id</li>\r\n\t<li>Ship-to location</li>\r\n\t<li>Shipping Due date</li>\r\n\t<li>Current status</li>\r\n\t<li>Number of packed units</li>\r\n</ul>\r\n\r\n<p>The list is sorted by the shipping due date in ascending order. The Get Transfers List&nbsp;service is used to get the list of store-initiated transfer&nbsp;orders that an associate can work on. The Get Transfer Details&nbsp;service is used to get the details of each existing&nbsp;store-initiated transfer&nbsp;order.</p>\r\n\r\n<p>If the “Enable transfer type selection during store-initiated transfer” parameter is enabled, then the transfer orders list shows the transfer type for each transfer order.</p>\r\n\r\n<h4><a name=\"picking\" id=\"picking\"></a>Picking</h4>\r\n\r\n<p>Picking is performed offline based on an inventory request to the other location.</p>\r\n\r\n<h4><a name=\"packing\" id=\"packing\"></a><a id=\"SIT Packing\" name=\"SIT Packing\"></a>Packing</h4>\r\n\r\n<p>Once the order is created, associates can immediately begin scanning items and packing them into one or more package(s).&nbsp;The receipt type on&nbsp;the package is updated based on the configured receipt type for the store-initiated transfers. Refer to the <a hqid=\"2276791\" href=\"/store-initiated-transfers-config\">configuration guide</a> for additional information.&nbsp;The delivery type of the package is store inventory.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: PackageId is a system generated nextup number, with prefix \"P\".&nbsp;The uniqueness of the package must be maintained when package IDs are bridged into the system. The project team can implement&nbsp;custom prefix (e.g. ‘XYZ', ‘PACK’, ‘1001’, 200000’) by setting&nbsp;Consul property&nbsp;\"<code data-renderer-mark=\"true\">packageIdPrefix\"</code> in the fulfillment component&nbsp;(Default is set to 'P').</div>\r\n\r\n<p>An<span style=\"color:#e74c3c;\">&nbsp;</span>associate can only pack one store-initiated transfer at a time.<span style=\"color:#e74c3c;\">&nbsp;</span>If the associate has started packing an order and the package is not closed, the system does not allow the associate to perform packing of any other store-initiated transfer order&nbsp;until the first order's package is closed. If another user with appropriate grants tries to pack the same order, an error message ‘Another user (along with his username) is working on this order’&nbsp; is displayed.&nbsp;</p>\r\n\r\n<p>If the “Enable transfer type selection during store-initiated transfer” parameter is enabled, then the transfer type is displayed during packing.</p>\r\n\r\n<p>As each package is finished, the corresponding shipping documents are printed.&nbsp;Note that the packing slip for the packages do not contain Order and Order date populated as these are initiated by the store.&nbsp;The Finish Package service is used to close the package.</p>\r\n\r\n<div class=\"tip\"><strong>Note: </strong>Associates should pack a maximum of&nbsp;100 item IDs into a single package in order to maintain good responsiveness in the app.</div>\r\n\r\n<h5><a name=\"maximum-quantity-per-item\" id=\"maximum-quantity-per-item\"></a><strong>Maximum Quantity per Item</strong></h5>\r\n\r\n<p>The maximum quantity of an item in a package can be limited to a configured value.&nbsp;This configuration is helpful in limiting the damage caused by incorrect packed quantities. Refer to the&nbsp;<a data-renderer-mark=\"true\" href=\"https://omni.helpdocsonline.com/store-initiated-transfers-config$limit-maximum-quantity\" title=\"https://omni.helpdocsonline.com/adjust-inventory-configuration\">Configuration guide</a>&nbsp;for additional information.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: The maximum limit is applied to each item in the package. For example, if the maximum allowed quantity is 5,&nbsp;an item can have a maximum of 5 quantities. Should additional quantities of the item be required to transfer, additional packages can be created.</div>\r\n\r\n<p>If the “Enable transfer type selection during store-initiated transfer” parameter is enabled, then the maximum quantity of an item in a package configuration specific to the transfer type is used.&nbsp;</p>\r\n\r\n<h5><a name=\"remove-packed-units-from-availability\" id=\"remove-packed-units-from-availability\"></a><strong>Remove Packed Units from Availability</strong></h5>\r\n\r\n<p>Stores can prevent&nbsp;inventory from being made available to selling channels as it is packed for a store-initiated transfer. When an item is scanned for packing, a reservation request can be&nbsp;made to Enterprise Inventory to reduce the unit from availability.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: Each supply type that is used in Store Initiated Transfers must be configured in Enterprise Inventory using the Transfer Supply Type UI in order for inventory of that supply type to be reserved.</div>\r\n\r\n<p>When the package has been shipped, any&nbsp;reservations for the package are closed. Enterprise Inventory reduces inventory from the origin location and creates an in-transit record for the destination location (if the \"Create in-transit records for shipping inventory from a store to another location\" configuration is enabled.)</p>\r\n\r\n<p>If the package is cancelled before it is shipped, any&nbsp;reservations for the package are&nbsp;cancelled and the units are added back to availability.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: When this feature is enabled and a package is shipped, Enterprise Inventory creates an in-transit record for the reserved inventory&nbsp;based on the package ship&nbsp;reservation outbound message, as opposed to the&nbsp;supply event that would be sent from Fulfillment if this feature was disabled.</div>\r\n\r\n<p>Refer to the <a href=\"https://omni.helpdocsonline.com/store-initiated-transfers-config$remove-packed-units-from-availability\">Configuration guide</a>&nbsp;for additional information on how to enable this feature.</p>\r\n\r\n<h5><a name=\"exceptions\" id=\"exceptions\"></a><strong>Exceptions</strong></h5>\r\n\r\n<p><strong>Cancel Packing</strong></p>\r\n\r\n<p>During packing, a store associate with the appropriate permission can cancel the packing progress for all packages which are already packed ('Built' status) as well as any package that is currently being built ('In Progress' status.) Packages which are already in 'Shipped' or 'Received' status will not be canceled. After packing is canceled, the store associate can resume packing, if desired.</p>\r\n\r\n<p><strong>Pause and Resume Packing</strong></p>\r\n\r\n<p>During packing, a store associate can pause the packing activity if the package is not yet submitted. The associate can later resume the pack activity on the same device, or on another device. The device must be connected with the store's wireless network when resuming the pack activity. The<span style=\"color:#e67e22;\">&nbsp;</span>Resume Packing&nbsp;service is used to resume the pack activity on another device.</p>\r\n\r\n<p><strong>Update Package</strong></p>\r\n\r\n<p>An&nbsp;associate with the appropriate permission can modify the shipping options during packing.&nbsp;Refer to the \"Update Package\" section in the&nbsp;<a hqid=\"1808795\" href=\"/shipping-process\">Shipping Process</a>&nbsp;guide for additional information. The updated package functionality is only available with&nbsp;parcel shipping.&nbsp;</p>\r\n\r\n<p><strong>Reassign Task</strong></p>\r\n\r\n<p>Store-initiated transfer tasks can be reassigned to another user in the event that the original&nbsp;associate is unable to complete the task, or must&nbsp;take up higher priority customer work. Since at one point in time an associate can only be assigned&nbsp;one store-initiated transfer&nbsp;task, during reassign only associates with no in progress store-initiated transfer tasks are eligible to take the task. Associates are still eligible for reassignment if they have an in progress customer order pack task or a pullback/transfer pack task.</p>\r\n\r\n<p><strong>Multiple Packers</strong></p>\r\n\r\n<p>While only one associate can pack a particular store-initiated transfer at a point in time, multiple users can pack an order over time without any reassignment by the manager. Once an associate finishes a package (and does not start packing a new package or close the order),&nbsp;the&nbsp;order becomes available for packing to other associates. The same task group is used to complete the work across all of the users that pack an order.</p>\r\n\r\n<h5><a name=\"updates\" id=\"updates\"></a><strong>Updates</strong></h5>\r\n\r\n<p>As packages move to “Shipped” status, it is possible to communicate the shipped package to external system(s) using a fulfillment outbound message. Refer to the <a href=\"https://omni.helpdocsonline.com/store-initiated-transfers-config\" title=\"https://omni.helpdocsonline.com/adjust-inventory-configuration\">Configuration guide</a> for additional information.</p>\r\n\r\n<p><strong>Inventory Updates</strong></p>\r\n\r\n<p>Once a package is shipped,&nbsp;inventory gets reduced from the origin location and in-transit record gets created for the destination location.</p>\r\n\r\n<p>The following information is sent&nbsp;to the Inventory Management for audit purposes when inventory is updated:</p>\r\n\r\n<ul>\r\n\t<li>Inventory Transaction Type - If the override store transaction type is configured for the store transaction type \"Ship\" for ASN creation and \"Ship Store Transfer\" for adjustment of inventory at the origin location, the inventory transaction type is populated with the override value. If no override is configured, the base&nbsp;value&nbsp;is sent.</li>\r\n\t<li>Inventory Transaction ID&nbsp;-&nbsp; Fulfillment Id and Package Id are sent to identify the store-initiated transfer transaction.</li>\r\n</ul>\r\n\r\n<p>If the “Enable transfer type selection during store-initiated transfer” parameter is enabled, then the supply type configured for the&nbsp;transfer type is sent. Additionally, Transfer Type ID is sent as a relay attribute so that the destination gets visibility of the type of the store initiated transfer and&nbsp;can plan next steps if needed. Transfer type provides visibility into the business reason for the transfer.</p>\r\n\r\n<h4><a name=\"rfid\" id=\"rfid\"></a>RFID</h4>\r\n\r\n<p>Store associates can pack&nbsp;store-initiated orders using Radio Frequency Identification (RFID). When the RFID store-initiated transfer&nbsp;business configuration is enabled, store associates can use a handheld RFID reader to read the Item's unit-level RFID tags rather than scanning the item's barcode for packing. The Store application decodes the GTIN-14 from the unit-level tag to validate that the correct item(s) is being packed.&nbsp;Refer to the&nbsp;<a hqid=\"2195072\" href=\"/storerfid\">Store RFID guide</a>&nbsp;for additional information.&nbsp;</p>\r\n\r\n<p>The base default reader range for store-initiated transfer is set to \"Short\" so that the reader will not read additional RFID tags that are not meant for order.</p>\r\n\r\n<h5><a name=\"pack-tagged-and-non-tagged-units\" id=\"pack-tagged-and-non-tagged-units\"></a><a id=\"pack-tagged-and-non-tagged-units\" name=\"pack-tagged-and-non-tagged-units\"></a>Pack tagged and non-tagged units</h5>\r\n\r\n<p>Store associates can pack both tagged and untagged item units into a package. For tagged units, they can use a handheld reader, while for non-tagged units, they can scan the item barcode. Associates can navigate to the item details UI to view additional details of the item and adjust any inadvertently scanned non-RFID-tagged units of the item. This UI doesn't support RFID mode.&nbsp;</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>:&nbsp;Support for packing store-initiated transfer packages having a mix of RFID-tagged and untagged items is now available and is planned to be automatically enabled as part of the 25.4 market release. If you would like to opt in early, contact your Manhattan representative.</div>\r\n\r\n<div class=\"tip\"><strong>Note:&nbsp;</strong>&nbsp;In order to prevent lengthy&nbsp;processing times that could be noticed by the user, associates should&nbsp;limit the number of item IDs that are added to a package to 15 or less per read input. The limit applies only to the number of items that are added to the package in that trigger pull. There is no limit to the number of unit tags that can be read per read input, and the number of item IDs which can be packed into the package over time is 100 which is the same limit as non-RFID.</div>\r\n\r\n<h5><a name=\"exceptions\" id=\"exceptions\"></a><a id=\"exceptions\" name=\"exceptions\"></a><strong>Exceptions</strong></h5>\r\n\r\n<p>During packing, store associates cannot modify the packages to remove item units from the package, and they also cannot manually increase or decrease the RFID-tagged item's quantity from the item details. In the case of the mixed mode scenarios, the non-RFID-tagged items can, however, be adjusted using the item details UI.</p>\r\n\r\n<p>If a store associate cancels the packing of a store-initiated transfer order, the status of any already packed units reverts from \"Reserved\" back to \"Available\". See the Updates section below for further details.</p>\r\n\r\n<p>If a store associate&nbsp;is unable to read the unit-level tag and an EPC or SGTIN barcode is present, they can scan that barcode to perform packing.</p>\r\n\r\n<p>The Store application does not validate the status of the&nbsp;unit (EPC) before packing. For example, if a tag that is read happens to be in the reserved or departed status, the packing will be performed without showing an error to the store associate.</p>\r\n\r\n<p>When the Reserve Inventory during Packing feature is turned on, the store associate initiates packing of the store-initiated transfer order, inventory is reserved against the supply type that is mapped to the unit inventory. If the&nbsp;unit inventory is not mapped to the supply type and&nbsp;transfer type functionality is disabled,&nbsp;the item's on-hand inventory is reserved.&nbsp;If the transfer type feature is enabled, then inventory is reserved based on the supply type that is mapped with the inventory type.</p>\r\n\r\n<h5><a name=\"updates\" id=\"updates\"></a><a id=\"updates\" name=\"updates\"></a><strong>Updates</strong></h5>\r\n\r\n<p>When the store associate submits the package, the status of the unit inventory record(s) are&nbsp;updated from \"Available\" to \"Reserved\". Once the packages are shipped, the unit inventory status is updated from&nbsp;\"Reserved\" to \"Inbound\" for the destination location.</p>\r\n\r\n<p>In the case of a package having a mix of RFID-tagged and untagged items, no unit inventory records are created for the untagged items;&nbsp;however, inventory supply updates are sent for both RFID-tagged and untagged items.&nbsp;</p>\r\n\r\n<h5><a name=\"cross-organization\" id=\"cross-organization\"></a>Cross-Organization</h5>\r\n\r\n<p>Retailers can pack and ship&nbsp;store initiated orders from one organization's store to another organization's store or DC. When an item's unit inventory has been shipped from one organization's store to another organization's store or DC or Supplier,&nbsp;the item's unit inventory status is updated to \"Departed,\" and a new unit inventory record is created as \"Inbound\" at the receiving location.</p>\r\n\r\n<p>Refer&nbsp;to the&nbsp;<a href=\"https://omni.helpdocsonline.com/cross-org-fulfillment-process\">process guide</a>&nbsp;for additional information about cross-organization feature.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>: The unit inventory that is in an inbound state will be purged after 90 days as per the purge process.</div>\r\n\r\n<h4><a name=\"close-order\" id=\"close-order\"></a>Close Order</h4>\r\n\r\n<p>Once all items for the order are packed, the associate closes the transfer order. The following updates occur to the fulfillment status:</p>\r\n\r\n<ul>\r\n\t<li>If none of the packages on the fulfillment are shipped, the fulfillment moves to 'Packed' status.</li>\r\n\t<li>If any&nbsp;package on the fulfillment is shipped, the fulfillment moves to or remains&nbsp;in a 'Partially Shipped' status.</li>\r\n\t<li>When all the packages are shipped, fulfillment moves to 'Shipped' status.</li>\r\n</ul>\r\n\r\n<p>Once the entire transfer moves to “Shipped” status, it is possible to communicate the transfer to external system(s) using a fulfillment outbound message. Refer to the <a href=\"https://omni.helpdocsonline.com/store-initiated-transfers-config\" title=\"https://omni.helpdocsonline.com/adjust-inventory-configuration\">Configuration guide</a> for additional information.</p>\r\n\r\n<p>The&nbsp;Close Transfer service is used to close the store-initiated transfer order.</p>\r\n\r\n<h5><a name=\"obsolete-orders\" id=\"obsolete-orders\"></a><strong>Obsolete Orders</strong></h5>\r\n\r\n<p>If an order was&nbsp;created by mistake or is no more required by the destination location, it can still be closed using the process above even if no packing has occurred, or if all packing was canceled.</p>\r\n\r\n<h5><a name=\"non-parcel\" id=\"non-parcel\"></a><strong>Non-parcel</strong></h5>\r\n\r\n<p>To support the shipping of&nbsp;store-initiated transfer orders using a non-parcel carrier, the retailer must configure&nbsp;a job scheduler to move&nbsp;the non-parcel packages to shipped status. Refer to the <a hqid=\"2276791\" href=\"/store-initiated-transfers-config\">configuration guide</a> for additional information.</p>\r\n\r\n<div class=\"tip\"><strong>Note</strong>:&nbsp;Supporting customization of the non-parcel carriers shipping label - SIT&nbsp;</div>\r\n\r\n<ul>\r\n\t<li>Customization of shipping labels for non-parcel carriers supported within Store-Initiated Transfers and Pullbacks & Transfers workflows.</li>\r\n\t<li>In the absence of customization, Store-Initiated Transfers and Pullbacks & Transfers operate using standard Non-Parcel Shipping Labels without impact.</li>\r\n\t<li>Reprint functionality available with or without a customized Non-Parcel Shipping Label.</li>\r\n\t<li>&nbsp;If no customization defined, reprints use the standard shipping label.</li>\r\n\t<li>If a customized label defined, the reprint process utilizes the customized label.</li>\r\n</ul>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;• To pass additional data into a customized report, implementation of a User Exit required. (Note: This approach aligns with existing methods for customizing report labels.)</p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; • Changes not controlled or restricted by business parameters.&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</p>\r\n\r\n<h4><a name=\"troubleshooting\" id=\"troubleshooting\"></a>Troubleshooting</h4>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\">Issue</th>\r\n\t\t\t<th scope=\"col\">Troubleshooting Tip</th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>\r\n\t\t\t<p>Unable to create reservations for packed units.</p>\r\n\t\t\t</td>\r\n\t\t\t<td>\r\n\t\t\t<p>Ensure that the profile ID \"ful::messaging\" is copied&nbsp;from the base profile to the custom profile.</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<h4><a name=\"services\" id=\"services\"></a>Services</h4>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>The&nbsp;APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on&nbsp;each service.</p>\r\n\r\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:1000px;\">\r\n\t<thead>\r\n\t\t<tr>\r\n\t\t\t<th scope=\"col\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service</font></th>\r\n\t\t\t<th scope=\"col\">Component</th>\r\n\t\t\t<th scope=\"col\">Group</th>\r\n\t\t\t<th scope=\"col\"><font face=\"Open Sans, Arial, Helvetica, sans-serif\">Service Endpoint</font></th>\r\n\t\t</tr>\r\n\t</thead>\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<td>Create&nbsp;Transfer</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-adhoc-transfer-controller</td>\r\n\t\t\t<td>/fulfillment/api/fulfillment/fulfillment/createAdhocTransfer</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Get Transfers List</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-adhoc-transfer-controller</td>\r\n\t\t\t<td>\r\n\t\t\t<p>/fulfillment/api/storefacade/fulfillment/listStoreInitiatedTransfers</p>\r\n\t\t\t</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Get Transfer Details</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-adhoc-transfer-controller</td>\r\n\t\t\t<td>/fulfillment/api/fulfillment/adhocTransfer/fulfillmentId/{fulfillmentId}</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Create Package</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-adhoc-transfer-controller</td>\r\n\t\t\t<td>/fulfillment/api/fulfillment/fulfillment/createAdhocPackage</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Finish Package</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-adhoc-transfer-controller</td>\r\n\t\t\t<td>/fulfillment/api/fulfillment/adhocTransfer/pack</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Resume Packing</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-adhoc-transfer-controller</td>\r\n\t\t\t<td>/fulfillment/api/fulfillment/adhocTransfer/resumePack</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>Close Transfer</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-adhoc-transfer-controller</td>\r\n\t\t\t<td>/fulfillment/api/fulfillment/adhocTransfer/closeOrder</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>RFID - Create Package</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-adhoc-transfer-controller</td>\r\n\t\t\t<td>/fulfillment/api/fulfillment/fulfillment/createAdhocPackage</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>RFID - Finish Package</td>\r\n\t\t\t<td>Fulfillment</td>\r\n\t\t\t<td>fulfillment-adhoc-transfer-controller</td>\r\n\t\t\t<td>/fulfillment/api/fulfillment/adhocTransfer/pack</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>\r\n\r\n\t  </div>\r\n </div>\r\n <div id=\"ui-page-fb-wrap\"></div>\r\n <div class=\"hiq-footer-wrap\">\r\n    \r\n                \r\n  </div>\r\n\r\n\r\n</div>\r\n\r\n\r\n\r\n\r\n\r\n",
  "content_length": 33765,
  "scraped_at": "2025-08-09T22:05:18.300985",
  "content_clean": "Home ››Manhattan Active® Omni››Store››Process & Configuration Guides››Store Inventory & Fulfillment››Store Inventory Management››Store-Initiated Transfers ››Store-Initiated Transfer Process Store-Initiated Transfer Process Store-Initiated Transfer ProcessTransfer Order CreationTransfer TypesTransfers across OrganizationsTransfer Orders ListPickingPackingMaximum Quantity per ItemRemove Packed Units from AvailabilityExceptionsUpdatesRFIDPack tagged and non-tagged unitsExceptionsUpdatesCross-OrganizationClose OrderObsolete OrdersNon-parcelTroubleshootingServices Manhattan Active Store now allows stores to initiate inventory transfers to another location in order for the store to quickly respond to adhoc transfer requests. For example, if a district manager sees that one store in the region has a low inventory level for a popular promotional item while another store has a much higher inventory level, the store with excess inventory can now create a store-initiated transfer to replenish the other store. Store-initiated transfers allow stores to be self-sufficient by directly creating transfer orders without the need for the corporate office to manage and initiate the process. Once the shipping store is notified of the request, (i.e., through in person, phone, e-mail, spreadsheet, etc.) a store associate can transfer inventory. Note: In this document, the term 'transfer' refers to store-initiated transfers. For corporate-initiated transfers, refer to the Pullback & Transfers process flow. To know more on the  store-initiated process activity during offline mode, please refer to the Store Offline Support page. Transfer Order Creation A transfer order can be created by a store associate in the shipping location. To create a transfer order, the list of operational stores will be automatically displayed for the store associates, which aids in choosing the required ship to location (which can be any location in the store's organization) as well as the carrier and service level to ship with. Both parcel and non-parcel carriers are supported. Please refer to Transfer Types section to know more about how specific locations for a transfer type can also be created. A fulfillment header is then created with no lines. Notable attribute values are listed below: Order Type Id = \"StoreInitiated\" Delivery Method Id = \"ShipToLocation\" Doc Type Id = \"RetailOrder\" Ship To Location Id = Location chosen/specified by user. (Note: Ship to location's status must be \"Operational\" and if the status is \"Non-Operational\", then the location won't be shown in the location search result). Shipping Due date = Current date Is Return Label Required = False Min and Max Status Id = Created The Create Transfer service is used to create a store-initiated transfer order. Note: FulfillmentId is a system generated nextup number, with prefix \"F\". Store initiated transfer order (such as FulfillmentId) uniqueness must be maintained when bridged into the system. The project team must implement User Exit if it is required to generate a custom FulfillmentId. Transfer Types Transfer types indicate the reason for transfer, such as returning damaged goods to DC, store-to-store transfer or returning goods to a vendor. By configuring transfer types, transfer orders can be easily created by store associates. Transfer types contain pre-configured details related to the transfer which are used when an associate creates a transfer, reducing decisions and inputs needed by the store associate. The store disposition (supply type), eligible locations types/locations, package receipt type, default carrier and service level are defined for the transfer type. A maximum quantity to pack can also be specified. To create a transfer order, the associate first selects a transfer type. If a default transfer type is configured, it is pre-selected. The store associate can change this default value based on permission. If the associate has permission, the list of available transfer types is sorted based on a configuration sort sequence. If only one transfer type is available, it is automatically selected.  Once the transfer type is selected, the store disposition configured for the transfer type is displayed. Next, the associate enters the ship to location. The ship to locations which the associate can select are based on configuration in the transfer type. The transfer type can be limited to a specific list of location ID(s), one or more location type(s), or any location in the organization. If at least one location ID is configured for the transfer type, then that location list takes precedence and defines the valid list of locations which the transfer type can be sent to. If no location IDs are defined, then the location type(s) list defines which location are allowed. If neither are defined, the transfer type is valid for any location in the organization. Refer to the Configuration guide for additional details on configuring the eligible transfer locations. Note: A maximum of 50 location IDs is supported. If more are configured, only the first 50 can be selected by the store associate. If the default carrier and service level are configured for the transfer type, those values are pre-selected during the transfer order creation. If the associate has permission to change carrier and/or service level, then they can change the default selection. Both parcel and non-parcel carriers are supported. A Fulfillment Header is then created with no lines as mentioned in the Transfer Order section. The store associate can optionally enter the comments specific to the transfer type. Comments are saved as Fulfillment Instructions. Store-initiated transfer order creation by transfer type is enabled by the Store Fulfillment Parameter “Enable transfer type selection during store-initiated transfer” flag. Refer to the Configuration guide for additional details. Transfers across Organizations Retailers can allow stores to transfer inventory across organizations based on the \"Allow Store Initiated Transfer across organizations\" flag for the transfer type. In addition, the location type(s) which the transfer type supports and the list of organizations that can be transferred to must be configured. Based on these configurations, associates can specify a valid destination when creating a store-initiated transfer. In order to create the transfer, the associate must have access to the destination's organization (not required to assign a role). Refer to the Configuration guide for additional details. Note: Cross-organization transfers are supported for transfers created using transfer types. Take an example of where the store belongs to the organization GMP-US: Transfer Type Allow Store Initiated Transfer across organizations Location Type Allowed Destinations Store-Initiated Transfer Process->Select Destinations flow Return damaged goods Y DC GMP (parent org) Displays locations of type \"Distribution Center\" belonging to the organization GMP and GMP-US (store's organization) Replenish Inventory Y Store GMP-Canada Displays locations of type \"Store\" belonging to the organization GMP-Canada and GMP-US (store's organization) Store to Store Transfer N Store N/A Displays locations of type \"Store\" belonging to the organization GMP-US (store's organization) Transfer Orders List While store-initiated transfer orders are often created, packed and shipped in one continuous flow, the functionality also supports handing off the packing (of different packages) to other associate(s). If any created transfer is not yet closed and is not currently being packed by another associate, the associate can choose to pack it, or create a new one. The following information is presented for each order: Fulfillment Id Ship-to location Shipping Due date Current status Number of packed units The list is sorted by the shipping due date in ascending order. The Get Transfers List service is used to get the list of store-initiated transfer orders that an associate can work on. The Get Transfer Details service is used to get the details of each existing store-initiated transfer order. If the “Enable transfer type selection during store-initiated transfer” parameter is enabled, then the transfer orders list shows the transfer type for each transfer order. Picking Picking is performed offline based on an inventory request to the other location. Packing Once the order is created, associates can immediately begin scanning items and packing them into one or more package(s). The receipt type on the package is updated based on the configured receipt type for the store-initiated transfers. Refer to the configuration guide for additional information. The delivery type of the package is store inventory. Note: PackageId is a system generated nextup number, with prefix \"P\". The uniqueness of the package must be maintained when package IDs are bridged into the system. The project team can implement custom prefix (e.g. ‘XYZ', ‘PACK’, ‘1001’, 200000’) by setting Consul property \"packageIdPrefix\" in the fulfillment component (Default is set to 'P'). An associate can only pack one store-initiated transfer at a time. If the associate has started packing an order and the package is not closed, the system does not allow the associate to perform packing of any other store-initiated transfer order until the first order's package is closed. If another user with appropriate grants tries to pack the same order, an error message ‘Another user (along with his username) is working on this order’  is displayed. If the “Enable transfer type selection during store-initiated transfer” parameter is enabled, then the transfer type is displayed during packing. As each package is finished, the corresponding shipping documents are printed. Note that the packing slip for the packages do not contain Order and Order date populated as these are initiated by the store. The Finish Package service is used to close the package. Note: Associates should pack a maximum of 100 item IDs into a single package in order to maintain good responsiveness in the app. Maximum Quantity per Item The maximum quantity of an item in a package can be limited to a configured value. This configuration is helpful in limiting the damage caused by incorrect packed quantities. Refer to the Configuration guide for additional information. Note: The maximum limit is applied to each item in the package. For example, if the maximum allowed quantity is 5, an item can have a maximum of 5 quantities. Should additional quantities of the item be required to transfer, additional packages can be created. If the “Enable transfer type selection during store-initiated transfer” parameter is enabled, then the maximum quantity of an item in a package configuration specific to the transfer type is used. Remove Packed Units from Availability Stores can prevent inventory from being made available to selling channels as it is packed for a store-initiated transfer. When an item is scanned for packing, a reservation request can be made to Enterprise Inventory to reduce the unit from availability. Note: Each supply type that is used in Store Initiated Transfers must be configured in Enterprise Inventory using the Transfer Supply Type UI in order for inventory of that supply type to be reserved. When the package has been shipped, any reservations for the package are closed. Enterprise Inventory reduces inventory from the origin location and creates an in-transit record for the destination location (if the \"Create in-transit records for shipping inventory from a store to another location\" configuration is enabled.) If the package is cancelled before it is shipped, any reservations for the package are cancelled and the units are added back to availability. Note: When this feature is enabled and a package is shipped, Enterprise Inventory creates an in-transit record for the reserved inventory based on the package ship reservation outbound message, as opposed to the supply event that would be sent from Fulfillment if this feature was disabled. Refer to the Configuration guide for additional information on how to enable this feature. Exceptions Cancel Packing During packing, a store associate with the appropriate permission can cancel the packing progress for all packages which are already packed ('Built' status) as well as any package that is currently being built ('In Progress' status.) Packages which are already in 'Shipped' or 'Received' status will not be canceled. After packing is canceled, the store associate can resume packing, if desired. Pause and Resume Packing During packing, a store associate can pause the packing activity if the package is not yet submitted. The associate can later resume the pack activity on the same device, or on another device. The device must be connected with the store's wireless network when resuming the pack activity. The Resume Packing service is used to resume the pack activity on another device. Update Package An associate with the appropriate permission can modify the shipping options during packing. Refer to the \"Update Package\" section in the Shipping Process guide for additional information. The updated package functionality is only available with parcel shipping. Reassign Task Store-initiated transfer tasks can be reassigned to another user in the event that the original associate is unable to complete the task, or must take up higher priority customer work. Since at one point in time an associate can only be assigned one store-initiated transfer task, during reassign only associates with no in progress store-initiated transfer tasks are eligible to take the task. Associates are still eligible for reassignment if they have an in progress customer order pack task or a pullback/transfer pack task. Multiple Packers While only one associate can pack a particular store-initiated transfer at a point in time, multiple users can pack an order over time without any reassignment by the manager. Once an associate finishes a package (and does not start packing a new package or close the order), the order becomes available for packing to other associates. The same task group is used to complete the work across all of the users that pack an order. Updates As packages move to “Shipped” status, it is possible to communicate the shipped package to external system(s) using a fulfillment outbound message. Refer to the Configuration guide for additional information. Inventory Updates Once a package is shipped, inventory gets reduced from the origin location and in-transit record gets created for the destination location. The following information is sent to the Inventory Management for audit purposes when inventory is updated: Inventory Transaction Type - If the override store transaction type is configured for the store transaction type \"Ship\" for ASN creation and \"Ship Store Transfer\" for adjustment of inventory at the origin location, the inventory transaction type is populated with the override value. If no override is configured, the base value is sent. Inventory Transaction ID -  Fulfillment Id and Package Id are sent to identify the store-initiated transfer transaction. If the “Enable transfer type selection during store-initiated transfer” parameter is enabled, then the supply type configured for the transfer type is sent. Additionally, Transfer Type ID is sent as a relay attribute so that the destination gets visibility of the type of the store initiated transfer and can plan next steps if needed. Transfer type provides visibility into the business reason for the transfer. RFID Store associates can pack store-initiated orders using Radio Frequency Identification (RFID). When the RFID store-initiated transfer business configuration is enabled, store associates can use a handheld RFID reader to read the Item's unit-level RFID tags rather than scanning the item's barcode for packing. The Store application decodes the GTIN-14 from the unit-level tag to validate that the correct item(s) is being packed. Refer to the Store RFID guide for additional information. The base default reader range for store-initiated transfer is set to \"Short\" so that the reader will not read additional RFID tags that are not meant for order. Pack tagged and non-tagged units Store associates can pack both tagged and untagged item units into a package. For tagged units, they can use a handheld reader, while for non-tagged units, they can scan the item barcode. Associates can navigate to the item details UI to view additional details of the item and adjust any inadvertently scanned non-RFID-tagged units of the item. This UI doesn't support RFID mode. Note: Support for packing store-initiated transfer packages having a mix of RFID-tagged and untagged items is now available and is planned to be automatically enabled as part of the 25.4 market release. If you would like to opt in early, contact your Manhattan representative. Note:  In order to prevent lengthy processing times that could be noticed by the user, associates should limit the number of item IDs that are added to a package to 15 or less per read input. The limit applies only to the number of items that are added to the package in that trigger pull. There is no limit to the number of unit tags that can be read per read input, and the number of item IDs which can be packed into the package over time is 100 which is the same limit as non-RFID. Exceptions During packing, store associates cannot modify the packages to remove item units from the package, and they also cannot manually increase or decrease the RFID-tagged item's quantity from the item details. In the case of the mixed mode scenarios, the non-RFID-tagged items can, however, be adjusted using the item details UI. If a store associate cancels the packing of a store-initiated transfer order, the status of any already packed units reverts from \"Reserved\" back to \"Available\". See the Updates section below for further details. If a store associate is unable to read the unit-level tag and an EPC or SGTIN barcode is present, they can scan that barcode to perform packing. The Store application does not validate the status of the unit (EPC) before packing. For example, if a tag that is read happens to be in the reserved or departed status, the packing will be performed without showing an error to the store associate. When the Reserve Inventory during Packing feature is turned on, the store associate initiates packing of the store-initiated transfer order, inventory is reserved against the supply type that is mapped to the unit inventory. If the unit inventory is not mapped to the supply type and transfer type functionality is disabled, the item's on-hand inventory is reserved. If the transfer type feature is enabled, then inventory is reserved based on the supply type that is mapped with the inventory type. Updates When the store associate submits the package, the status of the unit inventory record(s) are updated from \"Available\" to \"Reserved\". Once the packages are shipped, the unit inventory status is updated from \"Reserved\" to \"Inbound\" for the destination location. In the case of a package having a mix of RFID-tagged and untagged items, no unit inventory records are created for the untagged items; however, inventory supply updates are sent for both RFID-tagged and untagged items. Cross-Organization Retailers can pack and ship store initiated orders from one organization's store to another organization's store or DC. When an item's unit inventory has been shipped from one organization's store to another organization's store or DC or Supplier, the item's unit inventory status is updated to \"Departed,\" and a new unit inventory record is created as \"Inbound\" at the receiving location. Refer to the process guide for additional information about cross-organization feature. Note: The unit inventory that is in an inbound state will be purged after 90 days as per the purge process. Close Order Once all items for the order are packed, the associate closes the transfer order. The following updates occur to the fulfillment status: If none of the packages on the fulfillment are shipped, the fulfillment moves to 'Packed' status. If any package on the fulfillment is shipped, the fulfillment moves to or remains in a 'Partially Shipped' status. When all the packages are shipped, fulfillment moves to 'Shipped' status. Once the entire transfer moves to “Shipped” status, it is possible to communicate the transfer to external system(s) using a fulfillment outbound message. Refer to the Configuration guide for additional information. The Close Transfer service is used to close the store-initiated transfer order. Obsolete Orders If an order was created by mistake or is no more required by the destination location, it can still be closed using the process above even if no packing has occurred, or if all packing was canceled. Non-parcel To support the shipping of store-initiated transfer orders using a non-parcel carrier, the retailer must configure a job scheduler to move the non-parcel packages to shipped status. Refer to the configuration guide for additional information. Note: Supporting customization of the non-parcel carriers shipping label - SIT Customization of shipping labels for non-parcel carriers supported within Store-Initiated Transfers and Pullbacks & Transfers workflows. In the absence of customization, Store-Initiated Transfers and Pullbacks & Transfers operate using standard Non-Parcel Shipping Labels without impact. Reprint functionality available with or without a customized Non-Parcel Shipping Label. If no customization defined, reprints use the standard shipping label. If a customized label defined, the reprint process utilizes the customized label. • To pass additional data into a customized report, implementation of a User Exit required. (Note: This approach aligns with existing methods for customizing report labels.) • Changes not controlled or restricted by business parameters. Troubleshooting Issue Troubleshooting Tip Unable to create reservations for packed units. Ensure that the profile ID \"ful::messaging\" is copied from the base profile to the custom profile. Services The APIs listed in the following table are referenced in this document. Refer to the API documentation for additional details on each service. Service Component Group Service Endpoint Create Transfer Fulfillment fulfillment-adhoc-transfer-controller /fulfillment/api/fulfillment/fulfillment/createAdhocTransfer Get Transfers List Fulfillment fulfillment-adhoc-transfer-controller /fulfillment/api/storefacade/fulfillment/listStoreInitiatedTransfers Get Transfer Details Fulfillment fulfillment-adhoc-transfer-controller /fulfillment/api/fulfillment/adhocTransfer/fulfillmentId/{fulfillmentId} Create Package Fulfillment fulfillment-adhoc-transfer-controller /fulfillment/api/fulfillment/fulfillment/createAdhocPackage Finish Package Fulfillment fulfillment-adhoc-transfer-controller /fulfillment/api/fulfillment/adhocTransfer/pack Resume Packing Fulfillment fulfillment-adhoc-transfer-controller /fulfillment/api/fulfillment/adhocTransfer/resumePack Close Transfer Fulfillment fulfillment-adhoc-transfer-controller /fulfillment/api/fulfillment/adhocTransfer/closeOrder RFID - Create Package Fulfillment fulfillment-adhoc-transfer-controller /fulfillment/api/fulfillment/fulfillment/createAdhocPackage RFID - Finish Package Fulfillment fulfillment-adhoc-transfer-controller /fulfillment/api/fulfillment/adhocTransfer/pack"
}